{
    "cik": "923120",
    "company": "GREENBRIER COMPANIES INC",
    "filing_type": "10-K",
    "filing_date": "2022-10-31",
    "period_of_report": "2022-08-31",
    "sic": "3743",
    "state_of_inc": "OR",
    "state_location": "OR",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/923120/0000950170-22-020502-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/923120/000095017022020502/gbx-20220831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/923120/0000950170-22-020502.txt",
    "filename": "923120_10K_2022_0000950170-22-020502.htm",
    "content": "Item 1.\tBUSINESS\nIntroduction\nWe are one of the leading designers, manufacturers and marketers of railroad freight car equipment in North America, Europe, South America and other geographies as opportunities arise. We also are a manufacturer and marketer of marine barges in North America. We also offer railcar management, regulatory compliance services and leasing services to railcar owners or other users of railcars in North America. We are a leading provider of freight railcar wheel services, parts and maintenance in North America. Through unconsolidated affiliates we produce rail and industrial components and have an ownership stake in a railcar manufacturer in Brazil.\nWe operate an integrated business model in North America that combines freight car manufacturing, wheel services, railcar maintenance, component parts, leasing and fleet management services. Our model is designed to provide customers with a comprehensive set of freight car solutions by utilizing our substantial engineering, mechanical and technical capabilities as well as our experienced commercial personnel. Our integrated model allows us to develop cross-selling opportunities and synergies among our various business segments thereby enhancing our margins. We believe our integrated model is difficult to duplicate and provides greater value for our customers and investors.\nWe operate in three reportable segments: Manufacturing; Maintenance Services; and Leasing & Management Services. Financial information about our business segments as well as geographic information is located in Note 18 - Segment Information to our Consolidated Financial Statements.\nThe Greenbrier Companies, Inc., is incorporated in Oregon. Our principal executive offices are located at One Centerpointe Drive, Suite 200, Lake Oswego, Oregon 97035. Our telephone number is (503) 684-7000 and our Internet website is located at http://www.gbrx.com.\nProducts and Services\nManufacturing Segment\nNorth American Railcar Manufacturing - We manufacture most freight railcar types currently in use in the North American market (other than coal cars) and we continue to expand our product features and functionality. We have demonstrated an ability to capture high market shares in many of the car types we produce. The primary products we produce for the North American market are:\nConventional Railcars - We produce a variety of covered hopper cars for cement, fertilizer, grain, plastic pellets and grain mill products as well as gondolas and open top hoppers for steel, scrap and aggregates. We also produce a wide range of boxcars, which are used in the transport of paper products, perishables and general merchandise. Our flat car products include center partition cars for the forest products industry and heavy-duty flat cars.\nTank Cars - We produce a variety of tank cars, including general purpose, pressurized, and stainless steel. These are designed for the transportation of hazardous and non-hazardous commodities such as petroleum products, ethanol, liquefied petroleum gas, petrochemicals, caustic soda, chlorine, fertilizers, vegetable oils, bio-diesel and various other products.\nIntermodal Railcars - We manufacture a comprehensive portfolio of intermodal railcars. Our Maxi-Stack I and Maxi-Stack III are the most popular double-stack railcar well cars. The double-stack railcar is designed to transport containers stacked two-high on a single platform and provides significant operating and capital savings over other types of intermodal railcars.\nAutomotive - We manufacture a full line of railcar equipment specifically designed for the transportation of light vehicles. Our automotive offerings include the Auto-Max II, Multi-Max and Multi-Max Plus products, which are designed to carry automobiles, CUVs, SUVs, trucks and high sided vans efficiently.\nSustainable Conversions - We are a leading designer and manufacturer of Sustainable Conversions, which repurposes existing railcars into new equipment service. Our sustainable conversions are an efficient, environmentally sustainable and cost-savings option for railcar owners looking to diversify and optimize their fleets. We rebody or stretch covered hoppers into larger cubic service, re-rack or perform deck conversion on auto racks, and perform tank car retrofits to help customers manage pending regulations.\nEuropean Railcar Manufacturing - Our European manufacturing operations produce a variety of tank, automotive and conventional freight railcar types, including a comprehensive line of pressurized tank cars for liquid petroleum, LPG gas, chlorine and ammonia and non-pressurized tank cars for light oil, chemicals and other products. In addition, our European manufacturing operations produce flat cars, cars for coil steel and metals, gondolas, intermodal cars, sliding wall cars, hoppers and automobile transport cars.\nMarine Vessel Fabrication - We manufacture a broad range of Jones Act ocean-going and river barges for transporting merchandise between ports within the United States. Our primary focus is on the larger ocean-going vessels although we have the capability to compete in other marine-related products. Our Portland, Oregon manufacturing facility, located on a deep-water port on the Willamette River, includes marine vessel fabrication capabilities.\nMaintenance Services Segment\nWheel Services - We operate a wheel services network in North America. Our wheel shops provide complete wheel services including reconditioning of wheels and axles in addition to new axle machining, finishing and downsizing.\nRailcar Maintenance - We operate a railcar maintenance network in North America including shops certified by the Association of American Railroads (AAR). Our shops perform routine railcar maintenance for third parties and for our leased and managed railcar fleets.\nComponent Parts Manufacturing - Our component parts facilities recondition and manufacture railcar cushioning units, couplers, yokes, side frames, bolsters and various other parts. We also produce roofs, doors and associated parts for boxcars.\nLeasing & Management Services Segment\nLeasing - We operate a railcar leasing business in North America through a number of subsidiaries. Our relationships with financial institutions and operating lessors combined with our ownership of a lease fleet of approximately 12,200 railcars enables us to offer flexible financing programs to our customers including operating leases of varied intervals and per diem leases. The percentage of owned units on lease was 98.4% at August 31, 2022 with an average remaining lease term of 3.7 years and an average age of 9 years. We also originate leases of railcars, which are either newly built or refurbished by our operations, or bought in the secondary market. These may be held in the fleet or sold with attached leases to financial institutions or other investors, typically with multi-year management services agreements. As an equipment owner and an originator of leases, we participate principally in the operating lease segment of the market. Assets from our owned lease fleet are periodically sold to accommodate customer demand, manage risk and maintain liquidity.\nIn February 2022, GBX Leasing, one of our subsidiaries, completed its inaugural offering of railcar asset-backed securities (ABS).\nManagement Services - Our North American management services business offers a broad array of software and services that include railcar maintenance management, railcar accounting services (such as billing and revenue collection, car hire receivable and payable administration), total fleet management (including railcar tracking using proprietary software), fleet logistics, administration and railcar re-marketing. We currently provide management services for a fleet of approximately 408,000 railcars for railroads, shippers, carriers, institutional investors and other leasing and transportation companies in North America. In addition, our Regulatory Services Group offers regulatory, engineering, process consulting and advocacy support to the tank car and petrochemical rail shipper community, among other services. Our management services business is responsible for a majority of the maintenance and administration of our fleet of railcars.\nUnconsolidated Affiliates\nU.S. Axle Manufacturing - We have a 41.9% interest in Axis, LLC (Axis), a joint venture that manufactures and sells axles to its joint venture partners for use and distribution both domestically and internationally.\nBrazilian Railcar Manufacturing - We have a 60% ownership interest in Greenbrier Maxion-Equipamentos e Serviços Ferroviários S.A. (Greenbrier-Maxion), the leading railcar manufacturer in South America, located near São Paulo, Brazil. Greenbrier-Maxion also assembles bogies and offers a range of aftermarket services including railcar overhaul and refurbishment.\nBrazilian Castings and Component Parts Manufacturing - We have a 29.5% ownership interest in Amsted-Maxion Fundição e Equipamentos Ferroviários S.A. (Amsted-Maxion) based in Cruzeiro, Brazil. Amsted-Maxion is a manufacturer of various castings and components for railcars and other heavy industrial equipment. Amsted-Maxion has a 40% ownership position in Greenbrier-Maxion and is integrated with the operations of our Brazilian railcar manufacturer.\nOther Unconsolidated Affiliates - We have other unconsolidated affiliates which primarily include joint ventures that produce rail and industrial components.\nBacklog\nThe following table depicts our reported railcar backlog subject to third party sale or lease in number of railcars and estimated future revenue value attributable to such backlog, at the dates shown:\nAugust 31,\nNew railcar backlog units (1)\n29,500\n26,600\n24,600\nEstimated future revenue value (in millions) (2)\n$\n3,480\n$\n2,810\n$\n2,420\n(1)Each platform of a railcar is treated as a separate unit.\n(2)Subject to change based on finalization of product mix.\nApproximately 6% of backlog units and estimated value as of August 31, 2022 was associated with our Brazilian manufacturing operation which are accounted for under the equity method.\nBased on current production schedules, approximately 22,100 units in the August 31, 2022 backlog are scheduled for delivery in 2023. The balance of the production is scheduled for delivery in 2024.\nBacklog units for lease may be syndicated to third parties or held in our own fleet depending on a variety of factors. Multi-year supply agreements are a part of rail industry practice. A portion of the orders included in backlog reflects an assumed product mix. Under terms of the orders, the exact mix and pricing will be determined in the future, which may impact backlog. Marine backlog was $31 million and $70 million as of August 31, 2022 and 2021, respectively.\nOur backlog of railcar units and marine vessels is not necessarily indicative of future results of operations. Certain orders in backlog are subject to customary documentation and completion of terms. Customers may attempt to cancel or modify orders in backlog. Historically, little variation has been experienced between the quantity ordered and the quantity actually delivered, though the timing of deliveries may be modified from time to time.\nCustomers\nCustomers across our segments include railroads, leasing companies, financial institutions, shippers, carriers and transportation companies. We have strong, long-term relationships with many of our customers. We believe that our customers preference for high quality products, our technological leadership in developing innovative products, our focus on being highly responsive to our customers needs and competitive pricing of our railcars have helped us maintain our long-standing relationships with our customers.\nIn 2022, revenue from three customers accounted for approximately 39% of total revenue which represented 44% of Manufacturing revenue, 17% of Maintenance Services revenue, and 2% of Leasing & Management Services revenue. No other customers accounted for greater than 10% of total revenue.\nRaw Materials and Components\nOur products require a supply of materials including steel and specialty components such as brakes, wheels and axles. Specialty components purchased from third parties represent a significant amount of the cost of most freight cars. Our customers often specify particular components and suppliers of such components. Although the number of alternative suppliers of certain specialty components has declined in recent years, there are at least two available suppliers for substantially all of our components.\nCertain materials and components are periodically in short supply which could potentially impact production at our facilities. We experienced an increase in the price and shortages of certain materials and components during 2022. In an effort to mitigate shortages and reduce supply chain costs, we have entered into strategic alliances and multi-year arrangements for the global sourcing of certain materials and components, we operate a replacement parts business which aids in our vertical integration and we continue to pursue strategic opportunities to protect and enhance our supply chain. We periodically make advance purchases to avoid possible shortages of material due to capacity limitations of component suppliers, shipping and transportation delays and possible price increases.\nIn 2022, the top ten suppliers for all inventory purchases accounted for approximately 49% of total purchases. The top two suppliers accounted for 16% and 10% of total inventory purchases in 2022. No other suppliers accounted for more than 10% of total inventory purchases. We believe we maintain good relationships with our suppliers.\nCompetition\nWe are currently one of the two largest railcar manufacturers competing in North America. There are also a handful of specialty builders who focus on niche markets. We believe that in Europe we are in the top tier of railcar manufacturers. Through our 60% ownership interest in Greenbrier-Maxion, we are the leading railcar manufacturer in South America. The railcar manufacturing industry is becoming more global as customers are purchasing railcars from manufacturers outside of their geographic region. In all railcar markets that we serve, we compete on the basis of quality, price, reliability of delivery, innovative product design, reputation and customer service.\nCompetition in the marine industry is dependent on the type of product produced, customer type, including governmental or commercial, proximity to delivery point, and manufacturing capacity. There are few competitors that focus on the commercial large barge market. We compete on the basis of price, quality, reliability of delivery, launching capacity and experience with certain product types.\nCompetition in the Maintenance Services businesses is dependent on the type of product or service provided. There are many competitors in these businesses. We compete primarily on the basis of quality, timeliness of delivery, customer service, location of shops, price and engineering expertise.\nThere are at least twenty institutions in North America that provide railcar leasing and/or services similar to ours. Many of them are also customers that buy new railcars from our manufacturing facilities and used railcars from our lease fleet, as well as utilize our management and maintenance services. We compete primarily on the basis of quality, price, reliability of delivery, reputation, service offerings and deal structuring and syndication ability. We believe our strong servicing capability and our ability to sell railcars with a lease attached (syndicate railcars), integrated with our manufacturing, maintenance shops, railcar specialization and expertise in particular lease structures provide a strong competitive advantage.\nMarketing and Product Development\nIn North America, we leverage an integrated marketing and sales effort to coordinate relationships in our various segments. We provide our customers with a diverse range of equipment and financing alternatives designed to satisfy each customers unique needs, whether the customer is buying new equipment, sustainable conversion of existing equipment or seeking to outsource the maintenance or management of equipment. These custom programs may involve a combination of railcar products, leasing, sustainable conversions and remarketing services. In addition, we provide customized maintenance management, equipment management, accounting and compliance services and proprietary software solutions.\nIn Europe and South America, we maintain relationships with customers through market-specific sales personnel. Our engineering and technical staff works closely with their customer counterparts on the design and certification of railcars. Many European railroads are state-owned and are subject to European Union (EU) regulations covering the tender of government contracts.\nThrough our research and customer relationships, insights are derived into the potential need for new products and services. Marketing and engineering personnel collaborate to evaluate opportunities and develop new products and services that exceed customers expectations. Research and development costs incurred during the years ended August 31, 2022, 2021 and 2020 were $5.4 million, $6.3 million and $5.8 million, respectively.\nHuman Capital\nWith the oversight of the Board, our CEO and senior leadership are thoughtfully invested in our global workforce. We regularly review our priorities and progress in each of the areas highlighted below.\nSafety - Employee safety is a top priority and we remain dedicated to continuously improving our safety performance over time. Our safety performance is monitored regularly by our CEO, senior leadership and our Board. We are proud of the sustained improvement in our safety statistics even while we have experienced significant increases in headcount. In 2022, our Total Injury Rate improved more than 10% from the end of 2021.\nTalent and Diversity - We recognize that a talented and diverse workforce is critical to our success. This year we continued our focus on attracting talent, while simultaneously retaining and developing our people. During the year, we developed an onboarding framework that is focused on welcoming a diverse workforce by establishing a consistent and inclusive process.\nTo ensure we remain engaged and understand our employees priorities, during 2022 we launched an employee engagement survey. We gained important insights to help our company improve and have developed goals to continue building on our core value of Respect for People.\nDuring 2022, we continued to develop upon our IDEAL (Inclusion, Diversity, Equity, Access and Leadership) commitment by creating six Employee Resource Groups (ERGs). The ERGs are created by employees and offer a space for employees to facilitate development, cultural connection, diversity and understanding within the Greenbrier workforce.\nOur commitment to investing in our people includes enhanced training and development pathways. We continue to offer learning and growth opportunities at all levels, including on-the-job learning, competency-based training, education assistance, tuition reimbursement and leadership development which promote workplace engagement and pathways to grow meaningful, long-term careers.\nCompensation and Benefits - We are facing an unusually competitive compensation environment which could impact our ability to attract and retain talent. To remain competitive globally, we regularly evaluate our compensation programs. This includes reviewing base pay levels for equity both internally and externally and assessing the effectiveness of our short and long-term incentive programs. In addition, we strive to provide competitive health and wellness programs to our employees.\nCommunity Involvement - We believe the best way to build strong communities is by thoughtfully selecting programs that are consistent with our core values and that bring prosperity and well-being to the areas we operate. In 2022 we committed more than $1.5 million in support to the communities where we operate. This included a special contribution to the Grupo Industrial Monclova Pape Foundation to commemorate our 16 years of partnership in the community. The foundation serves the community in Monclova, Coahuila, Mexico through construction of schools, funding a childrens hospital, providing scholarships to students and sponsoring a local engineering school.\nThe items above support our overall emphasis on attracting a diverse talent base and fostering an inclusive culture for our global workforce.\nOur Environmental, Social & Governance Report (ESG) provides additional information regarding our ESG goals and initiatives. It can be found on our website. Information contained on or accessible through our website is not incorporated into, and does not constitute a part of, this filing.\nThe following table summarizes the approximate number of employees by segment as of August 31, 2022 at our consolidated entities:\nNumber of Employees\nManufacturing\n13,500\nMaintenance Services\nLeasing & Management Services (Includes Corporate)\nTotal Employees\n14,400\nIn Manufacturing, approximately 4,000 employees are represented by unions, primarily in Mexico and Europe. We believe we have good union relations. At our Maintenance Services locations, approximately 40 employees are represented by a union.\nPatents and Trademarks\nWe have a proactive program aimed at protecting our intellectual property and the results from our research and development. We have obtained a number of U.S. and non-U.S. patents of varying duration, and pending patent applications, registered trademarks, copyrights and trade names. We believe that manufacturing expertise, the improvement of existing technology and the development of new products are at least as important as patent protection in establishing and maintaining a competitive advantage in our market.\nEnvironmental Matters\nWe are subject to national, state and local environmental laws and regulations concerning, among other matters, air emissions, wastewater discharge, solid and hazardous waste disposal and employee health and safety. Prior to acquiring facilities, we conduct investigations to evaluate the environmental condition of subject properties and may negotiate contractual terms for allocation of environmental exposure arising from prior uses. We operate our facilities in a manner designed to maintain compliance with applicable environmental laws and regulations. Environmental studies have been conducted on certain of our owned and leased properties that indicate additional investigation and some remediation on certain properties may be necessary.\nPortland Harbor Superfund Site\nOur Portland, Oregon manufacturing facility (the Portland Property) is located adjacent to the Willamette River. In December 2000, the U.S. Environmental Protection Agency (EPA) classified portions of the Willamette River bed known as the Portland Harbor, including the portion fronting our manufacturing facility, as a federal \"National Priority List\" or \"Superfund\" site due to sediment contamination (the Portland Harbor Site). Our company and more than 140 other parties have received a \"General Notice\" of potential liability from the EPA relating to the Portland Harbor Site. The letter advised us that we may be liable for the costs of investigation and remediation (which liability may be joint and several with other potentially responsible parties) as well as for natural resource damages resulting from releases of hazardous substances to the site. Ten private and public entities, including our company (the Lower Willamette Group or LWG), signed an Administrative Order on Consent (AOC) to perform a remedial investigation/feasibility study (RI/FS) of the Portland Harbor Site under EPA oversight, and several additional entities did not sign such consent, but nevertheless contributed financially to the effort. The EPA-mandated RI/FS was produced by the LWG and cost over $110 million during a 17-year period. We bore a percentage of the total costs incurred by the LWG in connection with the investigation. Our aggregate expenditure during the 17-year period was not material. Some or all of any such outlay may be recoverable from other responsible parties. The EPA issued its Record of Decision (ROD) for the Portland Harbor Site on January 6, 2017 and accordingly on October 26, 2017, the AOC was terminated.\nSeparate from the process described above, which focused on the type of remediation to be performed at the Portland Harbor Site and the schedule for such remediation, 83 parties, including the State of Oregon and the federal government, entered into a non-judicial mediation process to try to allocate costs associated with remediation of the Portland Harbor Site. Approximately 110 additional parties signed tolling agreements related to such allocations. On April 23, 2009, our company and the other AOC signatories filed suit against 69 other parties due to a possible limitations period for some such claims; Arkema Inc. et al v. A & C Foundry Products, Inc. et al, U.S. District Court, District of Oregon, Case #3:09-cv-453-PK. All but 12 of these parties elected to sign tolling agreements and be dismissed without prejudice, and the case has been stayed by the court until January 14, 2025.\nThe EPA's January 6, 2017 ROD identifies a clean-up remedy that the EPA estimates will take 13 years of active remediation, followed by 30 years of monitoring with an estimated undiscounted cost of $1.7 billion. The EPA typically expects its cost estimates to be accurate within a range of -30% to +50%, but this ROD states that changes in costs are likely to occur. The EPA has identified 15 Sediment Decision Units within the ROD cleanup area. One of the units, RM9W, includes the nearshore area of the river sediments offshore of the Portland Property as well as downstream of the facility. It also includes a portion of our companys riverbank. The ROD does not break down total remediation costs by Sediment Decision Unit. The EPA requested that potentially responsible parties enter AOCs during 2019 agreeing to conduct remedial design studies. Some parties have signed AOCs, including one party with respect to RM9W which includes the area offshore of our Portland Property. We have not signed an AOC in connection with remedial design, but will assist in conducting or funding a portion of the RM9W remedial design.\nThe ROD does not address responsibility for the costs of clean-up, nor does it allocate such costs among the potentially responsible parties. Responsibility for funding and implementing the EPA's selected cleanup remedy will be determined at an unspecified later date. Based on the investigation to date, we believe that we did not contribute in any material way to contaminants of concern in the river sediments or the damage of natural resources in the Portland Harbor Site and that the damage in the area of the Portland Harbor Site adjacent to its property precedes our ownership of the Portland Property. Because these environmental investigations are still underway, sufficient information is currently not available to determine our liability, if any, for the cost of any required remediation or restoration of the Portland Harbor Site or to estimate a range of potential loss. Based on the results of the pending investigations and future assessments of natural resource damages, we may be required to incur costs associated with additional phases of investigation or remedial action, and may be liable for damages to natural resources. In addition, we may be required to perform periodic maintenance dredging in order to continue to launch vessels from our launch ways in Portland, Oregon, on the Willamette River, and the river's classification as a Superfund site could result in some limitations on future dredging and launch activities. Any of these matters could adversely affect our business and Consolidated Financial Statements, or the value of the Portland Property.\nOn January 30, 2017 the Confederated Tribes and Bands of Yakama Nation sued 33 parties including our company as well as the U.S. and the State of Oregon for costs it incurred in assessing alleged natural resource damages to the Columbia River from contaminants deposited in Portland Harbor. Confederated Tribes and Bands of the Yakama Nation v. Air Liquide America Corp., et al., U.S. Court for the District of Oregon Case No. 3i17-CV-00164-SB. The complaint does not specify the amount of damages the plaintiff will seek. The case has been stayed until January 14, 2025.\nOregon Department of Environmental Quality (DEQ) Regulation of Portland Manufacturing Operations\nWe entered into a Voluntary Cleanup Agreement with the Oregon Department of Environmental Quality (DEQ) in which we agreed to conduct an investigation of whether, and to what extent, past or present operations at the Portland Property may have released hazardous substances into the environment. We have also signed an Order on Consent with the DEQ to finalize the investigation of potential onsite sources of contamination that may have a release pathway to the Willamette River. Interim precautionary measures are also required in the order and we are discussing with the DEQ potential remedial actions which may be required. Our aggregate expenditure has not been material, however we could incur significant expenses for remediation. Some or all of any such outlay may be recoverable from other responsible parties.\nRegulation\nWe must comply with the rules of the U.S. Department of Transportation (USDOT) and the administrative agencies it oversees including the Federal Railroad Administration (FRA), the Pipeline and Hazardous Materials Safety Administration (PHMSA), and the Department of Homeland Security (DHS) in the U.S. and Transport Canada (TC) in Canada, each of which administer and enforce laws and regulations relating to railroad safety. More specifically, the transportation of hazardous materials by rail is subject to rigorous oversight by FRA, PHMSA, and DHS. Railroads, acting through the Association of American Railroads (AAR), work in partnership with these and other local, state, and federal entities on hazardous materials-related issues, including train routing, security, tank car design and emergency response. Railroads also require compliance with certain industry best practices which at times exceed federal requirements for trains carrying hazardous materials. These regulations govern equipment and safety appliance standards for freight cars and other rail equipment used in interstate and international commerce throughout North America. The AAR promulgates rules and regulations governing the safety and design of equipment, relationships among railroads and other railcar owners with respect to railcars in interchange, and other matters. The AAR also certifies railcar builders and component manufacturers that provide equipment for use on North American railroads. These regulations require maintaining certifications with the AAR as a railcar builder and maintenance provider and component manufacturer, and products sold and leased by us in North America must meet AAR, TC, PHMSA and FRA standards.\nThe primary regulatory and industry authorities involved in the regulation of the ocean-going barge industry are the U.S. Coast Guard, the Maritime Administration of the USDOT, and private industry classing organizations such as the American Bureau of Shipping.\nOur operations are subject to regulation of health and safety matters by the U.S. Occupational Safety and Health Administration (\"OSHA\") and the Secretaria del Trabajo y Prevision Social (\"STPS\") in Mexico. We believe that we employ appropriate precautions to protect our employees and others from workplace injuries and harmful exposure to materials handled and managed at our facilities. However, claims asserted against us for work-related illnesses or injury and the further adoption of occupational safety and health regulations in the U.S. or in foreign jurisdictions in which we operate could increase our operating costs. While we do not anticipate having to make material expenditures in order to remain in substantial compliance with health and safety laws and regulations, we are unable to predict the ultimate cost of compliance.\nThe regulatory environment in Europe consists of a combination of EU regulations and country specific regulations, including a harmonized set of Technical Standards for Interoperability of freight wagons throughout the EU. The regulatory environment in Brazil consists of oversight from the Ministry of Infrastructure, the National Agency of Ground Transportation and the National Association of Railroad Transporters. In all other countries, we conform to country specific regulations where applicable.\nAdditional Information\nWe are a public reporting company and file annual, quarterly, current and special reports, proxy statements and other information with the SEC. The SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at http://www.sec.gov. Through a link on the Investor Relations section of our website, http://www.gbrx.com, we make available the following filings as soon as reasonably practicable after they are electronically filed with or furnished to the SEC: our Annual Report on Form 10-K; Quarterly Reports on Form 10-Q; Current Reports on Form 8-K; and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended. All such filings are available free of charge. Copies of our Audit Committee Charter, Compensation Committee Charter, Nominating and Corporate Governance Committee Charter, Corporate Governance Guidelines and Code of Business Conduct and Ethics are also available on our web site at http://www.gbrx.com. In addition, each of the reports and documents listed above are available free of charge by contacting our Investor Relations Department at The Greenbrier Companies, Inc., One Centerpointe Drive, Suite 200, Lake Oswego, Oregon 97035. Item 1A.\tRISK FACTORS\nThe following risks could materially and adversely affect our business, financial condition, operating results, liquidity and cash flows, prospects, and stock price. These risks do not identify all risks that we face; other factors, events, or uncertainties currently unknown to us or that we currently do not consider to present significant risks to our business or that emerge in the future could affect us adversely.\nRisks Related to Our Business\nAn economic downturn and economic uncertainty may adversely affect demand for our products and services.\nOur customers are often able to delay replacing rail equipment during economic downturns. Factors affecting the level of customer spending for our products and services include general economic conditions, such as inflation, and other factors such as business confidence in future economic conditions, fears of recession, and the availability and cost of efficient capital, among other factors. Worldwide economic conditions remain uncertain. As global economic conditions continue to be volatile or economic uncertainty increases, trends in business spending may become increasingly unpredictable and subject to reductions and fluctuations. Unfavorable economic conditions may lead our customers to delay or reduce purchases of our products and services, result in lower sales volumes, lower prices, lower lease utilization rates, and decreased revenues and profits.\nIncreases in the price of materials and components used in the production of our products could negatively impact our profit margin on the sale of our products.\nA significant portion of our business depends on the adequate supply of steel, other raw materials, and energy, as well as numerous specialty parts and components, such as brakes, wheels, side frames, bolsters, and bearings for the railcar business, at cost-effective prices. During 2022, we experienced significantly elevated commodity and supply chain costs including the costs of labor, raw materials, energy, fuel, materials and other inputs necessary for the production and distribution of our products, and we expect elevated levels of inflation to continue in 2023. The cost of steel and all other materials used in the production of our railcars represents more than half of our direct manufacturing costs per railcar and in the production of our marine barges represents more than 30% of our direct manufacturing costs per marine barge. If we are not able to purchase materials and energy at competitive prices, our ability to produce and sell our products on a cost-effective basis could be adversely impacted which, in turn, could adversely affect our revenue and profitability. Our fixed-price contracts generally anticipate material price increases and surcharges. If we are unable to adjust our selling prices or have adequate protection in our contracts against changes in material prices, our margins could be adversely affected. Further, although a portion of the costs we must incur to meet our contractual obligations are subject to escalation clauses which allow us to pass through costs to our customers, we will absorb some cost increases thereby decreasing margin on some of our customer contracts.\nDisruptions in the supply of materials and components used in the production of our products could negatively impact our business and results of operations.\nSupply chains were severely disrupted by the COVID-19 global pandemic. Armed conflict in Ukraine has also severely disrupted supply chains for the materials and components that we use in manufacturing our products. Certain materials for our products are currently available from a limited number of suppliers and, as a result, we may have limited control over pricing, availability, and delivery schedules. Additionally, factors beyond our control, including adverse political conditions, trade embargoes, increased tariffs or import duties, inclement weather, natural disasters, terrorism and labor disputes may adversely impact our supply chain, particularly if these conditions or disputes result in work slowdowns, lockouts, strikes, facility closures, or related disruptions. The inability to purchase a sufficient quantity of materials on a timely basis could create disruptions in our production and result in delays while we attempt to engage alternative suppliers. Any such disruption or conditions could harm our business and adversely impact our results of operations. The loss of suppliers or their inability to meet our price, quality, quantity and delivery requirements could have an adverse effect on our ability to manufacture and sell our products on a cost-effective basis.\nShortages of skilled labor, increased labor costs, or failure to maintain good relations with our workforce could adversely affect our operations.\nWe depend on skilled labor in all areas of our business. Some of our facilities are located in areas where demand for skilled labor often exceeds supply. Shortages of some types of skilled labor such as welders and machine operators could restrict our ability to maintain or increase production rates, lead to production inefficiencies and increase our labor costs. Due to the competitive nature of the labor markets in which we operate and the cyclical nature of the railcar industry, the resulting employment cycle increases our risk of not being able to recruit, train and retain the employees we require at efficient costs and on reasonable terms, particularly when the economy expands, production rates are high or competition for such skilled labor increases. We are a party to collective bargaining agreements with various labor unions at some of our operations. Disputes with regard to the terms and conditions of these agreements or our potential inability to negotiate acceptable contracts with these unions in the future could result in, among other things, strikes, work stoppages or other slowdowns by the affected workers. We cannot be assured that our relations with our workforce will remain positive. If our workers were to engage in a strike, work stoppage or other slowdown, or other employees were to become unionized or the terms and conditions in future labor agreements were renegotiated, or if union representation is implemented at such sites and we are unable to agree with the union on reasonable employment terms, including wages, benefits, and work rules, we could experience a significant disruption of our operations and incur higher ongoing labor costs. If we are unable to recruit, train and retain adequate numbers of qualified employees and third party labor providers on a timely basis or at a reasonable cost or on reasonable terms, our business and results of operations could be adversely affected.\nOur business may be negatively impacted as a result of armed conflict in Ukraine.\nIn February 2022, the Russian Federation commenced a military invasion of Ukraine. We cannot predict the full impact of the war in Ukraine, the economic sanctions imposed on Russia, and the related economic and geopolitical instability, including instability in the manufacturing and freight rail markets. Some of our operations, particularly in Europe, have experienced higher energy costs, an increase in the price and decrease in the availability of steel and certain other materials and components, disruptions in transportation and supply chains, and higher manufacturing and borrowing costs. Not all of these costs are subject to escalation and related clauses which allow us to pass through costs to our customers, and there is a risk we will not be successful in renegotiating or managing the implementation of existing agreements to allow us to pass through these increased prices of manufacturing. As a result of these impacts and due to the lack of new railcar orders in Europe during the third quarter of 2022, we have slowed down production at our European manufacturing facilities. These negative factors may continue to occur along with other risks to our business that may emerge which include, among others, prolonged heightened inflation, macroeconomic interventions in response to inflation, cyber disruptions or attacks, and disruptions in credit markets. All of these factors and others could disrupt our business directly and could disrupt the business of our customers thereby reducing or delaying orders of our goods and services. Prolonged civil unrest, political instability or uncertainty, military activities, or broad-based sanctions could have an adverse effect on our operations and business outlook.\nThe COVID-19 coronavirus pandemic, and potential future related decline in global economic activity, as well as governmental reaction to the pandemic could continue to negatively impact our business, liquidity and financial position, results of operations, stock price, and ability to convert backlog to revenue.\nWe currently identify the following factors as the most significant risks to our business due to COVID-19, governmental actions, and economic conditions.\nWe may be prevented from operating our manufacturing facilities, maintenance shops, wheel shops or other worksites due to the illness of our employees, stay-at-home regulations, and employee reluctance to appear for work for many different reasons including the implementation of any government-imposed vaccination or testing mandates. Extended closure of one or more of our large facilities or a material decrease in our available workforce could have a material negative impact on our financial position and results of operations. Labor shortages in the geographies where we operate could prevent us from converting backlog to revenue.\nRisks associated with inflation, currency volatility, increases in interest rates, and a mismatch of supply and demand, each as discussed further in this section.\nRisks associated with the disruptions of the operations of one or more of our customers or suppliers, as discussed further in this section.\nOur indebtedness may increase due to our need to increase borrowing to fund operations during a period of reduced revenue.\nThe market price of our common stock may drop or remain volatile.\nWe may incur significant employee health care costs under our self-insurance programs.\nThe longer the pandemic continues, the more likely that more of the foregoing risks will be realized and that other negative impacts on our business will occur, some of which we cannot now foresee.\nA material disruption in the movement of rail traffic could impair our ability to deliver railcars and other products to our customers in a timely manner which could prevent us from meeting customer demand, reduce our sales, and negatively impact our results of operations.\nOnce a railcar or other product is manufactured in one of our plants, it must be moved by rail to a customer delivery point. In many cases, the manufacturing plant and the delivery point are in different countries. Many different and unrelated factors could cause a delay in our ability to move our goods in a timely manner from the manufacturing plant to the delivery point including physical disruptions such as armed conflict, natural disasters and power outages, strikes, labor stoppages or shortages hindering the operation of railroads and related transportation infrastructure, regulatory and bureaucratic inefficiency and unresponsiveness, and other causes. A material disruption in the movement of rail traffic could negatively impact our business and results of operations.\nEquipment failures, technological failures, costs and inefficiencies associated with changing of production lines, or transfer of production between facilities, could lead to production, delivery, or service curtailments or shutdowns, loss of revenue or higher expenses.\nWe operate a substantial amount of equipment at our production facilities. An interruption in production capabilities or maintenance and repair capabilities at our facilities, as a result of equipment or technology failure, acts of nature, terrorism, costs and inefficiencies associated with changing of production lines or transfer of production between facilities, could reduce or prevent our production, delivery, service, or repair of our products and increase our costs and expenses. A halt of production at any of our manufacturing facilities could severely affect delivery times to our customers. Any significant delay in deliveries not otherwise contractually mitigated could result in cancellation of all or a portion of our orders, cause us to lose future sales, and negatively affect our reputation and our results of operations.\nWe depend on our senior management team and other key employees, and significant attrition within our management team or unsuccessful succession planning for members of our senior management team and other key employees who are at or nearing retirement age, could adversely affect our business.\nOur success depends in part on our ability to attract, retain and motivate senior management and other key employees. Achieving this objective may be difficult due to many factors, including fluctuations in global economic and industry conditions, competitors hiring practices, cost reduction activities, and the effectiveness of our compensation programs. Competition for qualified personnel can be very intense. We must continue to recruit, retain and motivate senior management and other key employees sufficient to maintain our current business and support our future projects and growth objectives. We are vulnerable to attrition among our current senior management team and other key employees. Some members of our senior management team and other key employees are at or nearing retirement age. If we are unsuccessful in our succession planning efforts, the continuity of our business and results of operations could be adversely affected. A loss of any such personnel, or the inability to recruit and retain qualified personnel in the future, could have an adverse effect on our business, financial condition and results of operations.\nOur backlog is not necessarily indicative of the level of our future revenues.\nOur manufacturing backlog represents future production for our customers in various periods, and estimated potential revenue attributable to such production. Our backlog of railcar units and marine vessels is not necessarily indicative of future results of operations. Certain orders in backlog are subject to customary documentation and completion of terms which may not occur. Some backlog is subject to certain conditions, including potential adjustment to prices due to changes in prevailing market prices, or due to lower prices for new orders accepted by us from other customers for similar cars on similar terms and conditions during relevant time periods. Our reported backlog may not be converted to revenue in any particular period and some of our contracts permit cancellations with limited compensation that would not replace lost revenue or margins. In addition, some customers may attempt to delay orders, cancel or modify a contract even if the contract does not allow for such cancellation or modification, and we may not be able to recover all revenue or earnings lost due to a breach of contract or a contract may be found to be unenforceable. The likelihood of cancellations, modifications, rejection and non-payment for our products generally increases during periods of market weakness. The timing of converting backlog to revenue is also materially impacted by our decision whether to lease railcars, sell railcars, or syndicate railcars with a lease attached to an investor. Actual revenue may not equal our anticipated revenues based on our backlog.\nWe derive a significant amount of our revenue from a limited number of customers, the loss of or reduction of business from one or more of which could have an adverse effect on our business.\nA significant portion of our revenue is generated from a few major customers. Although we have some long-term contractual relationships with our major customers, we cannot be assured that we will continue to have good relations with our customers, or that our customers will continue to purchase or lease our products or services, or will continue to do so at historical levels, or will renew their existing contracts with us. A reduction in the purchasing or leasing of our products, a termination of our services by one or more of our major customers, a decline in the financial condition of a major customer, or our failure to replace expiring customer contracts with new customer contracts on satisfactory terms could result in a loss of business and have an adverse effect on our business and operating results.\nWe rely on limited suppliers for certain components and services needed in our production. If we are not able to procure specialty components or services on commercially reasonable terms or on a timely basis, our business, financial condition and results of operations would be adversely affected.\nOur manufacturing operations depend in part on our ability to obtain timely deliveries of materials, components and services in acceptable quantities and quality from our suppliers. In 2022, the top ten suppliers for all inventory purchases accounted for approximately 49% of total purchases. The top two suppliers accounted for 16% and 10% of total inventory purchases in 2022. No other suppliers accounted for more than 10% of total inventory purchases. Certain components of our products, particularly specialized components like castings, bolsters, trucks, wheels and axels, and certain services, such as lining capabilities, are currently only available from a limited number of suppliers. If any one or more of our suppliers cease to provide us with sufficient quantities of our components or services in a timely manner or on terms acceptable to us, or cease to provide services or manufacture components of acceptable quality, or go out of business, we could incur disruptions or be limited in our production of our products and may not be able to promptly identify alternative sources for these components or services.\nIn addition, we are increasing the number of components and services we manufacture or provide ourselves, directly or through joint ventures. If we are not successful at manufacturing such components or providing such services or have production problems after transitioning to self-produced supplies, we may not be able to replace such components or services from third party suppliers in a timely manner. Any such disruption in our supply of specialized components and services or increased costs of those components or services could harm our business and adversely affect our results of operations.\nThe timing of our asset sales and related revenue recognition could cause significant differences in our quarterly results and liquidity.\nWe may build products in anticipation of a customer order, or lease railcars to a customer with the aim of selling such railcars on lease to a third party. In such cases, the lag between production and sale results in uneven recognition of revenue and earnings over time. Our production during any given period may be concentrated in relatively few contracts, intensifying the amplitude and irregularity of our revenue streams. The timing of recognizing revenue on a railcar is also materially impacted by our decision whether to lease the railcar to a lessee, sell the railcar, or syndicate the railcar with a lease attached to an investor. In addition, we periodically sell railcars from our own lease fleet and the timing and volume of such sales are difficult to predict. As a result, comparisons of our manufacturing revenue, deliveries, quarterly net gain on disposition of equipment, income and liquidity between quarterly periods within one year and between comparable periods in different years may not be meaningful and should not be relied upon as indicators of our future performance.\nWe face risks related to cybersecurity threats and incidents that increase our costs and could disrupt our business and operations.\nWe regularly face attempts by others to gain unauthorized access through the Internet, or to introduce malicious software, to our information technology systems. Additionally, malicious hackers, state-sponsored organizations, terrorists, employees and third-party service providers, or intruders into our physical facilities may attempt to gain unauthorized access and corrupt the processes used to operate our businesses and to design and manufacture our products. We are also a target of malicious attackers who attempt to gain access to our network or those of our customers; steal proprietary information related to our business, products, employees, and customers; interrupt our systems and services or those of our customers; or demand ransom to return control of such systems and services. Such attempts are increasing in number and in technical sophistication, and if successful, would expose us and the affected parties to risk of loss or misuse of proprietary or confidential information or disruptions of our business operations. Our information technology infrastructure also includes products and services provided by third parties, and these providers can experience breaches of their systems and products that affect the security of our systems and our proprietary or confidential information. Our reliance on information technology increases as working remotely increases among our employees.\nAddressing cybersecurity threats and incidents, whether or not successful, could result in our incurring significant costs related to, for example, disruptions in our operations, rebuilding internal systems, implementing additional threat protection measures, defending against litigation, responding to regulatory inquiries or actions, paying damages, or taking other remedial steps with respect to third parties, as well as reputational harm. In addition, these threats are constantly evolving, thereby increasing the difficulty of successfully defending against them or implementing adequate preventative measures. While we seek to detect and investigate unauthorized attempts and attacks against our network, products, and services, and to prevent their recurrence where practicable through changes to our internal processes and tools, we remain potentially vulnerable to additional known or unknown threats. In some instances, we, our customers, and the users of our products and services can be unaware of an incident or its magnitude and effects.\nThe theft, loss, or misuse of third party data collected, used, stored, or transferred by us to run our business could result in significantly increased business and security costs or costs related to defending legal claims. Global privacy legislation, enforcement, and policy activity in this area are rapidly expanding and creating a complex regulatory compliance environment. Costs to comply with and implement these privacy-related and data protection measures could be significant, and noncompliance could expose us to significant monetary penalties, damage to our reputation, and even criminal sanctions. Even our inadvertent failure to comply with federal, state, or international privacy-related or data-protection laws and regulations could result in audits, regulatory inquiries, or proceedings against us by governmental entities or other third parties.\nUpdates or changes to our information technology systems may result in problems that could negatively impact our business.\nWe have information technology systems, comprising hardware, network, software, people, processes and other infrastructure that are important to the operation of our businesses. We continue to evaluate and implement upgrades and changes to information technology systems that support substantially all of our operating and financial functions. We could experience problems in connection with such implementations, including compatibility issues, training requirements, higher than expected implementation costs and other integration challenges and delays. A significant problem with an implementation, integration with other systems or ongoing management and operation of our systems could negatively impact our business by disrupting operations. Such a problem could also have an adverse effect on our ability to generate and interpret accurate management and financial reports and other information on a timely basis, which could have a material adverse effect on our financial reporting system and internal controls and adversely affect our ability to manage our business.\nA failure to design or manufacture products or technologies or to achieve timely certification or market acceptance of new products or technologies could have an adverse effect on our profitability.\nWe continue to introduce new railcar product innovations and technologies. We occasionally accept orders prior to receiving railcar certification or proving our ability to manufacture a quality product that meets customer standards. We could be unable to successfully design or manufacture new railcar product innovations or technologies. Our inability to develop and manufacture new product innovations or technologies in a timely and profitable manner, or to obtain timely certification, or to achieve market acceptance, or to avoid quality problems in our new products, could have a material adverse effect on our revenue and results of operations and subject us to losses including penalties, cancellation of orders, rejection of railcars by a customer and/or other losses.\nOur debt could have negative consequences to our business or results of operations.\nWe face several risks due to our debt and debt service obligations including our potential inability to satisfy our financial obligations related to our consolidated indebtedness; potential breach of the covenants in our credit agreements; our ability to borrow additional amounts or refinance existing indebtedness in the future to fund operating needs may be limited or costly; our availability of cash flow may be inadequate because a portion of our cash flow is needed to pay principal and interest on our debt; we may be at a disadvantage relative to our competitors that have greater financial resources than us or more flexible capital structures than us; we face additional exposure to the risk of increased interest rates as certain of our borrowings are at variable rates of interest, which could result in higher interest expense in the event of an increase in interest rates; restrictions under debt agreements may adversely interfere with our financial and operating flexibility; and exposure to the possibility that we may suffer a material adverse effect on our business and financial condition if we are unable to service our debt or obtain additional financing, as needed.\nWe, our subsidiaries, and our joint ventures may incur additional indebtedness, including secured indebtedness, and other obligations and liabilities that do not constitute indebtedness. This could increase the risks associated with our debt. Some of our credit facilities and existing indebtedness use variable rates including the London Interbank Offered Rates (LIBOR), the Secured Overnight Financing Rate (SOFR), and other prime rates of reference banks. Replacement reference rates, which includes SOFR, are relatively new with a limited history, and changes in SOFR have, on occasion, been more volatile than changes in other benchmark or market rates. As a result, the amount of interest we may pay on our variable rate indebtedness is difficult to predict.\nOur product and service warranties could expose us to significant claims.\nWe offer our customers limited warranties for many of our products and services. Accordingly, we may be subject to significant warranty claims in the future, such as multiple claims based on one defect repeated throughout our production or servicing processes, claims for which the cost of repairing the defective part is highly disproportionate to the original cost of the part or defects in railcars or services which we discover in the future resulting in increased warranty costs or litigation. Warranty and product support terms may expand beyond those which have traditionally prevailed in the rail supply industry. These types of warranty claims could result in costly product recalls, customers seeking monetary damages, significant repair costs and damage to our reputation. If warranty claims attributable to actions of third party component manufacturers are not recoverable from such parties due to their poor financial condition or other reasons, we could be liable for warranty claims and other risks for using these materials in our products.\nOur financial performance and market value could cause future write-downs of goodwill or intangibles or other long-lived assets in future periods.\nWe are required to perform an annual impairment test of goodwill and other indefinite lived assets which could result in an impairment charge if it is determined that the carrying value of the asset exceeds its fair value. We perform a goodwill impairment test annually at the reporting unit level during the third quarter of each year, or whenever events or circumstances indicate that the carrying value of these assets may exceed their fair value.\nIf indicators suggest it is more likely than not that the fair value of a reporting unit is less than its carrying value, it may result in an impairment of goodwill. As of August 31, 2022, we had $84.3 million of goodwill in our Manufacturing segment and $43.0 million in our Maintenance Services segment. Impairment charges to our goodwill or other indefinite lived intangible assets would impact our results of operations. Future write-downs of goodwill and other assets could affect certain of the financial covenants under debt instruments and could restrict our financial flexibility.\nOur business will suffer if we are unsuccessful in making, integrating, and maintaining acquisitions, joint ventures and other strategic investments.\nWe have acquired businesses and invested in or entered into joint ventures in past periods. We may in the future acquire other businesses or invest in or enter into joint ventures with other companies. Our failure to identify future acquisition or joint venture opportunities, or to complete potential acquisitions or joint ventures on favorable terms, could hinder our ability to grow our business. Additionally, these transactions create risks such as:\ndisruption of our ongoing business, including loss of management focus on existing operations;\nthe difficulty of incorporating acquired operations, technology, and rights into our existing business and product and service offerings, unanticipated expenses related to such integration and the lack of control if such integration is delayed or not successfully implemented;\nthe challenges of coordinating geographically dispersed organizations, integrating personnel with disparate business backgrounds, and combining different corporate cultures;\nthe challenges of retaining key personnel of the acquired business or joint venture;\nthe risk of incurring unanticipated operating losses and expenses of the acquired business or joint venture;\nthe potential impairment of customer and other relationships of the acquired company or of the joint venture partner or our own customers as a result of any integration of operations;\nlosses we may incur as a result of declines in the value of a joint venture investment or as a result of incorporating an investees financial performance into our financial results;\nthe difficulty of implementing at companies we acquire the controls, procedures, and policies appropriate for a public company;\npotential unknown liabilities associated with a company we acquire or in which we invest;\nthe risks associated with businesses we acquire or invest in, which may differ from or be more significant than the risks our other businesses face;\nour inability to complete capital expenditure projects on time and within budget or the failure of capital expenditure projects once completed to operate as planned or to return expected benefits as planned; and\nthe difficulty of completing such transactions and achieving anticipated cost efficiencies, synergies and other benefits within expected timeframes, or at all.\nIn addition, we might need to issue additional equity securities, spend our cash, or incur debt, contingent liabilities, or amortization expenses related to intangible assets in connection with effecting an acquisition or joint venture, any of which could reduce our profitability and harm our business or only be available on unfavorable terms, if at all. In addition, valuations supporting our acquisitions and investments could change rapidly. We could determine that such valuations have experienced impairments or other-than-temporary declines in fair value, which could adversely impact our financial results.\nIf we are unable to protect our intellectual property or if third parties assert that our products or services infringe their intellectual property rights, our ability to compete in the market may be harmed, and our business and financial condition may be adversely affected.\nIf our intellectual property rights are not adequately protected, we may not be able to commercialize our technologies, products or services and our competitors could commercialize our technologies, which could result in a decrease in our sales and market share and could materially adversely affect our business, financial condition and results of operations. Conversely, third parties might assert that our products, services, or other business activities infringe their patents or other intellectual property rights. Infringement and other intellectual property claims and proceedings brought against us, whether successful or not, could result in substantial litigation and judgment costs and harm our reputation.\nInsurance coverage could be costly, unavailable or inadequate.\nThe ability to insure our businesses, facilities and rail assets is an important aspect of our ability to manage risk. As there are only limited providers of this insurance to the railcar industry, there is no guarantee that such insurance will be available on a cost-effective basis in the future. In addition, we cannot assure that our insurance carriers will be able to pay current or future claims. Additionally, the nature of our business subjects us to physical damage, business interruption and product liability claims, especially in connection with the repair and manufacture of products that carry hazardous or volatile materials. Although we maintain liability insurance coverage at commercially reasonable levels compared to similarly sized heavy equipment manufacturers, an unusually large physical damage, business interruption or product liability claim or a series of claims based on a failure repeated throughout our production process could exceed our insurance coverage or result in damage to our reputation, which could materially adversely impact our financial condition and results of operations.\nRisks Related to Market and Economic Factors\nWeak economic conditions and inflation in the global economy could negatively impact our business and results of operations.\nCustomer demand for our products and services may be impacted by weak economic conditions, recession, equity market volatility or other negative economic factors in the U.S. or other nations. General inflation in the United States, Europe and other geographies has risen to levels not experienced in recent decades. General inflation, including rising prices for energy, metals, components, and other inputs as well as rising wages negatively impact our business by increasing our operating costs. General inflation also negatively impacts our business by decreasing the capital for our customers to deploy to purchase our goods and services. Inflation may cause our customers to reduce or delay orders for our goods and services thereby causing a decrease in sales of our goods and services. In addition, if the U.S. economy enters a recession, we may experience sales declines and may have to decrease prices, either of which could have a material adverse impact on our financial results.\nMonetary and other policy interventions by governments and central banks, including the increase of interest rates, as well as uncertainly about governmental macroeconomic policies, could negatively impact our business and results of operations.\nThe United States Federal Reserve, the European Central Bank, and several other central banks, have undertaken or signaled increases in benchmark interest rates. Rising interest rates increases our borrowing costs potentially decreasing our profitability. Additionally, increased borrowing costs faced by our customers could result in decreased demand for our products. Monetary interventions also risk a sustained decline in aggregate demand, either globally or within one more geographic market. A decline in demand for our products would most likely have a negative impact on our business and results of operations.\nThe types of rail equipment we sell and the services we provide significantly impact our revenue and our margin and are dependent on broad economic trends over which we have little or no control.\nWe manufacture, lease, maintain and refurbish a broad range of railcars and related rail equipment. The demand for specific types of railcars and the mix of repair and refurbishment work varies over time. Changes in the global economy and the industries and geographies that we serve cause shifts in demand for specific products and services. These shifts in demand could affect our results of operations and could have an adverse effect on our revenue and our profitability. Demand for specific types of railcars increases and decreases with the demand for goods such as grains, metals, construction aggregates, fertilizer, perishables and general merchandise, plastic pellets, oil and gas, bio-fuels, chemicals, and automobiles, among others, which is beyond our control.\nCyclical economic downturns in our industry usually result in decreased demand for our products and services and reduced revenue.\nThe industry in which we operate is subject to periodic economic cycles, and the purchasing trends of customers in our industry have a significant impact on demand for our products and services. As a result, during downturns, the rate at which we convert backlog to revenue usually decreases and we may slow down or halt production at some of our facilities. The current economic downturn in our industry has impacted the demand for our products and services, and will continue to result in one or more of the following: lower sales volumes, lower prices, lower lease utilization rates and decreased revenues and profits.\nDemand for our railcar equipment and services is dependent on the future of rail transportation and the manner in which railroads operate.\nDemand for our rail equipment and services may decrease if freight rail decreases as a mode of freight transportation used by customers to ship their products, or if governmental policies favor modes of freight transportation other than rail. If rail freight transportation becomes more efficient or dwell times decrease, demand for our rail equipment and services may decrease. If the rail freight industry becomes oversupplied, prices for our railcars, lease rates, and demand for our products and services may decrease. The industries in which our customers operate are driven by dynamic market forces and trends, which are in turn influenced by economic, regulatory, and political factors. Features and functionality specific to certain railcar types could result in those railcars becoming obsolete as customer requirements for freight delivery change.\nRisks related to our operations outside of the U.S. could adversely affect our operating results.\nWe own, lease, operate or have invested in businesses that have manufacturing facilities in Mexico, Brazil and Europe, and have customers and suppliers located outside the United States. Instability in the macroeconomic, political, military, legal, trade, financial, labor or market conditions in or relating to the countries where we, or our customers or suppliers, operate could negatively impact our business activities and operations. Some foreign countries in which we operate or may operate have authorities that regulate railroad safety and rail equipment design and manufacturing. If we do not have appropriate certifications, we could be unable to market and sell our rail equipment in those markets. Adverse changes in foreign regulations applicable to us or our customers, such as labor, environment, trade, tax, currency and price regulations, could limit our operations, make the manufacture and distribution of our products difficult, and delay or limit our ability to repatriate income derived from foreign markets.\nOur business benefits from free trade agreements between the United States and foreign governments, and from various U.S. corporate tax provisions related to international commerce. Any changes in trade or tax policies by the U.S. or foreign governments in jurisdictions in which we do business, as well as any embargoes, quotas or tariffs imposed on our products and services, could adversely and significantly affect our financial condition and results of operations.\nAmong the political risks we face outside the U.S. are governments nationalizing our business or assets, or repudiating or renegotiating contracts with us, our customers or our suppliers. In our cross-border business activities, we could experience longer customer payment cycles, difficulty in collecting accounts receivable or an inability to protect our intellectual property. We could be adversely affected by violations of the U.S. Foreign Corrupt Practices Act and similar worldwide anti-corruption laws, which may conflict with local business customs in certain jurisdictions. The failure to comply with laws governing international business may result in substantial penalties and fines and reputational harm. Transactions with non-U.S. entities expose us to business practices, local customs, and legal processes with which we may not be familiar, as well as difficulty enforcing contracts and international political and trade tensions. If we are unable to successfully manage the risks associated with our foreign and cross-border business activities, our results of operations, financial condition, liquidity and cash flows could be negatively impacted.\nFluctuations in foreign currency exchange rates could lead to increased costs and lower profitability.\nOutside of the U.S., we primarily conduct business in Mexico, Europe and Brazil and our non-U.S. businesses conduct their operations in local currencies. We also source materials worldwide. Fluctuations in exchange rates may affect demand for our products in foreign markets or our cost competitiveness and may adversely affect our profitability. Although we attempt to mitigate a portion of our exposure to changes in currency rates through currency rate hedge contracts and other activities, these efforts cannot fully eliminate the risks associated with the foreign currencies. In addition, some of our borrowings are in foreign currency, giving rise to risk from fluctuations in exchange rates. A material or adverse change in exchange rates could result in significant deterioration of profits or in losses for us.\nWe could be unable to lease railcars at satisfactory rates, remarket leased railcars on favorable terms upon lease termination, or realize the expected residual values for end of life railcars due to changes in scrap prices, each of which could reduce our revenue and decrease our overall return or affect our ability to sell leased assets in the future.\nThe profitability of our railcar leasing business depends on our ability to lease railcars at satisfactory rates, sell railcars with sufficiently profitable leases to investors, and to remarket, sell or scrap railcars we own or manage upon the expiration of leases. The rent we receive during the initial railcar lease term typically covers only a small portion of the railcar acquisition or production costs. Thus, we are exposed to a remarketing risk throughout the life of the railcar because we must obtain lease rates or a sale price sufficient to cover our acquisition or production costs related to the railcar. Our ability to lease or remarket leased railcars profitably is dependent on several factors, including, but not limited to, market and industry conditions, cost of, and demand for, competing used or newer models, availability of credit and the credit-worthiness of potential customers, costs associated with the refurbishment of the railcars, the market demand or governmental mandates for refurbishment, customers not defaulting on their leases, as well as market perceptions of residual values and interest rates. A downturn in the industries in which our lessees operate and decreased demand for railcars could also increase our exposure to remarketing risks because lessees may demand shorter lease terms, requiring us to remarket leased railcars more frequently. Furthermore, the resale market for previously leased railcars has a limited number of potential buyers. Our inability to lease, remarket or sell leased railcars on favorable terms could result in an adverse impact to our consolidated financial statements or affect our ability to sell leased railcars to investors in the future. Additionally, when the price of scrap steel declines, our revenues and margins in such businesses decrease.\nA limited availability of financing or higher interest rates could increase the cost of, or potentially deter, new leasing arrangements with our customers, reduce our ability to syndicate railcars under lease to financial institutions, or impact the sales price we may receive on such syndications, any of which could materially adversely affect our business, financial condition and results of operations.\nSome of our competitors are owned or financially supported by foreign governments and may sell products below cost or otherwise compete unfairly.\nThe markets in which we participate are intensely competitive and we expect them to remain intensely competitive into the foreseeable future. Some of our competitors are owned or financially supported by foreign governments or sovereign wealth funds, and may potentially sell products and services below cost, or otherwise compete unfairly, in order to gain market share. The relative competitiveness of our manufacturing facilities and products affects our performance. A number of competitive factors challenge or affect our ability to compete successfully including the introduction of competitive products and new entrants into our markets, a limited customer base and price pressures from unfair competition and increases in raw materials and labor costs. If we do not compete successfully, our market share, margin and results of operations may be adversely affected.\nFires, natural disasters, pandemics, terrorism, or severe or unusual weather conditions could disrupt our business and result in loss of revenue or higher expenses or decreased demand.\nAny serious disruption at any of our facilities due to pandemic, terrorism, fire, hurricane, earthquake, flood, other severe weather events or any other natural disaster could impair our ability to use our facilities and have a material adverse impact on our revenues and increase our costs and expenses. If there is a natural disaster or other serious disruption at any of our facilities, particularly at any of our Mexican or Arkansas facilities, it could impair our ability to adequately supply our customers, cause a significant disruption to our operations, cause us to incur significant costs to relocate or reestablish these functions and negatively impact our operating results. While we insure against certain business interruption risks, such insurance may not adequately compensate us for any losses incurred as a result of natural or other disasters.\nAdditionally, seasonal fluctuations in weather conditions may lead to greater variation in our quarterly operating results as unusually mild weather conditions will generally lead to lower demand for our wheel-related products and services. Unusually mild weather conditions throughout the year may reduce overall demand for our wheel-related products and maintenance services. If occurring for prolonged periods, such weather could have an adverse effect on our business, results of operations and financial condition.\nThe deterioration of conditions in the global capital markets, weakening of macroeconomic conditions and changes in the credit markets and the financial services industry could negatively impact our business, results of operations, financial condition or liquidity.\nOur leasing subsidiaries' operations relies in large part upon banks and capital markets to fund its operations and contractual commitments and refinance existing debt. These markets can experience high levels of volatility and access to capital can be constrained for extended periods of time. In addition to conditions in the capital markets, a number of other factors could cause us to incur increased borrowing costs and have greater difficulty accessing public and private markets for both secured and unsecured debt. The credit markets and the financial services industry may experience volatility which can result in tighter availability of credit on more restrictive terms and limit our ability to sell railcar assets or to syndicate railcars to investors with leases attached. Our liquidity, financial condition and results of operations could be negatively impacted if our ability to borrow money to finance operations, obtain credit from trade creditors, obtain credit to maintain our hedging programs, offer leasing products to our customers or sell railcar assets were to be impaired. In addition, scarcity of capital could also adversely affect our customers ability to purchase, lease, or pay for products from us or adversely affect our suppliers ability to provide us with product. Any of these conditions or events could result in reductions in our revenues, increased price competition, or increased operating costs, which could adversely affect our business, financial condition and results of operations.\nRisks Related to Legal, Compliance and Regulatory Matters\nRisks related to potential misconduct by employees may adversely impact us.\nOur employees may engage in misconduct, fraud or other improper activities, including noncompliance with our policies or regulatory standards and requirements, which could subject us to regulatory sanctions and reputational damage and materially harm our business. It is not always possible to deter employee misconduct, and the precautions we take to prevent and detect this activity may not be effective in controlling unknown or unmanaged risks or losses, including risks associated with harassment, as well as whistleblower complaints and litigation. There can be no assurance that we will succeed in preventing misconduct by employees in the future. In addition, the investigation of alleged misconduct disrupts our operations and may harm the publics perception of our company, which may be costly. Any such events in the future may have a material adverse impact on our financial condition or results of operations.\nChanges in, or failure to comply with, applicable regulations may adversely impact our business, financial condition and results of operations.\nOur company and the other participants in our industry are subject to regulation by governmental agencies. These authorities establish, interpret, and enforce rules and regulations for the railcar industry. New rules and regulations and shifting enforcement priorities of regulators could increase our operating costs and the operating costs of our customers. Changes to the process for obtaining regulatory approval in Europe for the operation of new or modified railcars may make it more difficult for us to deliver products timely and to comply with our sales contracts.\nWe cannot guarantee that we or our suppliers will be in compliance at all times and compliance may prove to be more costly and limiting than we currently anticipate and compliance requirements could increase in future years. If we or our suppliers fail to comply with applicable requirements and regulations, we could face sanctions and penalties that could negatively affect our financial results.\nWe have potential exposure to environmental liabilities, which could increase our operating costs or have an adverse effect on our results of operations.\nWe are subject to extensive national, state, foreign, provincial and local environmental laws and regulations concerning, among other things, air emissions, water discharge, solid waste and hazardous substances handling and disposal and employee health and safety. These laws and regulations are complex and frequently change. We could incur unexpected costs, penalties and other civil and criminal liabilities if we, or in certain circumstances others, fail to comply with environmental laws or permits issued pursuant to those laws. We also could incur costs or liabilities related to off-site waste disposal or remediating soil or groundwater contamination at our properties, including as set forth in Item 3, Legal Proceedings. In addition, future environmental laws and regulations may require significant capital expenditures or changes to our operations, or may impose liability on us in the future for actions that complied with then applicable laws and regulations when the action was taken.\nBusiness, regulatory, and legal developments regarding climate change may affect the demand for our products or the ability of our critical suppliers to meet our needs.\nScientific studies have suggested that emissions of certain gases, commonly referred to as greenhouse gases (GHGs) including carbon dioxide and methane, may be contributing to warming of the Earths atmosphere and other climate changes. Legislation and new rules to regulate emission of GHGs have been introduced in numerous state legislatures, the U.S. Congress, and by the EPA. Some of these proposals would require industries to meet stringent new standards that may require substantial reporting of GHGs and other carbon intensive activities in addition to potentially mandating reductions in our carbon emissions. While we cannot assess the direct impact of these or other potential regulations, we recognize that new climate change reporting or compliance protocols could affect our operating costs, the demand for our products and/or affect the price of materials, input factors and manufactured components which could impact our margins. Other adverse consequences of climate change could include an increased frequency of severe weather events and rising sea levels that could affect operations at our manufacturing facilities, the price of insuring company assets, or other unforeseen disruptions of our operations, systems, property or equipment.\nTrain derailments or other accidents or claims could subject us to legal claims that adversely impact our business, financial condition and our results of operations.\nWe provide a number of services which include the manufacture and supply of new railcars, wheels, components and parts and the lease and maintenance of railcars for our customers that transport a variety of commodities, including tank railcars that transport hazardous materials such as crude oil, ethanol and other products. In addition, we have a Regulatory Services Group which offers regulatory, engineering, process consulting and advocacy support to the tank car and petrochemical rail shipper community, among other services. We could be subject to various legal claims, including claims of negligence, personal injury, physical damage and product or service liability, or in some cases strict liability, as well as potential penalties and liability under environmental laws and regulations, in the event of a derailment or other accident involving railcars, including tank railcars whether resulting from natural disasters, human error, terrorism, or other causes. If we become subject to any such claims and are unable successfully to resolve them or maintain inadequate insurance for such claims, our business, financial condition and results of operations could be materially adversely affected.\nThe products we manufacture are designed to work optimally when properly operated, installed, repaired, maintained and used to transport the intended cargo. Our products may be sold to third parties who may misuse, improperly install or improperly or inadequately maintain or repair such products, which may result in us being subjected to claims or litigation associated with product damage, injuries or property damage that could increase our costs and weaken our financial condition.\nWe have identified a material weakness in our internal control over financial reporting. If we fail to properly remediate the material weakness or to maintain an effective system of internal controls, we may not be able to accurately report our financial results or prevent fraud.\nDuring its evaluation of the effectiveness of disclosure controls and procedures as of August 31, 2022, management determined that our internal control over financial reporting was not effective, because we did not have effective controls over change management of system configurations in one IT environment to ensure all changes were logged and approved. Management has determined that this deficiency constitutes a material weakness in our internal control over financial reporting. We have identified and are implementing remedial measures to address the control deficiency that led to the material weakness. However, there can be no assurance that our remedial measures will correct the deficiency. If we are unable to remediate the material weakness, or are otherwise unable to maintain effective internal control over financial reporting or disclosure controls and procedures, it may result in material misstatements, as well as adversely affect the reliability of our financial statements, our reputation, our business, and the trading price of our common stock. More information regarding the material weakness and our remediation efforts is provided in Item 9A. Controls and Procedures.\nChanges in or the implementation of accounting standards or inaccurate estimates or assumptions in the application of accounting policies could adversely affect our financial results.\nOur accounting policies and methods are fundamental to how we record and report our financial condition and results of operations. Some of these policies require use of estimates and assumptions that may affect the reported value of our assets or liabilities and financial results and are critical because they require management to make difficult, subjective, and complex judgments about matters that are inherently uncertain. Estimates, judgments and assumptions underlying the accompanying consolidated financial statements include, income taxes, warranty accruals, environmental costs, and goodwill, among others. If our accounting policies, methods, judgments, assumptions, estimates and allocations prove to be incorrect, or if circumstances change, our business, financial condition, results of operations, liquidity, ability to pay dividends or stock price may be materially adversely affected.\nAccounting standard setters and those who interpret the accounting standards (such as the Financial Accounting Standards Board, the SEC, and independent registered public accounting firms) may amend or even reverse their previous interpretations or positions on how these standards should be applied. In some cases, we could be required to apply a new or revised standard retrospectively, resulting in the revision of prior period financial statements. Changes in accounting standards can be hard to predict and can materially impact how we record and report our financial condition and results of operations.\nSome of our customers place orders for our products in reliance on their ability to utilize tax benefits or tax credits any of which benefits or credits could be discontinued thereby reducing incentives for our customers to purchase our rail products.\nThere is no assurance that tax authorities will reauthorize, modify, or prevent the expiration of tax benefits, tax credits, or other policies aimed to incentivize the purchase of our products. If such incentives are discontinued or diminished, the demand for our products could decrease, thereby creating the potential for a material adverse effect on our financial condition or results of operations.\nRisks Related to our Common Stock\nOur stock price has been volatile and may continue to experience large fluctuations.\nThe price of our common stock has experienced rapid and significant price fluctuations. The price for our common stock is likely to continue to be volatile and subject to price and volume fluctuations in response to market and other factors, including the factors discussed elsewhere in these risk factors. A material decline in the price of our common stock may result in the assertion of certain claims against us, and/or the commencement of inquiries and/or investigations against us. A prolonged decline in the price of our common stock could result in a reduction in the liquidity of our common stock, a reduction in our ability to raise capital, and the inability of investors to obtain a favorable selling price for their shares. Following periods of volatility in the market price of their stock, historically many companies have been the subject of securities class action litigation. If we became involved in securities class action litigation in the future, it could result in substantial costs and diversion of our managements attention and our resources and could harm our stock price, business, prospects, financial condition and results of operations.\nOur current shareholders could experience dilution.\nWe require substantial working capital to fund our business. If additional funds are raised through the issuance of equity securities or convertible securities, the percentage ownership held by our shareholders would be reduced and the equity securities we issue may have rights, preferences or privileges senior to those of our common stock. Additionally, we have the option to settle outstanding convertible notes in cash, although if we opt not to or do not have the ability to settle outstanding convertible notes in cash, the conversion of some or all of our convertible notes may dilute the ownership interests of existing shareholders. Any sales in the public market of the common stock issuable upon the conversion of the notes could adversely affect prevailing market prices of our common stock. In addition, the existence of the notes may encourage short selling by market participants, because the conversion of the notes could depress the price of our common stock.\nCertain provisions in our charter documents, Oregon law, and our debt instruments could make an acquisition of our company more difficult, limit attempts by our shareholders to replace or remove members of our Board of directors and may adversely affect the market price of our common stock.\nOur Articles of Incorporation and Bylaws, Oregon law, and contracts and debt instruments to which we are a party, contain certain provisions that could delay, defer or prevent an acquisition proposal that some, or a majority, of our shareholders might believe to be in their best interests or in which shareholders might receive a premium for their common stock over the then-prevailing market price. These provisions could also dissuade shareholders or third parties from contesting director elections and could cause investors to view our securities as less attractive investments and reduce the market price of our common stock. Certain relevant provisions of our Articles of Incorporation and Bylaws, as well as Oregon law, are described in further detail in Description of the Registrants Securities Under Section 12 of the Securities Exchange Act of 1934 annexed as Exhibit 4.3 to this Annual Report.\nPayments of cash dividends on our common stock may be made only at the discretion of our Board of Directors and may be restricted by Oregon law.\nAny decision to pay dividends will be at the discretion of our Board of Directors and will depend upon our operating results, strategic plans, capital requirements, financial condition, provisions of our borrowing arrangements and other factors our Board of Directors considers relevant. Furthermore, Oregon law imposes restrictions on our ability to pay dividends. Accordingly, we may not be able to continue to pay dividends in any given amount in the future, or at all.\nOur business and operations could be negatively affected if we become subject to shareholder activism, which could cause us to incur significant expense, hinder execution of our business strategy and impact our stock price.\nShareholder activism which could take many forms, including potential proxy contests and public information campaigns continues to increase. Shareholder activism could result in substantial costs to the Company, give rise to perceived uncertainties as to our future, adversely affect our relationships with suppliers, customers, and regulators, make it more difficult to attract and retain qualified personnel, and adversely impact our stock price.\nOur share repurchase program is intended to enhance long-term shareholder value although we cannot guarantee this will occur and this program may be suspended or terminated at any time.\nThe Board of Directors has authorized our company to repurchase our common stock through a share repurchase program. Our share repurchase program may be modified, suspended or discontinued at any time without prior notice. Although the share repurchase program is intended to enhance long-term shareholder value, we cannot provide assurance that this will occur.\nGeneral Risk Factors\nUnanticipated changes in our tax provisions or exposure to additional income tax liabilities could affect our financial condition and profitability and we may take tax positions that the Internal Revenue Service or other tax authorities may contest.\nWe are subject to income taxes in both the United States and foreign jurisdictions. Significant judgments and estimates are required to be made in determining our worldwide provision for income taxes. Changes in estimates of projected future operating results, loss of deductibility of items, recapture of prior deductions (including related to interest on convertible notes), limitations on our ability to utilize tax net operating losses in the future or changes in assumptions regarding our ability to generate future taxable income could result in significant increases to our tax expense and liabilities that could adversely affect our financial condition and profitability.\nWe have in the past and may in the future take tax positions that the Internal Revenue Service (IRS) or other tax authorities may contest. We are required by an IRS regulation to disclose particular tax positions to the IRS as part of our tax returns for that year and future years. If the IRS or other tax authorities successfully contests a tax position that we take, we may be required to pay additional taxes, interest or fines that may adversely affect our results of operations and financial position.\nThe use of social and other digital media to disseminate false, misleading and/or unreliable or inaccurate data and information could create unwarranted volatility in our stock price and losses to our shareholders and could adversely affect our reputation, products, business, and operating results.\nA substantial number of people are relying on social and other digital media to receive news, data, and information. Social and other digital media can be used by anyone to publish data and information without regard for factual accuracy. The use of social and other digital media to publish inaccurate, offensive, and disparaging data and information coupled with the frequent use of strong language and hostile expression, may influence the publics inability to distinguish between what is true and what is false and could obstruct an effective and timely response to correct inaccuracies or falsifications. Such use of social and other digital media could result in unexpected and unsubstantiated claims concerning our business in general or our products, our leadership or our reputation among customers and the public at large, thereby making it more difficult for us to compete effectively, and potentially having a material adverse effect on our business, operations, or financial condition. Item 1B.\tUNRESOLVED STAFF COMMENTS\nNone. Item 2.\tPROPERTIES\nWe operate at the following primary facilities as of August 31, 2022:\nDescription\nLocation\nStatus\nManufacturing Segment\nOperating facilities:\n6 locations in the United States\nOwned\n3 locations in Mexico\nOwned - 2 locations\nLeased - 1 location\n3 locations in Poland\nOwned\n3 locations in Romania\nOwned\n1 location in Turkey\nOwned\nAdministrative offices:\n2 locations in the United States\nLeased\nMaintenance Services Segment\nOperating facilities:\n17 locations in the United States\nLeased - 9 locations\nOwned - 8 locations\nLeasing & Management Services Segment\nCorporate offices, railcar marketing and leasing activities:\nLake Oswego, Oregon\nLeased\nWe believe that our facilities are in good condition and that the facilities, together with anticipated capital improvements and additions, are adequate to meet our operating needs for the foreseeable future. We continually evaluate our facilities in order to remain competitive and to take advantage of market opportunities. Item 3.\tLEGAL PROCEEDINGS\nThere is hereby incorporated by reference the information disclosed in Note 21 - Commitments and Contingencies to Consolidated Financial Statements, Part II, Item 8 of this Form 10-K. Item 4.\tMINE SAFETY DISCLOSURES\nNot applicable.\nInformation about our Executive Officers\nCurrent information regarding our executive officers is presented below.\nLorie L. Tekorius, 55, is President and Chief Executive Officer and serves on the Board of Directors. Ms. Tekorius has served as President since August 2019 and was promoted to Chief Executive Officer on March 1, 2022. Ms. Tekorius was elected to the Board of Directors on March 28, 2022. Ms. Tekorius has served in various management positions for the Company since 1995, most recently as Executive Vice President and Chief Operating Officer and prior to that, as Executive Vice President and Chief Financial Officer.\nMartin R. Baker, 66, is Senior Vice President, General Counsel and Chief Compliance Officer, a position he has held since joining the Company in May 2008. Prior to joining the Company, Mr. Baker was Corporate Vice President, General Counsel and Secretary of Lattice Semiconductor Corporation.\nAlejandro Centurion, 66, served as Executive Vice President of the Company and President of Greenbrier Manufacturing Operations until August 31, 2022, a position he has held since January 2015. Mr. Centurion has served in various management positions for the Company since 2005, most recently as President of North American Manufacturing Operations.\nBrian J. Comstock, 60, is Executive Vice President, Chief Commercial and Leasing Officer, a position he has held since January 2021. Mr. Comstock has served in various management positions for the Company since 1998, most recently as Executive Vice President, Sales and Marketing.\nAdrian J. Downes, 59, is Senior Vice President, Chief Financial Officer and Chief Accounting Officer. Mr. Downes has served as Senior Vice President and Chief Accounting Officer since joining the Company in March 2013. Mr. Downes was promoted to Acting Chief Financial Officer in August 2018 and was promoted to Chief Financial Officer in May 2019.\nWilliam A. Furman, 78, served as the Executive Chairman until August 31, 2022 and continues to serve as a Director. Mr. Furman previously served as Chief Executive Officer from 1994 until March 1, 2022, and as Chairman of the Board of Directors from January 2014 until his appointment to Executive Chairman on March 28, 2022. Mr. Furman was Vice President of the Company, or its predecessor company, from 1974 to 1994 and President of the Company from 1994 to 2019.\nExecutive officers are designated by the Board of Directors. No director or executive officer has a family relationship with any other director or executive officer of the Company.\nPART II Item 5.\tMARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock has been traded on the New York Stock Exchange under the symbol GBX since July 14, 1994. There were approximately 550 holders of record of common stock as of October 24, 2022.\nIssuer Purchases of Equity Securities\nThe Board of Directors has authorized the Company to repurchase shares of the Companys common stock. The share repurchase program has an expiration date of January 31, 2023. There were no share repurchases during the year ended August 31, 2022 under this program. The amount remaining for repurchase was $100.0 million as of August 31, 2022.\nPerformance Graph\nThe following graph demonstrates a comparison of cumulative total returns for the Company's Common Stock, the Dow Jones U.S. Industrial Transportation Index and the Standard & Poors (S&P) 500 Index. The graph assumes an investment of $100 on August 31, 2017 in each of the Company's Common Stock and the stocks comprising the indices. Each of the indices assumes that all dividends were reinvested and that the investment was maintained to and including August 31, 2022, the end of the Companys 2022 fiscal year.\nThe comparisons in this table are required by the SEC, and therefore, are not intended to forecast or be indicative of possible future performance of our Common Stock. Item 6.\tRESERVED\nNot Applicable Item 7.\tMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExecutive Summary\nThe financial results for 2022 reflect a year of transition and agility. We delivered strong results despite a volatile macroeconomic environment. We identify a few general trends impacting our business at present, all of which we believe are reflected in our results for the year ended August 31, 2022. First, we believe the North American freight rail equipment market continues to emerge from the cyclical decrease in economic activity which began prior to the emergence of COVID-19. Second, we believe global economic activity continues to recover from the historic decrease resulting from the COVID-19 pandemic. We were able to leverage these trends to accomplish the following:\nSignificant increases in production throughout 2022;\nGrowth in new order activity year over year; and\nStrong ending backlog value and units.\nDespite these accomplishments, inflation, rising interest rates, price volatility, supply chain disruptions and geopolitical disquiet, demand concerted management focus for successful execution across the business. We believe we have the necessary management expertise and are well-positioned to navigate the immediate challenges. While we believe the current market and broader economic environment most likely will present many positive opportunities for our business, as we navigate the recovery, we face a number of challenges which include:\nInflation and policy reactions thereto, currency volatility and rising interest rates;\nAn increase in the price and the shortage of certain materials and components;\nShipping and transportation delays;\nShortages of skilled labor; and\nAdverse effects on the European market and the global economic markets, generally from the war in Ukraine.\nBusiness Highlights\nDespite the challenging operating environment, we achieved the following accomplishments in 2022:\nWe progressively increased our revenue during the year. The sequential growth in revenue was primarily driven by higher deliveries throughout the year.\nOur revenue increased by $1.2 billion and 70.4% compared to the prior year driven by a 65.5% increase in railcar deliveries.\nIn February 2022, we completed our first offering of railcar asset-backed securities.\nIn September 2021, we acquired more than 3,600 railcars in a successful portfolio acquisition. The railcar acquisition advanced our strategy to increase the scale of our lease fleet assets.\nWe increased our global headcount by nearly 40% during a challenging labor market to support higher levels of business activity.\nManufacturing Backlog\nOur backlog remains strong at August 31, 2022 with an increase in backlog units and value highlighted by the following:\nOur railcar backlog was 29,500 units with an estimated value of $3.5 billion as of August 31, 2022 with deliveries that extend into 2024.\nWe generated new railcar orders of 24,600 units valued at approximately $2.9 billion.\nWe increased our backlog compared to the prior year by approximately 2,900 units and $670 million.\nIn addition to our new railcar backlog, we had sustainable conversion orders at August 31, 2022 of approximately $180 million.\nBacklog units for lease may be syndicated to third parties or held in our lease fleet depending on a variety of factors. Multi-year supply agreements are a part of rail industry practice. A portion of the orders included in backlog reflects an assumed product mix. Under terms of the orders, the exact mix and pricing will be determined in the future, which may impact backlog. Approximately 6% of backlog units and estimated backlog value as of August 31, 2022 was associated with our Brazilian manufacturing operations which is accounted for under the equity method. Marine backlog as of August 31, 2022 was $31 million with deliveries that extend into 2023.\nOur backlog of railcar units and marine vessels is not necessarily indicative of future results of operations. Certain orders in backlog are subject to customary documentation and completion of terms. Customers may attempt to cancel or modify orders in backlog. Historically, little variation has been experienced between the quantity ordered and the quantity actually delivered, though the timing of deliveries may be modified from time to time.\nFinancial Overview\nRevenue, Cost of revenue, Margin and Earnings from operations (operating profit) presented below, include amounts from external parties and exclude intersegment activity that is eliminated in consolidation.\nYear Ended August 31,\n(In millions, except per share amounts)\nRevenue:\nManufacturing\n$\n2,476.6\n$\n1,311.1\nMaintenance Services\n347.7\n298.3\nLeasing & Management Services\n153.4\n138.5\n2,977.7\n1,747.9\nCost of revenue:\nManufacturing\n2,300.9\n1,189.2\nMaintenance Services\n322.0\n280.4\nLeasing & Management Services\n48.8\n46.7\n2,671.7\n1,516.3\nMargin:\nManufacturing\n175.7\n121.9\nMaintenance Services\n25.7\n17.9\nLeasing & Management Services\n104.6\n91.8\n306.0\n231.6\nSelling and administrative\n225.2\n191.8\nNet gain on disposition of equipment\n(37.2\n)\n(1.2\n)\nEarnings from operations\n118.0\n41.0\nInterest and foreign exchange\n57.4\n43.3\nNet loss on extinguishment of debt\n-\n6.3\nEarnings (loss) before income tax and earnings from\nunconsolidated affiliates\n60.6\n(8.6\n)\nIncome tax (expense) benefit\n(18.1\n)\n40.2\nEarnings before earnings from unconsolidated affiliates\n42.5\n31.6\nEarnings from unconsolidated affiliates\n11.3\n3.5\nNet earnings\n53.8\n35.1\nNet earnings attributable to noncontrolling interest\n(6.9\n)\n(2.7\n)\nNet earnings attributable to Greenbrier\n$\n46.9\n$\n32.4\nDiluted earnings per common share\n$\n1.40\n$\n0.96\nPerformance for our segments is evaluated based on operating profit. Corporate includes selling and administrative costs not directly related to goods and services and certain costs that are intertwined among segments due to our integrated business model. Management does not allocate Interest and foreign exchange or Income tax (expense) benefit for either external or internal reporting purposes.\nYear Ended August 31,\n(In millions)\nOperating profit (loss):\nManufacturing\n$\n97.2\n$\n48.3\nMaintenance Services\n21.7\n6.5\nLeasing & Management Services\n108.3\n68.9\nCorporate\n(109.2\n)\n(82.7\n)\n$\n118.0\n$\n41.0\nConsolidated Results\nYear Ended August 31,\n2022 vs 2021\n(In millions)\nIncrease\n(Decrease)\n%\nChange\nRevenue\n$\n2,977.7\n$\n1,747.9\n$\n1,229.8\n70.4\n%\nCost of revenue\n$\n2,671.7\n$\n1,516.3\n$\n1,155.4\n76.2\n%\nMargin (%)\n10.3\n%\n13.3\n%\n(3.0\n)%\n*\nNet earnings attributable to Greenbrier\n$\n46.9\n$\n32.4\n$\n14.5\n44.8\n%\n* Not meaningful\nThrough our integrated business model, we provide a broad range of custom products and services in each of our segments, which have various average selling prices and margins. The demand for, and mix of, products and services delivered changes from period to period, which causes fluctuations in our results of operations.\nThe 70.4% increase in revenue for the year ended August 31, 2022 as compared to the prior year was primarily due to an 88.9% increase in Manufacturing revenue. The increase in Manufacturing revenue was primarily attributed to a 65.5% increase in railcar deliveries.\nThe 76.2% increase in cost of revenue for the year ended August 31, 2022 as compared to the prior year was primarily due to a 93.5% increase in Manufacturing cost of revenue. The increase in Manufacturing cost of revenue was primarily attributed to a 65.5% increase in railcar deliveries and higher steel and other input costs in the current year.\nMargin as a percentage of revenue was 10.3% and 13.3% for the years ended August 31, 2022 and 2021, respectively. The overall margin as a percentage of revenue was negatively impacted by a decrease in Manufacturing margin from 9.3% to 7.1% was primarily attributed to higher costs and inefficiencies in our Manufacturing operations in part due to ramping up production. Many of our customer contracts include price escalation provisions. When certain of our manufacturing costs increase, we are able to increase the sales price to our customers. While this has no impact to our margin dollars, the increase in revenue and cost of sales has a negative impact to our margin as a percentage of revenue.\nThe $14.5 million increase in net earnings attributable to Greenbrier for the year ended August 31, 2022 as compared to the prior year was primarily due to the following:\nAn increase in margin dollars primarily due to higher railcar deliveries and syndication revenue for the year ended August 31, 2022.\nAn increase in Net gain on disposition of equipment for the year ended August 31, 2022.\nThese were partially offset by:\nThe income tax benefit for the year ended August 31, 2021, which primarily related to accelerated depreciation and the impact of the CARES Act which allowed us to carry back tax losses to years when tax rates were higher, resulting in a tax benefit.\nAn increase in Selling and administrative expense for the year ended August 31, 2022 primarily attributed to higher employee related costs as well as higher costs for legal, consulting and travel associated with increased business activity.\nManufacturing Segment\nYear Ended August 31,\n2022 vs 2021\n(In millions, except railcar deliveries)\nIncrease\n(Decrease)\n%\nChange\nRevenue\n$\n2,476.6\n$\n1,311.1\n$\n1,165.5\n88.9\n%\nCost of revenue\n$\n2,300.9\n$\n1,189.2\n$\n1,111.7\n93.5\n%\nMargin (%)\n7.1\n%\n9.3\n%\n(2.2\n)%\n*\nOperating profit ($)\n$\n97.2\n$\n48.3\n$\n48.9\n101.2\n%\nOperating profit (%)\n3.9\n%\n3.7\n%\n0.2\n%\n*\nDeliveries\n18,700\n11,300\n7,400\n65.5\n%\n* Not meaningful\nOur Manufacturing segment primarily generates revenue from manufacturing a wide range of freight railcars and from the conversion of existing or in-service railcars through our facilities in North America and Europe. We also manufacture a broad range of ocean-going and river barges for transporting merchandise between ports within the United States.\nManufacturing revenue increased $1.2 billion or 88.9% for the year ended August 31, 2022 compared to the prior year. The increase in revenue was primarily attributed to a 65.5% increase in railcar deliveries. The increase was also due to the additional revenue associated with an increase in steel and other input costs during the year ended August 31, 2022, as many of our customer contracts include price escalation provisions when certain of our manufacturing costs increase.\nManufacturing cost of revenue increased $1.1 billion or 93.5% for the year ended August 31, 2022 compared to the prior year. The increase in cost of revenue was primarily attributed to a 65.5% increase in the volume of railcar deliveries and higher steel and other input costs as well as inefficiencies in our Manufacturing operations in part due to ramping up production and supply chain issues during the year ended August 31, 2022.\nManufacturing margin as a percentage of revenue decreased 2.2% for the year ended August 31, 2022 compared to the prior year. The decrease in margin percentage for the year ended August 31, 2022 was primarily attributed to higher costs and inefficiencies in our Manufacturing operations in part due to ramping up production. Many of our customer contracts include price escalation provisions. When certain of our manufacturing costs increase, we are able to increase the sales price to our customers. While this has no impact to our margin dollars, the increase in revenue and cost of sales has a negative impact to our margin as a percentage of revenue. In addition, the margin percentage for year ended August 31, 2021 benefited from a $15.8 million favorable resolution of warranty and other loss contingencies associated with our international operations.\nManufacturing operating profit increased $48.9 million for the year ended August 31, 2022 compared to the prior year. The increase in operating profit was primarily attributed to an increase in railcar deliveries.\nMaintenance Services Segment\nYear Ended August 31,\n2022 vs 2021\n(In millions)\nIncrease\n(Decrease)\n%\nChange\nRevenue\n$\n347.7\n$\n298.3\n$\n49.4\n16.6\n%\nCost of revenue\n$\n322.0\n$\n280.4\n$\n41.6\n14.8\n%\nMargin (%)\n7.4\n%\n6.0\n%\n1.4\n%\n*\nOperating profit ($)\n$\n21.7\n$\n6.5\n$\n15.2\n233.8\n%\nOperating profit (%)\n6.2\n%\n2.2\n%\n4.0\n%\n*\n* Not meaningful\nOur Maintenance Services segment primarily generates revenue from railcar component manufacturing and servicing and from providing railcar maintenance services.\nMaintenance Services revenue increased $49.4 million or 16.6% for the year ended August 31, 2022 compared to the prior year. The increase was primarily attributed to higher volumes due to increased demand and an increase in scrap metal pricing and volume as we scrap wheels and other components.\nMaintenance Services cost of revenue increased $41.6 million or 14.8% for the year ended August 31, 2022 compared to the prior year. The increase was primarily due to higher costs associated with an increase in volumes and an increase in material and labor costs.\nMaintenance Services margin as a percentage of revenue increased 1.4% for the year ended August 31, 2022 compared to the prior year. The increase in margin percentage was primarily attributed to an increase in volumes and scrap metal pricing. These were partially offset by higher material and labor costs during the year ended August 31, 2022.\nMaintenance Services operating profit increased $15.2 million or 233.8% for the year ended August 31, 2022 compared to the prior year. The increase in operating profit was primarily attributed to higher volumes and an increase in scrap metal pricing and lower selling and administrative costs.\nLeasing & Management Services Segment\nYear Ended August 31,\n2022 vs 2021\n(In millions)\nIncrease\n(Decrease)\n%\nChange\nRevenue\n$\n153.4\n$\n138.5\n$\n14.9\n10.8\n%\nCost of revenue\n$\n48.8\n$\n46.7\n$\n2.1\n4.5\n%\nMargin (%)\n68.2\n%\n66.3\n%\n1.9\n%\n*\nOperating profit ($)\n$\n108.3\n$\n68.9\n$\n39.4\n57.2\n%\nOperating profit (%)\n70.6\n%\n49.7\n%\n20.9\n%\n*\n* Not meaningful\nOur Leasing & Management Services segment generates revenue from leasing railcars from our lease fleet which includes GBX Leasing, providing various management services, syndication revenue associated with new railcar sales with leases attached, interim rent on leased railcars for syndication and the sale of railcars purchased from third parties with the intent to resell. The gross proceeds from the sale of these railcars are recorded in revenue and the costs of purchasing these railcars are recorded in cost of revenue.\nLeasing & Management Services revenue increased $14.9 million or 10.8% for the year ended August 31, 2022 compared to the prior year. The increase was primarily attributed to higher syndication revenue from an increase in the volume of new railcar sales with leases attached as well as higher revenue from additions to our lease fleet. In addition, revenue for the year ended August 31, 2021 benefited from a lease modification and transfer fee.\nLeasing & Management Services cost of revenue increased $2.1 million or 4.5% for the year ended August 31, 2022 compared to the prior year. The increase was primarily due to an increase in costs from the additions to our lease fleet, partially offset by lower costs associated with railcars we had purchased from third parties with the intent to resell.\nLeasing & Management Services margin as a percentage of revenue increased 1.9% for the year ended August 31, 2022 compared to the prior year. The increase in margin percentage was primarily attributed to higher syndication activity. In addition, the margin percentage for the year ended August 31, 2021 was negatively impacted by higher sales of railcars that we purchased from third parties which have lower margin percentages.\nLeasing & Management Services operating profit increased $39.4 million or 57.2% for the year ended August 31, 2022 compared to the prior year. The increase was primarily attributed to an increase of $32.5 million net gain on disposition of equipment and higher syndication activity.\nSelling and Administrative\nYear Ended August 31,\n2022 vs 2021\n(In millions)\nIncrease\n(Decrease)\n%\nChange\nSelling and Administrative\n$\n225.2\n$\n191.8\n$\n33.4\n17.4\n%\nSelling and administrative expense was $225.2 million or 7.6% of revenue for the year ended August 31, 2022 and $191.8 million or 11.0% of revenue for the year ended August 31, 2021.\nThe $33.4 million increase was primarily attributed to higher employee related costs as well as higher costs for legal, consulting and travel associated with increased business activity.\nNet Gain on Disposition of Equipment\nNet gain on disposition of equipment primarily includes the sale of assets from our lease fleet (Equipment on operating leases, net) and disposition of property, plant and equipment. Assets are periodically sold in the normal course of business in order to accommodate customer demand and to manage risk and liquidity.\nNet gain on disposition of equipment was $37.2 million and $1.2 million for the years ended August 31, 2022 and 2021, respectively. The increase in Net gain on disposition of equipment was primarily attributed to sales of assets from our lease fleet during the year ended August 31, 2022.\nInterest and Foreign Exchange\nInterest and foreign exchange expense was composed of the following:\nYear Ended August 31,\nIncrease (decrease)\n(In millions)\n2022 vs 2021\nInterest and foreign exchange:\nInterest and other expense\n$\n55.7\n$\n44.7\n$\n11.0\nForeign exchange (gain) loss\n1.7\n(1.4\n)\n3.1\n$\n57.4\n$\n43.3\n$\n14.1\nThe $14.1 million increase in interest and foreign exchange expense during the year ended August 31, 2022 compared to the prior year was primarily attributed to an increase in interest expense from higher levels of borrowings and interest rates.\nNet Loss on Extinguishment of Debt\nNet loss on extinguishment of debt was $6.3 million for the year ended August 31, 2021 relates to the retirement of $227.3 million of our 2.875% convertible notes due 2024 and $50.0 million of our 2.25% convertible notes due 2024.\nIncome Tax\nIn 2022 our income tax expense was $18.1 million on $60.6 million of pre-tax earnings for an effective tax rate of 29.9%. The tax rate was primarily attributable to the geographic mix of earnings, partially offset by net favorable discrete items.\nIn 2021 our income tax benefit was $40.2 million on $8.6 million of pre-tax loss. The tax benefit was primarily attributable to accelerated depreciation and impact of the CARES Act which allowed us to carry back tax losses to years when tax rates were higher, resulting in a tax benefit. The tax benefit is primarily derived from the U.S. Federal tax rate differential between 2016 - 2017 tax rates of 35% and the current rate of 21%.\nThe effective tax rate can fluctuate year-to-year due to discrete items and changes in the mix of foreign and domestic pre-tax earnings. It can also fluctuate with changes in the proportion of pre-tax earnings attributable to our Mexican railcar manufacturing joint venture. The joint venture is treated as a partnership for tax purposes and, as a result, the partnerships entire pre-tax earnings are included in Earnings (loss) before income taxes and earnings from unconsolidated affiliates, whereas only our 50% share of the tax is included in Income tax (expense) benefit.\nEarnings From Unconsolidated Affiliates\nThrough unconsolidated affiliates we produce rail and industrial components and have an ownership stake in a railcar manufacturer in Brazil. We record the after-tax results from these unconsolidated affiliates.\nEarnings from unconsolidated affiliates was $11.3 million and $3.5 million for the years ended August 31, 2022 and 2021, respectively. The increase was primarily attributable to higher profitability at our Brazil operations.\nNet Earnings Attributable to Noncontrolling Interest\nNet earnings attributable to noncontrolling interest was $6.9 million and $2.7 million for the years ended August 31, 2022 and 2021, respectively, which primarily represents our joint venture partner's share in the results of operations of our Mexican railcar manufacturing joint ventures, adjusted for intercompany sales, and our European partners share of the results of our European operations.\nLiquidity and Capital Resources\nYear Ended August 31,\n(In millions)\nNet cash used in operating activities\n$\n(150.4\n)\n$\n(40.5\n)\nNet cash used in investing activities\n(224.0\n)\n(117.8\n)\nNet cash provided by (used in) financing activities\n244.9\n(22.7\n)\nEffect of exchange rate changes\n17.2\n10.3\nNet decrease in cash and cash equivalents and restricted cash\n$\n(112.3\n)\n$\n(170.7\n)\nWe have been financed through cash generated from operations and borrowings. At August 31, 2022 cash and cash equivalents and restricted cash were $559.1 million, a decrease of $112.3 million from $671.4 million at the prior year end.\nCash Flows From Operating Activities\nThe change in cash used in operating activities for 2022 compared to 2021 was primarily due to a net increase in working capital as we increased production rates and from higher steel and other input costs. Cash flows from operating activities benefited from a cash tax refund received in 2022.\nCash Flows From Investing Activities\nCash used in investing activities primarily relates to capital expenditures net of proceeds from the sale of assets and investment activity with our unconsolidated affiliates. The change in cash used in investing activities for 2022 compared to 2021 was primarily attributable to an increase in capital expenditures partially offset by an increase in proceeds from the sale of assets. The increase in capital expenditures in 2022 primarily relates to additions to our lease fleet as part of our leasing strategy.\nYear Ended August 31,\n(In millions)\nCapital expenditures:\nLeasing & Management Services\n$\n(323.2\n)\n$\n(103.8\n)\nManufacturing\n(48.3\n)\n(26.6\n)\nMaintenance Services\n(9.2\n)\n(8.6\n)\nTotal capital expenditures (gross)\n$\n(380.7\n)\n$\n(139.0\n)\nProceeds from sale of equipment\n155.5\n15.9\nTotal capital expenditures (net of proceeds)\n$\n(225.2\n)\n$\n(123.1\n)\nCapital expenditures primarily relate to additions to our lease fleet and on-going investments into our facilities, including the safety and productivity of our facilities. Proceeds from the sale of assets primarily relate to sales of railcars from our lease fleet within Leasing & Management Services. Assets from our lease fleet are periodically sold in the normal course of business to accommodate customer demand and to manage risk and liquidity.\nCapital expenditures for 2023 are expected to be approximately $240 million for Leasing & Management Services, approximately $80 million for Manufacturing and approximately $10 million for Maintenance Services. Capital expenditures for 2023 primarily relate to additions to our lease fleet reflecting our enhanced leasing strategy and continued investments into the safety and productivity of our facilities.\nCash Flows From Financing Activities\nThe change in cash provided by (used in) financing activities for 2022 compared to 2021 was primarily attributed to proceeds from the issuance of debt, net of repayments. During the year ended August 31, 2022 we issued asset backed securities of $323.3 million, and used proceeds to pay down our warehouse credit facility for GBX Leasing. We also amended our $200 million term facility to provide an additional $75 million in term debt, with another $75 million available as a delayed draw within the next six months.\nDuring 2021, we refinanced certain debt by issuing $373.8 million of new convertible notes due 2028 and retiring a total of $277.3 million of convertible notes due 2024. We also renewed and extended our $600.0 million domestic revolving facility, $291.9 million term loan to 2026 and $200.0 million term loan until August 2027. GBX Leasing entered into its initial $300.0 million non-recourse warehouse credit facility, which was increased to $350 million in 2022.\nDividend & Share Repurchase Program\nA quarterly dividend of $0.27 per share was declared on October 18, 2022.\nThe Board of Directors has authorized our company to repurchase shares of our common stock. The share repurchase program has an expiration date of January 31, 2023. The amount remaining for repurchase was $100.0 million as of August 31, 2022. Under the share repurchase program, shares of common stock may be purchased on the open market or through privately negotiated transactions from time to time. The timing and amount of purchases will be based upon market conditions, securities law limitations and other factors. The program may be modified, suspended or discontinued at any time without prior notice. The share repurchase program does not obligate us to acquire any specific number of shares in any period. There were no shares repurchased under the share repurchase program during 2022, 2021 or 2020.\nCash, Borrowing Availability and Credit Facilities\nAs of August 31, 2022, we had $543.0 million in Cash and cash equivalents and $147.9 million in available borrowings. Our current cash balance is part of our strategy to maintain strong liquidity to respond to current uncertainties.\nSenior secured credit facilities, consisting of four components, aggregated to $1.14 billion as of August 31, 2022. We had an aggregate of $147.9 million available to draw down under committed credit facilities as of August 31, 2022. This amount consists of $97.3 million available on the North American credit facility, $15.6 million on the European credit facilities and $35.0 million on the Mexican credit facilities.\nAs of August 31, 2022, a $600.0 million revolving line of credit, maturing August 2026, secured by substantially all of our U.S. assets not otherwise pledged as security for term loans, the warehouse credit facility or the railcar asset-backed securities, was available to provide working capital and interim financing of equipment, principally for the Companys U.S. and Mexican operations. Advances under this facility bear interest at SOFR plus 1.50% plus 0.10% as a SOFR adjustment or Prime plus 0.50% depending on the type of borrowing. Available borrowings under the credit facility are generally based on defined levels of eligible inventory, receivables, property, plant and equipment and leased equipment, as well as total debt to consolidated capitalization and fixed charges coverage ratios.\nAs of August 31, 2022, a $350.0 million non-recourse warehouse credit facility existed to support the operations of GBX Leasing, a joint venture in which we own approximately 95%. Advances under this facility bear interest at SOFR plus 1.85% plus 0.11% as a SOFR adjustment. The warehouse credit facility converts to a term loan in August 2025 and matures in August 2027. As of August 31, 2022, there were no outstanding borrowings associated with this facility. We intend that GBX Leasing will aggregate leased railcars to obtain term or capital market financing, similar to the securitization in February 2022.\nAs of August 31, 2022, lines of credit totaling $67.2 million secured by certain of our European assets, with variable rates that range from Warsaw Interbank Offered Rate (WIBOR) plus 1.2% to WIBOR plus 1.6% and Euro Interbank Offered Rate (EURIBOR) plus 1.5%, were available for working capital needs of our European manufacturing operations. The European lines of credit include $40.8 million which are guaranteed by us. European credit facilities are regularly renewed. Currently, these European credit facilities have maturities that range from September 2022 through October 2023.\nAs of August 31, 2022, our Mexican railcar manufacturing operations had four lines of credit totaling $120.0 million. The first line of credit provides up to $30.0 million, of which we and our joint venture partner have each guaranteed 50%. Advances under this facility bear interest at LIBOR plus 3.75% to 4.25%. The Mexican railcar manufacturing joint venture will be able to draw amounts available under this facility through June 2024. The second line of credit provides up to $35.0 million, of which we and our joint venture partner have each guaranteed 50%. Advances under this facility bear interest at LIBOR plus 3.75%. The Mexican railcar manufacturing joint venture will be able to draw amounts available under this facility through June 2023. The third line of credit provides up to $50.0 million and matures in October 2024. Advances under this facility bear interest at LIBOR plus 4.25%. The fourth line of credit provided up to $5.0 million and matured September 2022. Advances under this facility bear interest at LIBOR plus 2.95% and are to be used for working capital needs.\nAs of August 31,\n(In millions)\nCredit facility balances:\nNorth America\n$\n160.0\n$\n160.0\nGBX Leasing\n-\n147.0\nEurope\n51.6\n50.2\nMexico\n85.0\n15.0\nTotal Revolving notes\n$\n296.6\n$\n372.2\nAs of August 31, 2022, outstanding commitments under the North American credit facility included letters of credit which totaled $6.9 million.\nOther Information\nThe revolving and operating lines of credit, along with notes payable, contain covenants with respect to us and our various subsidiaries, the most restrictive of which, among other things, limit our ability to: incur additional indebtedness or guarantees; pay dividends or repurchase stock; enter into financing leases; create liens; sell assets; engage in transactions with affiliates, including joint ventures and non U.S. subsidiaries, including but not limited to loans, advances, equity investments and guarantees; enter into mergers, consolidations or sales of substantially all our assets; and enter into new lines of business. The covenants also require certain maximum ratios of debt to total capitalization and minimum levels of fixed charges (interest plus rent) coverage. As of August 31, 2022, we were in compliance with all such restrictive covenants.\nFrom time to time, we may seek to repurchase or otherwise retire or exchange securities, including outstanding convertible notes, borrowings and equity securities, and take other steps to reduce our debt, extend the maturities of our debt or otherwise improve our balance sheet. These actions may include open market repurchases, unsolicited or solicited privately negotiated transactions or other retirements, repurchases or exchanges. Such retirements, repurchases or exchanges of one note or security for another note or security (now or hereafter existing), if any, will depend on a number of factors, including, but not limited to, prevailing market conditions, trading levels of our debt, our liquidity requirements and contractual restrictions, if applicable. The amounts involved in any such transactions may, individually or in the aggregate, be material and may involve all or a portion of a particular series of notes or other indebtedness which may reduce the float and impact the trading market of notes or other indebtedness which remain outstanding.\nWe have global operations that conduct business in their local currencies as well as other currencies. To mitigate the exposure to transactions denominated in currencies other than the functional currency of each entity, we enter into foreign currency forward exchange contracts with established financial institutions to protect the revenue or margin on a portion of forecasted foreign currency sales and expenses. Given the strong credit standing of the counterparties, no provision has been made for credit loss due to counterparty non-performance.\nTo mitigate the exposure to changes in interest rates, we have managed a portion of our variable rate debt with interest rate swap agreements, effectively converting $478.7 million of variable rate debt to fixed rate debt as of August 31, 2022.\nWe expect existing funds and cash generated from operations, together with proceeds from financing activities including borrowings under existing credit facilities and long-term financings, to be sufficient to fund expected debt repayments, working capital needs, planned capital expenditures, additional investments in our unconsolidated affiliates and dividends during the next twelve months.\nThe following table shows our estimated future contractual cash obligations as of August 31, 2022:\nYear Ended August 31,\n(In millions)\nTotal\nThereafter\nNotes payable\n$\n1,290.2\n$\n35.3\n$\n83.8\n$\n36.4\n$\n259.1\n$\n241.9\n$\n633.7\nInterest (1)\n289.7\n43.8\n40.9\n38.9\n36.0\n27.1\n103.0\nRailcar & operating leases\n61.7\n12.9\n11.1\n8.4\n7.3\n4.6\n17.4\nRevolving notes\n296.6\n296.6\n-\n-\n-\n-\n-\n$\n1,938.2\n$\n388.6\n$\n135.8\n$\n83.7\n$\n302.4\n$\n273.6\n$\n754.1\n(1)A portion of the estimated future cash obligation relates to interest on variable rate borrowings. Amounts are based on interest rates as of August 31, 2022.\nOff Balance Sheet Arrangements\nWe do not currently have off balance sheet arrangements that have or are likely to have a material current or future effect on our Consolidated Financial Statements.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires judgment on the part of management to arrive at estimates and assumptions on matters that are inherently uncertain. These estimates may affect the amount of assets, liabilities, revenue and expenses reported in the financial statements and accompanying notes and disclosure of contingent assets and liabilities within the financial statements. Estimates and assumptions are periodically evaluated and may be adjusted in future periods. Actual results could differ from those estimates.\nGoodwill - In accordance with Accounting Standards Codification (ASC) Topic 350, Intangibles-Goodwill and Other (ASC 350), the Company evaluates goodwill for possible impairment annually or more frequently if events or changes in circumstances indicate that the carrying amount of such assets may not be recoverable. The Company uses a two-step process to assess the realizability of goodwill. The first step is a qualitative assessment that analyzes macroeconomic considerations and industry indicators, financial performance and cost estimates associated with a particular reporting unit. This assessment requires subjectivity based on cumulative information available at the assessment date. If a qualitative assessment indicates it is more likely than not that the fair value of a reporting unit is less than its carrying amount, the Company will proceed to the quantitative second step where the fair value of a reporting unit is calculated based on weighted income and market-based approaches.\nIf the fair value of a reporting unit is lower than its carrying value, an impairment to goodwill is recorded, not to exceed the carrying amount of goodwill in the reporting unit. We performed our annual goodwill impairment test during the third quarter of 2022 and concluded that goodwill for all reporting units was not impaired.\nPursuant to the authoritative guidance, we make certain estimates and assumptions to determine our reporting units and whether the fair value for each reporting unit is greater than its carry value. The above highlighted judgments contemplated estimates and effects of macroeconomic trends that are inherently uncertain. Changes in these estimates, which may include the effects of inflation and policy reactions thereto, continued increases in pricing of materials and components, or potential macroeconomic events may cause future assessment conclusions to differ.\nIncome taxes - The asset and liability method is used to account for income taxes. We are required to estimate the timing of the recognition of deferred tax assets and liabilities, make assumptions about the future deductibility of deferred tax assets and assess deferred tax liabilities based on enacted law and tax rates for each tax jurisdiction to determine the amount of deferred tax assets and liabilities. Deferred income taxes are provided for the temporary effects of differences between assets and liabilities recognized for financial statement and income tax reporting purposes. Valuation allowances reduce deferred tax assets to an amount that will more likely than not be realized. We recognize liabilities for uncertain tax positions based on whether evidence indicates that it is more likely than not that the position will be sustained on audit.\nIt is inherently difficult and subjective to estimate whether a valuation allowance or uncertain tax position is necessary. In making this assessment, management may analyze future taxable income, reversing temporary differences and/or ongoing tax planning strategies. Should a change in circumstances lead to a change in judgment about the realizability of deferred tax assets in future years, the Company would adjust related valuation allowances in the period that the change in circumstances occurs, along with a corresponding increase or charge to income. Changes in tax law or court interpretations may result in the recognition of a tax benefit or an additional charge to the tax provision. For further information regarding income taxes, see Note 17 of the Consolidated Financial Statements.\nWarranty accruals - Warranty costs to cover a defined warranty period are estimated and charged to operations. The estimated warranty cost is based on historical warranty claims for each particular product type. For new product types without a warranty history, preliminary estimates are based on historical information for similar product types.\nThese estimates are inherently uncertain as they are based on historical data for existing products and judgment for new products. If warranty claims are made in the current period for issues that have not historically been the subject of warranty claims and were not taken into consideration in establishing the accrual or if claims for issues already considered in establishing the accrual exceed expectations, warranty expense may exceed the accrual for that particular product. Conversely, there is the possibility that claims may be lower than estimates. The warranty accrual is periodically reviewed and updated based on warranty trends. However, as we cannot predict future claims, the potential exists for the difference in any one reporting period to be material. For further information regarding the warranty accrual, see Note 11 of the Consolidated Financial Statements.\nEnvironmental costs - At times we may be involved in various proceedings related to environmental matters. We estimate future costs for known environmental remediation requirements and accrue for them when it is probable that we have incurred a liability and the related costs can be reasonably estimated based on currently available information. Adjustments to these liabilities are made when additional information becomes available that affects the estimated costs to study or remediate any environmental issues or when expenditures for which reserves are established are made.\nJudgments used in determining if a liability is estimable are subjective and based on known facts and our historic experience. If further developments in or resolution of an environmental matter result in facts and circumstances that differ from those assumptions used to develop these reserves, the accrual for environmental remediation could be materially understated or overstated. Due to the uncertain nature of environmental matters, there can be no assurance that we will not become involved in future litigation or other proceedings or, if we were found to be responsible or liable in any litigation or proceeding, that such costs would not be material to us. For further information regarding our environmental costs, see Note 21 of the Consolidated Financial Statements.\nNew Accounting Pronouncements\nSee Note 2 of Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K. Item 7A.\tQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nForeign Currency Exchange Risk\nWe have global operations that conduct business in their local currencies as well as other currencies. To mitigate the exposure to transactions denominated in currencies other than the functional currency of each entity, we enter into foreign currency forward exchange contracts to protect revenue or margin on a portion of forecasted foreign currency sales and expenses. At August 31, 2022 exchange rates, notional amounts of forward exchange contracts for the purchase of Polish Zlotys and the sale of Euros; and the purchase of Mexican Pesos and the sale of U.S. Dollars aggregated to $73.6 million. Because of the variety of currencies in which purchases and sales are transacted and the interaction between currency rates, it is not possible to predict the impact of a movement in a single foreign currency exchange rate would have on future operating results.\nIn addition to exposure to transaction gains or losses, we are also exposed to foreign currency exchange risk related to the net asset position of our foreign subsidiaries. At August 31, 2022, net assets of foreign subsidiaries aggregated to $146.1 million and a 10% strengthening of the U.S. Dollar relative to the foreign currencies would result in a decrease in equity of $14.6 million, or 1.1% of Total equity - Greenbrier. This calculation assumes that each exchange rate would change in the same direction relative to the U.S. Dollar.\nInterest Rate Risk\nWe have managed a portion of our variable rate debt with interest rate swap agreements, effectively converting $478.7 million of variable rate debt to fixed rate debt. Notwithstanding these interest rate swap agreements, we are still exposed to interest rate risk relating to our revolving debt and a portion of term debt, which are at variable rates. At August 31, 2022, 79% of our outstanding debt had fixed rates and 21% had variable rates. At August 31, 2022, a uniform 10% increase in variable interest rates would result in approximately $1.4 million of additional annual interest expense.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nThe Greenbrier Companies, Inc.:\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of The Greenbrier Companies, Inc. and subsidiaries (the Company) as of August 31, 2022 and 2021, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended August 31, 2022, and the related notes (collectively, the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the three-year period ended August 31, 2022, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, and our report dated October 28, 2022 expressed an adverse opinion on the effectiveness of the Companys internal control over financial reporting.\nChange in Accounting Principle\nAs discussed in Note 2 to the consolidated financial statements, the Company has changed its method of accounting for convertible instruments and contracts in the Companys own equity as of September 1, 2021 due to the adoption of Accounting Standards Update 2020-06, Accounting for Convertible Instruments and Contracts in an Entitys Own Equity.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nQualitative goodwill impairment assessment of the Europe Manufacturing and Wheels & Parts reporting units\nAs discussed in Note 7 to the consolidated financial statements, the goodwill balance as of August 31, 2022 was $127.3 million, of which $27.7 million related to the Europe Manufacturing reporting unit and $43.0 million related to the Wheels & Parts reporting unit. As discussed in Note 2, the Company performs goodwill impairment testing on an annual basis and whenever events or changes in circumstances indicate that the carrying value of a reporting unit likely exceeds its fair value using either a qualitative or a quantitative assessment. If the qualitative assessment is performed and the Company determines that fair value of each reporting unit more likely than not exceeds its carrying value, no further assessment is necessary. For the annual impairment test that occurred during 2022, the Company performed a qualitative assessment to test the goodwill related to its Europe Manufacturing and Wheels & Parts reporting units.\nWe identified the evaluation of the Companys qualitative assessment that it was more likely than not the fair value of the Europe Manufacturing and Wheels & Parts reporting units exceeded their carrying values as a critical audit matter. There was subjective auditor judgement in evaluating the impact of (1) macroeconomic considerations, as well as industry and market indicators included in the Companys goodwill impairment assessment, and (2) the entity-specific financial performance, including managements current and prior year cost reduction initiatives on the reporting units actual financial results.\nThe following are the primary procedures we performed to address this critical audit matter. We evaluated the design and tested the operating effectiveness of certain internal controls related to the goodwill impairment process. This included controls related to the evaluation of the qualitative factors used by the Company to assess the Europe Manufacturing and Wheels & Parts reporting units. We evaluated the Companys assessment of the macroeconomic considerations, as well as industry and market indicators by comparing them to publicly available industry and market information. We evaluated the entity-specific financial performance, including managements cost reduction initiatives, by:\ncomparing actual and projected performance to projected results of relevant prior periods, and\nassessing cost savings resulting from current and prior year actions on the reporting units actual financial results.\n/s/ KPMG LLP\nWe have served as the Companys auditor since 2011.\nPortland, Oregon\nOctober 28, 2022 Item 8.\tFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Balance Sheets\nAs of August 31,\n(In millions, except number of shares which are reflected in thousands)\nAssets\nCash and cash equivalents\n$\n543.0\n$\n646.8\nRestricted cash\n16.1\n24.6\nAccounts receivable, net\n501.2\n306.4\nIncome tax receivable\n39.8\n112.1\nInventories\n815.3\n573.6\nLeased railcars for syndication\n111.1\n51.6\nEquipment on operating leases, net\n770.9\n609.8\nProperty, plant and equipment, net\n645.2\n670.2\nInvestment in unconsolidated affiliates\n92.5\n79.9\nIntangibles and other assets, net\n189.1\n183.6\nGoodwill\n127.3\n132.1\n$\n3,851.5\n$\n3,390.7\nLiabilities and Equity\nRevolving notes\n$\n296.6\n$\n372.2\nAccounts payable and accrued liabilities\n725.1\n569.8\nDeferred income taxes\n68.6\n73.3\nDeferred revenue\n35.3\n42.8\nNotes payable, net\n1,269.1\n826.5\nCommitments and contingencies (Notes 20 & 21)\nContingently redeemable noncontrolling interest\n27.7\n29.7\nEquity\nGreenbrier\nPreferred stock - without par value; 25,000 shares authorized; none\noutstanding\n-\n-\nCommon stock - without par value; 50,000 shares authorized; 32,603\nand 32,397 outstanding at August 31, 2022 and 2021\n-\n-\nAdditional paid-in capital\n424.8\n469.7\nRetained earnings\n897.7\n881.7\nAccumulated other comprehensive loss\n(45.6\n)\n(43.7\n)\nTotal equity - Greenbrier\n1,276.9\n1,307.7\nNoncontrolling interest\n152.2\n168.7\nTotal equity\n1,429.1\n1,476.4\n$\n3,851.5\n$\n3,390.7\nThe accompanying notes are an integral part of these financial statements.\nConsolidated Statements of Income\nYears ended August 31,\n(In millions, except number of shares which are reflected in thousands and per share amounts)\nRevenue\nManufacturing\n$\n2,476.6\n$\n1,311.1\n$\n2,309.5\nMaintenance Services\n347.7\n298.3\n324.7\nLeasing & Management Services\n153.4\n138.5\n158.0\n2,977.7\n1,747.9\n2,792.2\nCost of revenue\nManufacturing\n2,300.9\n1,189.2\n2,065.2\nMaintenance Services\n322.0\n280.4\n302.2\nLeasing & Management Services\n48.8\n46.7\n71.7\n2,671.7\n1,516.3\n2,439.1\nMargin\n306.0\n231.6\n353.1\nSelling and administrative\n225.2\n191.8\n204.7\nNet gain on disposition of equipment\n(37.2\n)\n(1.2\n)\n(20.0\n)\nEarnings from operations\n118.0\n41.0\n168.4\nOther costs\nInterest and foreign exchange\n57.4\n43.3\n43.6\nNet loss on extinguishment of debt\n-\n6.3\n-\nEarnings (loss) before income tax and earnings from\nunconsolidated affiliates\n60.6\n(8.6\n)\n124.8\nIncome tax (expense) benefit\n(18.1\n)\n40.2\n(40.2\n)\nEarnings before earnings from unconsolidated affiliates\n42.5\n31.6\n84.6\nEarnings from unconsolidated affiliates\n11.3\n3.5\n3.0\nNet earnings\n53.8\n35.1\n87.6\nNet earnings attributable to noncontrolling interest\n(6.9\n)\n(2.7\n)\n(38.6\n)\nNet earnings attributable to Greenbrier\n$\n46.9\n$\n32.4\n$\n49.0\nBasic earnings per common share\n$\n1.44\n$\n0.99\n$\n1.50\nDiluted earnings per common share\n$\n1.40\n$\n0.96\n$\n1.46\nWeighted average common shares\nBasic\n32,569\n32,648\n32,670\nDiluted\n33,631\n33,665\n33,441\nThe accompanying notes are an integral part of these financial statements.\nConsolidated Statements of Comprehensive Income\nYears ended August 31,\n(In millions)\nNet earnings\n$\n53.8\n$\n35.1\n$\n87.6\nOther comprehensive income (loss)\nTranslation adjustment\n(21.6\n)\n4.0\n(5.6\n)\nReclassification of derivative financial instruments recognized\nin net earnings 1\n4.7\n5.0\n4.2\nUnrealized gain (loss) on derivative financial instruments 2\n15.7\n(0.4\n)\n(7.3\n)\nOther (net of tax effect)\n(0.7\n)\n0.5\n0.7\n(1.9\n)\n9.1\n(8.0\n)\nComprehensive income\n51.9\n44.2\n79.6\nComprehensive income attributable to noncontrolling interest\n(6.9\n)\n(2.6\n)\n(38.6\n)\nComprehensive income attributable to Greenbrier\n$\n45.0\n$\n41.6\n$\n41.0\n1.Net of tax effect of ($1.7 million), ($1.7 million) and ($1.5 million) for the years ended August 31, 2022, 2021 and 2020, respectively\n2.Net of tax effect of ($6.2 million), $1.0 million and $2.9 million for the years ended August 31, 2022, 2021 and 2020, respectively\nThe accompanying notes are an integral part of these financial statements.\nConsolidated Statements of Equity\nAttributable to Greenbrier\n(In millions)\nCommon\nStock\nShares\nAdditional\nPaid-in\nCapital\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nLoss\nTotal\nEquity -\nGreenbrier\nNoncontrolling\nInterest\nTotal\nEquity\nContingently\nRedeemable\nNoncontrolling\nInterest\nBalance August 31, 2019\n32.5\n$453.9\n$867.6\n$(44.8)\n$1,276.7\n$165.0\n$1,441.7\n$31.5\nCumulative effect adjustment due to\nadoption of Topic 842 (See Note 2)\n-\n-\n4.4\n-\n4.4\n-\n4.4\n-\nNet earnings\n-\n-\n49.0\n-\n49.0\n39.1\n88.1\n(0.4)\nOther comprehensive loss, net\n-\n-\n-\n(8.0)\n(8.0)\n-\n(8.0)\n-\nNoncontrolling interest adjustments\n-\n-\n-\n-\n-\n1.4\n1.4\n-\nJoint venture partner distribution\ndeclared\n-\n-\n-\n-\n-\n(37.6)\n(37.6)\n-\nNoncontrolling interest acquired\n-\n-\n-\n-\n-\n12.1\n12.1\n-\nRestricted stock awards (net of\ncancellations)\n0.2\n2.7\n-\n-\n2.7\n-\n2.7\n-\nUnamortized restricted stock\n-\n(4.9)\n-\n-\n(4.9)\n-\n(4.9)\n-\nRestricted stock amortization\n-\n8.7\n-\n-\n8.7\n-\n8.7\n-\nCash dividends ($1.06 per share)\n-\n-\n(35.5)\n-\n(35.5)\n-\n(35.5)\n-\nBalance August 31, 2020\n32.7\n$460.4\n$885.5\n$(52.8)\n$1,293.1\n$180.0\n$1,473.1\n$31.1\nCumulative effect adjustment due to\nadoption of ASU 2016-13 (See\nNote 2)\n-\n-\n(0.5)\n-\n(0.5)\n-\n(0.5)\n-\nNet earnings\n-\n-\n32.4\n-\n32.4\n4.1\n36.5\n(1.4)\nOther comprehensive income, net\n-\n-\n-\n9.1\n9.1\n-\n9.1\n-\nNoncontrolling interest adjustments\n-\n-\n-\n-\n-\n2.2\n2.2\n-\nJoint venture partner distribution\ndeclared\n-\n-\n-\n-\n-\n(24.6)\n(24.6)\n-\nInvestment by joint venture partner\n-\n-\n-\n-\n-\n7.0\n7.0\n-\nRestricted stock awards (net of\ncancellations)\n0.2\n13.5\n-\n-\n13.5\n-\n13.5\n-\nUnamortized restricted stock\n-\n(16.8)\n-\n-\n(16.8)\n-\n(16.8)\n-\nRestricted stock amortization\n-\n14.7\n-\n-\n14.7\n-\n14.7\n-\nRepurchase of stock\n(0.5)\n(20.0)\n-\n-\n(20.0)\n-\n(20.0)\n-\n2.875% Convertible senior notes,\ndue 2028 - equity component, net\nof tax\n56.3\n-\n-\n56.3\n-\n56.3\n-\n2.875% Convertible senior notes,\ndue 2028 issuance costs - equity\ncomponent, net of tax\n-\n(1.8)\n-\n-\n(1.8)\n-\n(1.8)\n-\n2.875% Convertible senior notes,\ndue 2024 - equity component\nextinguishment, net of tax\n-\n(29.2)\n-\n-\n(29.2)\n-\n(29.2)\n-\n2.25% Convertible Senior Notes,\ndue 2024 - equity component, net\nof tax\n-\n(7.4)\n-\n-\n(7.4)\n-\n(7.4)\n-\nCash dividends ($1.08 per share)\n-\n-\n(35.7)\n-\n(35.7)\n-\n(35.7)\n-\nBalance August 31, 2021\n32.4\n$469.7\n$881.7\n$(43.7)\n$1,307.7\n$168.7\n$1,476.4\n$29.7\nCumulative effect adjustment due to\nadoption of ASU 2020-06 (See\nNote 2)\n-\n(58.9)\n4.9\n-\n(54.0)\n-\n(54.0)\n-\nNet earnings\n-\n-\n46.9\n-\n46.9\n8.9\n55.8\n(2.0)\nOther comprehensive loss, net\n-\n-\n-\n(1.9)\n(1.9)\n-\n(1.9)\n-\nNoncontrolling interest adjustments\n-\n2.2\n-\n-\n2.2\n(6.2)\n(4.0)\n-\nJoint venture partner distribution\ndeclared\n-\n-\n-\n-\n-\n(19.2)\n(19.2)\n-\nRestricted stock awards (net of\ncancellations)\n0.2\n11.3\n-\n-\n11.3\n-\n11.3\n-\nUnamortized restricted stock\n-\n(15.0)\n-\n-\n(15.0)\n-\n(15.0)\n-\nRestricted stock amortization\n-\n15.5\n-\n-\n15.5\n-\n15.5\n-\nCash dividends ($1.08 per share)\n-\n-\n(35.8)\n-\n(35.8)\n-\n(35.8)\n-\nBalance August 31, 2022\n32.6\n$424.8\n$897.7\n$(45.6)\n$1,276.9\n$152.2\n$1,429.1\n$27.7\nThe accompanying notes are an integral part of these financial statements.\nConsolidated Statements of Cash Flows\nYears ended August 31,\n(In millions)\nCash flows from operating activities\nNet earnings\n$\n53.8\n$\n35.1\n$\n87.6\nAdjustments to reconcile net earnings to net cash provided by (used in)\noperating activities:\nDeferred income taxes\n12.9\n51.1\n(9.5\n)\nDepreciation and amortization\n102.0\n100.7\n109.9\nNet gain on disposition of equipment\n(37.2\n)\n(1.2\n)\n(20.0\n)\nStock based compensation expense\n15.5\n14.7\n9.0\nNet loss on extinguishment of debt\n-\n6.3\n-\nAccretion of debt discount\n-\n7.1\n5.5\nNoncontrolling interest adjustments\n1.6\n2.3\n1.4\nOther\n3.8\n2.4\n1.0\nDecrease (increase) in assets:\nAccounts receivable, net\n(198.2\n)\n(82.1\n)\n144.4\nIncome tax receivable\n72.3\n(103.0\n)\n(9.1\n)\nInventories\n(267.9\n)\n(166.5\n)\n166.6\nLeased railcars for syndication\n(40.6\n)\n(11.9\n)\n(12.9\n)\nOther assets\n(28.1\n)\n(5.8\n)\n(65.0\n)\nIncrease (decrease) in liabilities:\nAccounts payable and accrued liabilities\n165.3\n109.9\n(108.8\n)\nDeferred revenue\n(5.6\n)\n0.4\n(27.9\n)\nNet cash provided by (used in) operating activities\n(150.4\n)\n(40.5\n)\n272.2\nCash flows from investing activities\nProceeds from sales of assets\n155.5\n15.9\n83.5\nCapital expenditures\n(380.7\n)\n(139.0\n)\n(66.9\n)\nInvestment in and advances to unconsolidated affiliates\n(2.3\n)\n-\n(1.8\n)\nCash distribution from unconsolidated affiliates and other\n3.5\n5.3\n12.7\nNet cash provided by (used in) investing activities\n(224.0\n)\n(117.8\n)\n27.5\nCash flows from financing activities\nNet changes in revolving notes with maturities of 90 days or less\n(101.3\n)\n197.4\n146.5\nProceeds from revolving notes with maturities longer than 90 days\n35.0\n112.0\n176.5\nRepayments of revolving notes with maturities longer than 90 days\n-\n(287.0\n)\n-\nProceeds from issuance of notes payable\n398.3\n391.9\n-\nRepayments of notes payable\n(23.4\n)\n(337.8\n)\n(30.2\n)\nDebt issuance costs\n(7.3\n)\n(22.0\n)\n-\nRepurchase of stock\n-\n(20.0\n)\n-\nDividends\n(35.8\n)\n(35.6\n)\n(35.2\n)\nCash distribution to joint venture partner\n(16.9\n)\n(25.3\n)\n(38.9\n)\nInvestment by joint venture partner\n-\n7.0\n-\nTax payments for net share settlement of restricted stock\n(3.7\n)\n(3.3\n)\n(2.2\n)\nNet cash provided by (used in) financing activities\n244.9\n(22.7\n)\n216.5\nEffect of exchange rate changes\n17.2\n10.3\n(12.6\n)\nIncrease (decrease) in cash and cash equivalents and restricted cash\n(112.3\n)\n(170.7\n)\n503.6\nCash and cash equivalents and restricted cash\nBeginning of period\n671.4\n842.1\n338.5\nEnd of period\n$\n559.1\n$\n671.4\n$\n842.1\nBalance Sheet Reconciliation\nCash and cash equivalents\n$\n543.0\n$\n646.8\n$\n833.8\nRestricted cash\n16.1\n24.6\n8.3\nTotal cash and cash equivalents and restricted cash as presented above\n$\n559.1\n$\n671.4\n$\n842.1\nCash (received) paid during the period for\nInterest\n$\n45.1\n$\n28.1\n$\n31.7\nIncome taxes, net\n$\n(55.0\n)\n$\n11.1\n$\n60.0\nNon-cash activity\nTransfer from Leased railcars for syndication and Inventories to\nEquipment on operating leases, net\n$\n(11.6\n)\n$\n188.5\n$\n55.6\nCapital expenditures accrued in Accounts payable and accrued liabilities\n$\n10.9\n$\n5.2\n$\n4.1\nTransfer from Property, plant and equipment, net to\nIntangibles and other assets, net for assets moved to Assets held for sale\n$\n3.5\n$\n-\n$\n-\nChange in Accounts payable and accrued liabilities associated with\ndividends declared\n$\n-\n$\n-\n$\n(0.3\n)\nChange in Accounts payable and accrued liabilities associated with cash\ndistributions to joint venture partner\n$\n1.4\n$\n0.6\n$\n1.4\nThe accompanying notes are an integral part of these financial statements.\nNotes to Consolidated Financial Statements\nNote 1 - Nature of Operations\nThe Company operates in three reportable segments: Manufacturing; Maintenance Services; and Leasing & Management Services. The segments are operationally integrated. The Manufacturing segment, which currently operates from facilities in the U.S., Mexico, Poland, Romania and Turkey, produces double-stack intermodal railcars, tank cars, conventional railcars, automotive railcar products and marine vessels. The Maintenance Services segment performs wheel and axle servicing, railcar maintenance and produces a variety of parts for the rail industry in North America. The Leasing & Management Services segment, which includes GBX Leasing, owns approximately 12,200 railcars as of August 31, 2022. The Company also provides management services for approximately 408,000 railcars for railroads, shippers, carriers, institutional investors and other leasing and transportation companies in North America as of August 31, 2022. Through unconsolidated affiliates the Company produces rail and industrial components and has an ownership stake in a railcar manufacturer in Brazil.\nIn 2022 the Company renamed two of its reportable segments to more prominently display the nature of the customer solutions it provides and markets in which it operates. The new names of its reportable segments are Manufacturing (unchanged), Maintenance Services (previously Wheels, Repair & Parts), and Leasing & Management Services (previously Leasing & Services). The name changes have no impact on the organizations reporting structure nor on financial information previously reported. Separately, effective September 1, 2021, the Company changed its measurement basis for allocating syndication revenue between the Manufacturing and Leasing & Management Services reportable segments. This change in measurement reflects the information currently used by management to assess the Company's operating performance in accordance with its refined leasing strategy and has no impact to the Companys total consolidated revenue. Segment results for the prior periods have been recast to conform to the current period presentation.\nNote 2 - Summary of Significant Accounting Policies\nPrinciples of consolidation - The financial statements include the accounts of the Company and its subsidiaries in which it has a controlling interest. All intercompany transactions and balances are eliminated upon consolidation.\nUnclassified balance sheet - The balance sheets of the Company are presented in an unclassified format as a result of significant leasing activities for which the current or non-current distinction is not relevant. In addition, the activities of the Manufacturing; Maintenance Services; and Leasing & Management Services segments are so intertwined that in the opinion of management, any attempt to separate the respective balance sheet categories would not be meaningful and may lead to the development of misleading conclusions by the reader.\nForeign currency translation - Certain operations outside the U.S. prepare financial statements in currencies other than the U.S. Dollar. Revenues and expenses are translated at monthly average exchange rates during the year, while assets and liabilities are translated at year-end exchange rates. Translation adjustments are accumulated as a separate component of equity in other comprehensive income (loss). The net foreign currency translation adjustment balances were $57.4 million, $35.8 million and $39.8 million as of August 31, 2022, 2021 and 2020, respectively\nCash and cash equivalents - Cash may temporarily be invested primarily in money market funds. All highly-liquid investments with a maturity of three months or less at the date of acquisition are considered cash equivalents.\nRestricted cash - Restricted cash relates to amounts held to support a target minimum rate of return on certain agreements, terms of our credit agreement, and a pass through account for activity related to management services provided for certain third party customers.\nAccounts receivable - Accounts receivable consists of receivables from customers and receivables from related parties (see Note 16 - Related Party Transactions) and is stated net of allowance for doubtful accounts of $2.3 million and $2.4 million as of August 31, 2022 and 2021, respectively.\nAs of August 31,\n(In millions)\nAllowance for doubtful accounts\nBalance at beginning of period\n$\n2.4\n$\n2.7\n$\n2.2\nAdditions, net of reversals\n0.4\n0.6\n1.7\nUsage\n(0.3\n)\n(0.8\n)\n(1.3\n)\nCurrency translation effect\n(0.2\n)\n(0.1\n)\n0.1\nBalance at end of period\n$\n2.3\n$\n2.4\n$\n2.7\nInventories - Inventories are valued at the lower of cost or net realizable value using the first-in first-out method. Work-in-process includes material, labor and overhead. Finished goods includes completed wheels, parts and railcars in transit or not on lease.\nLeased railcars for syndication - Leased railcars for syndication consist of newly-built railcars manufactured at one of the Companys facilities or railcars purchased from third parties, which have been placed on lease to a customer and which the Company intends to sell to an investor with the lease attached. These railcars are generally anticipated to be sold within six months of delivery of the last railcar in a group or six months from when the Company acquires the railcar from a third party and are typically not depreciated during that period as the Company does not believe any economic value of a railcar is lost in the first six months. In the event the railcars are not sold in the first six months, the railcars are either held in Leased railcars for syndication and are depreciated or are transferred to Equipment on operating leases and are depreciated.\nEquipment on operating leases, net - Equipment on operating leases is stated net of accumulated depreciation. Depreciation to estimated salvage value is provided on the straight-line method over the estimated useful lives of up to forty years. Management periodically reviews useful lives and salvage value estimates based on current scrap prices and what the Company expects to receive upon disposal.\nInvestment in unconsolidated affiliates - Investment in unconsolidated affiliates includes the Companys interests in certain investees which are accounted for under the equity method of accounting as the Company has determined that the investment provides the Company with the ability to exercise significant influence, but not control, over the investee. Significant influence is generally deemed to exist if the Company has an ownership interest in the voting stock of the investee of at least 20%. Several factors are considered in determining whether the equity method of accounting is appropriate including the relative ownership interests and governance rights of the joint venture partners.\nAs of August 31, 2022, selected investments in unconsolidated affiliates include the Companys 60% interest in Greenbrier-Maxion, 29.5% interest in Amsted-Maxion Cruzeiro (which owns 40% of Greenbrier-Maxion), 40% interest in Greenbrier Railcar Funding I LLC and 41.9% interest in Axis, LLC.\nProperty, plant and equipment - Property, plant and equipment is stated at cost, net of accumulated depreciation. Depreciation is provided on the straight-line method over estimated useful lives which primarily are as follows:\nDepreciable Life\nBuildings and improvements\n10 - 30 years\nMachinery and equipment\n3 - 20 years\nOther\n3 - 7 years\nIntangible and other assets, net - Intangible assets are recorded when a portion of the purchase price of an acquisition is allocated to assets such as customer contracts and relationships and trade names. Intangible assets with finite lives are amortized using the straight line method over their estimated useful lives which are up to 20 years. Other assets include nonqualified savings plan investments, and revolving note fees which are capitalized and amortized as interest expense over the life of the related borrowings.\nImpairment of long-lived assets - When changes in circumstances indicate the carrying amount of certain long-lived asset groups may not be recoverable, the assets are evaluated for impairment. If the forecasted undiscounted future cash flows are less than the carrying amount of the assets, an impairment charge to reduce the carrying value of the assets to estimated realizable value is recognized in the current period. No impairment of long-lived assets was recorded in the years ended August 31, 2022, 2021 and 2020.\nGoodwill - Goodwill is recorded when the purchase price of an acquisition exceeds the fair market value of the net assets acquired. Goodwill is not amortized and is tested for impairment at least annually and more frequently if indicators of impairment arise. The Company reviews goodwill for impairment annually using either a qualitative assessment or a quantitative goodwill impairment test. If the qualitative assessment is selected and the Company determines that fair value of each reporting unit more likely than not exceeds its carrying value, no further assessment is necessary. For reporting units where the Company performs the quantitative goodwill impairment test, an impairment loss is recorded to the extent that the reporting units carrying amount exceeds the reporting units fair value. An impairment loss cannot exceed the total amount of goodwill allocated to the reporting unit. See Note 7 - Goodwill for additional information.\nWarranty accruals - Warranty costs are estimated and charged to operations to cover a defined warranty period. The estimated warranty cost is based on history of warranty claims for each particular product type. For new product types without a warranty history, preliminary estimates are based on historical information for similar product types. The warranty accruals, included in Accounts payable and accrued liabilities, are reviewed periodically and updated based on warranty trends.\nIncome taxes - The asset and liability method is used to account for income taxes. Deferred income taxes are provided for the temporary effects of differences between assets and liabilities recognized for financial statement and income tax reporting purposes. Valuation allowances reduce deferred tax assets to an amount that will more likely than not be realized. The Company recognizes liabilities for uncertain tax positions based on whether evidence indicates that it is more likely than not that the position will be sustained on audit. The Company reevaluates these uncertain tax positions on a quarterly basis. Changes in tax law or court interpretations may result in the recognition of a tax benefit or an additional charge to the tax provision.\nDeferred revenue - Cash payments received prior to meeting revenue recognition criteria are recorded in Deferred revenue. Amounts are reclassified out of Deferred revenue once the revenue recognition criteria have been met.\nNoncontrolling interest and Contingently redeemable noncontrolling interest - The Company has a joint venture with Grupo Industrial Monclova, S.A. (GIMSA) that manufactures new railroad freight cars for the North American marketplace at GIMSAs existing manufacturing facility located in Frontera, Mexico. Each party owns a 50% interest in the joint venture. The financial results of this operation are consolidated for financial reporting purposes as the Company maintains a controlling interest as evidenced by the right to appoint the majority of the Board of Directors, control over accounting, financing, marketing and engineering and approval and design of products. The noncontrolling interest related to the partners 50% interest in the joint venture is included in Noncontrolling interest in the equity section of the Companys Consolidated Balance Sheet.\nGreenbrier-Astra Rail was formed in 2017 between the Companys existing European operations headquartered in Swidnica, Poland and Astra Rail, based in Arad, Romania. Greenbrier-Astra Rail is controlled by the Company with an approximate 75% interest. Astra Rail also received a put option to sell its entire noncontrolling interest to Greenbrier at an exercise price equal to the higher of fair value or a defined EBITDA multiple as measured on the exercise date. During 2022, the option was extended to be exercisable 30 business days prior to and up until June 1, 2026. The Company consolidates Greenbrier-Astra Rail for financial reporting purposes and includes the noncontrolling interest in the mezzanine section of the Consolidated Balance Sheet in Contingently redeemable noncontrolling interest. The carrying value of the noncontrolling interest cannot be less than the maximum redemption amount, which is the amount Greenbrier will settle the put option for if exercised. Adjustments to reconcile the carrying value to the maximum redemption amount are recorded to retained earnings.\nIn August 2018, Greenbrier-Astra Rail entered into an agreement to take an approximately 68% ownership stake in Rayvag, a railcar manufacturing company based in Adana, Turkey. Rayvag is controlled by the Company. The Company consolidates Rayvag for financial reporting purposes. The noncontrolling interest related to the partners interest is included in Noncontrolling interest in the equity section of the Companys Consolidated Balance Sheet.\nNet earnings attributable to noncontrolling interest on the Companys Consolidated Statement of Income represents the Companys partners share of results from operations.\nAccumulated other comprehensive loss - Accumulated other comprehensive loss, net of tax as appropriate, consisted of the following:\n(In millions)\nUnrealized\nGain (Loss)\non Derivative\nFinancial\nInstruments\nForeign\nCurrency\nTranslation\nAdjustment\nOther\nAccumulated\nOther\nComprehensive\nLoss\nBalance, August 31, 2021\n$\n(7.4\n)\n$\n(35.8\n)\n$\n(0.5\n)\n$\n(43.7\n)\nOther comprehensive income (loss) before reclassifications\n15.7\n(21.6\n)\n(0.7\n)\n$\n(6.6\n)\nAmounts reclassified from accumulated other\ncomprehensive loss\n4.7\n-\n-\n$\n4.7\nBalance, August 31, 2022\n$\n13.0\n$\n(57.4\n)\n$\n(1.2\n)\n$\n(45.6\n)\nThe amounts reclassified out of Accumulated other comprehensive loss into the Consolidated Statements of Income, with the financial statement caption, were as follows:\nYear Ended August 31,\n(In millions)\nFinancial Statement Caption\n(Gain) loss on derivative financial instruments:\nForeign exchange contracts\n$\n1.2\n$\n1.4\nRevenue and Cost of revenue\nInterest rate swap contracts\n4.9\n5.3\nInterest and foreign exchange\n6.1\n6.7\nTotal before tax\n(1.4\n)\n(1.7\n)\nTax expense\n$\n4.7\n$\n5.0\nNet of tax\nRevenue recognition - The Company measures revenue at the amounts that reflect the consideration to which it expects to be entitled in exchange for transferring control of goods and services to customers. The Company recognizes revenue either at the point in time or over the period of time that performance obligations to customers are satisfied. Payment terms vary by segment and product type and are generally due within normal commercial terms. The Companys contracts with customers may include multiple performance obligations (e.g. railcars, maintenance, management services, etc.). For such arrangements, the Company allocates revenues to each performance obligation based on its relative standalone selling price. The Company has disaggregated revenue from contracts with customers into categories which describe the principal activities from which it generates revenues.\nManufacturing\nRailcars are manufactured in accordance with contracts with customers. The Company recognizes revenue upon its customers acceptance of the completed railcars at a specified delivery point. From time to time, the Company enters into multi-year supply agreements. Each railcar delivery is considered a distinct performance obligation, such that the amounts that are recognized as revenue following railcar delivery are generally not subject to change.\nThe Company typically recognizes marine vessel manufacturing revenue over time using the cost input method, based on progress toward contract completion measured by actual costs incurred to date in relation to the estimate of total expected costs. This method best depicts the Companys performance in completing the construction of the marine vessel for the customer. When estimates of total costs to be incurred on a contract exceed total revenue, the expected loss is recorded in the period in which the loss is determined.\nMaintenance Services\nThe Company operates a network of facilities in North America that provide complete wheelset reconditioning and maintenance services.\nWheels revenue is recognized when wheelsets are shipped to the customer or when consumed by customers in the case of consignment arrangements. Parts revenue is recognized upon shipment of the parts to the customers.\nMaintenance revenue is typically recognized over time using the cost input method, based on progress toward contract completion measured by actual costs incurred to date in relation to the estimate of total expected costs. This method best depicts the Companys performance in servicing the railcars for the customer. Maintenance services are typically completed in less than 90 days.\nLeasing & Management Services\nThe Company owns a fleet of new and used railcars which are leased to third-party customers. Lease revenue is recognized over the lease-term in the period in which it is earned.\nSyndication transactions represent new and used railcars which have been placed on lease to a customer and which the Company sells to an investor with the lease attached. At the time of such sale, revenue and cost of revenue is allocated between the Manufacturing segment and Leasing & Management Services segment based on the relative standalone selling price of the product and services provided. Revenue and cost of revenue associated with railcars which were obtained from a third-party with the intent to resell them and subsequently sold, are recognized in the Leasing & Management Services segment.\nThe Company enters into multi-year contracts to provide management and maintenance services to customers for which revenue is generally recognized on a straight-line basis over the contract term as a stand-ready obligation. Costs to fulfill these contracts are recognized as incurred.\nInterest and foreign exchange - Interest and foreign exchange includes foreign exchange transaction gains and losses, amortization of debt issuance costs, and external interest expense.\nYear Ended August 31,\n(In millions)\nInterest and foreign exchange:\nInterest and other expense\n$\n55.7\n$\n44.7\n$\n42.4\nForeign exchange (gain) loss\n1.7\n(1.4\n)\n1.2\n$\n57.4\n$\n43.3\n$\n43.6\nForward exchange contracts - Foreign operations give rise to risks from fluctuations in foreign currency exchange rates. Forward exchange contracts with established financial institutions are used to hedge a portion of such risk. Realized and unrealized gains and losses on effective hedges are deferred in other comprehensive income (loss) and recognized in earnings concurrent with the hedged transaction or when the occurrence of the hedged transaction is no longer considered probable. Ineffectiveness is measured and any gain or loss is recognized in foreign exchange (gain) loss. Even though forward exchange contracts are entered into to mitigate the impact of currency fluctuations, certain exposure remains, which may affect operating results. In addition, there is risk for counterparty non-performance.\nInterest rate instruments - Interest rate swap agreements are used to reduce the impact of changes in interest rates on certain debt. The net cash amounts paid or received under the agreements are recognized as an adjustment to interest expense.\nResearch and development - Research and development costs are expensed as incurred. Research and development costs incurred for new product development during the years ended August 31, 2022, 2021 and 2020 were $5.4 million, $6.3 million and $5.8 million, respectively, included in Selling and administrative expenses.\nNet earnings per share - Basic earnings per common share (EPS) is calculated using weighted average basic common shares outstanding, which include restricted stock grants and restricted stock units that are considered participating securities when the Company is in a net earnings position.\nDiluted EPS is calculated using the if-converted method, associated with shares underlying the 2024 and 2028 2.875% Convertible notes, and the treasury stock method associated with restricted stock units that are not considered participating securities and performance based restricted stock units subject to performance criteria.\nStock-based compensation - The value of stock-based compensation awards is amortized as compensation expense from the date of grant through the earlier of the vesting period or in some instances the recipients eligible retirement date. Stock based compensation expense consists of restricted stock units and restricted stock awards. The fair value of awards is measured using the number of shares granted multiplied by the closing share price on the grant date. Stock based compensation expense for the years ended August 31, 2022, 2021 and 2020 was $15.5 million, $14.7 million and $9.0 million, respectively and was recorded in Selling and administrative and Cost of revenue on the Consolidated Statements of Income.\nRestricted stock units and restricted stock awards are accounted for as equity based awards (see Note 14 - Equity).\nManagement estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires judgment on the part of management to arrive at estimates and assumptions on matters that are inherently uncertain. These estimates may affect the amount of assets, liabilities, revenues and expenses reported in the financial statements and accompanying notes and disclosure of contingent assets and liabilities within the financial statements. Estimates and assumptions are periodically evaluated and may be adjusted in future periods. Actual results could differ from those estimates.\nReclassifications - Certain immaterial reclassifications have been made to the accompanying prior year Consolidated Financial Statements to conform to the current year presentation.\nInitial Adoption of Accounting Policies\nLease accounting\nOn September 1, 2019, the Company adopted Accounting Standards Update 2016-02, Leases and related amendments (Topic 842). Upon adoption, the Company recorded a cumulative-effect adjustment of $4.4 million as an increase to retained earnings. Under the short term lease recognition exemption, the Company does not recognize ROU assets or lease liabilities for qualifying leases with terms of less than twelve months. The Company does not separate lease and non-lease components. The Company utilizes both Topic 842 and Accounting Standards Codification 606, Revenue from Contracts with Customers (Topic 606) when evaluating retained risk of services and other performance obligations in conjunction with selling railcars with a lease attached as part of the syndication model.\nDerivatives and Hedging\nIn August 2017, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update 2017-12, Derivatives and Hedging: Targeted Improvements to Accounting for Hedging Activities (ASU 2017-12). The Company adopted this guidance effective September 1, 2019 and it did not have a material impact on its consolidated financial statements.\nMeasurement of Credit Losses on Financial Instruments\nIn June 2016, the FASB issued Accounting Standard Update 2016-13, Financial Instruments - Credit Losses (ASU 2016-13). The Company adopted this guidance using a modified retrospective approach through a cumulative effect adjustment, which decreased opening retained earnings by $0.5 million on September 1, 2020.\nConvertible Instruments and Contracts in an Entitys Own Equity\nIn August 2020, the FASB issued Accounting Standard Update 2020-06, Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (ASU 2020-06), which simplifies the accounting for certain convertible instruments, amends guidance on derivative scope exceptions for contracts in an entitys own equity and modifies the guidance on diluted EPS calculations as a result of these changes. The Company adopted this guidance effective September 1, 2021 on a modified retrospective basis and recorded a cumulative effect adjustment to increase Retained earnings by $5 million. The impact of adoption also resulted in a reduction to Additional paid in capital of approximately $59 million related to amounts attributable to conversion options that had previously been recorded in equity and the associated derecognition of related deferred tax liabilities of $17 million. Additionally, the Company recorded an increase to its convertible notes balance by an aggregate amount of approximately $71 million as a result of derecognizing the debt discount. The adoption of this guidance also decreased the amount of non-cash interest expense to be recognized in future periods as a result of eliminating the discount associated with the equity component. The Company did not incur any impact to liquidity or cash flows. Beginning September 1, 2021, when calculating net earnings attributable to Greenbrier per share of common stock, the Company uses the if-converted method as required under ASU 2020-06 to determine the dilutive effect of its convertible notes.\nSimplification of Accounting for Income Taxes\nIn December 2019, the FASB issued Accounting Standard Update 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12), which simplifies the accounting for income taxes by removing certain exceptions to the general principles in Topic 740 for: recognizing deferred taxes for investments, performing intra-period allocations and calculating taxes in interim periods. The ASU also improves consistent application of GAAP for other areas of Topic 740 by clarifying and amending existing guidance to reduce complexity in certain areas, including recognizing deferred taxes for tax goodwill and allocating taxes to members of a consolidated group. The Company adopted this guidance September 1, 2021 with no impact to the Company's consolidated financial statements. The ongoing application of ASU 2019-12 is not expected to materially impact the Company's consolidated financial statements.\nReference Rate Reform\nIn March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of Effects of Reference Rate Reform on Financial Reporting, which provides practical expedients and exceptions for applying GAAP to contracts, hedging relationships, and other transactions affected by reference rate reform if certain criteria are met. The elective amendments provide expedients to contract modification, affected by reference rate reform if certain criteria are met. The expedients and exceptions provided by this guidance apply only to contracts, hedging relationships, and other transactions that reference the London interbank offered rate (LIBOR) or another reference rate expected to be discontinued as a result of reference rate reform. This guidance is not applicable to contract modifications made and hedging relationships entered into or evaluated after December 31, 2022. The guidance can be applied immediately through December 31, 2022. During the fourth quarter of fiscal year 2022, the Company adopted the optional relief guidance provided under this ASU after modifying certain debt to update the reference rate from LIBOR to SOFR. This caused a temporary mismatch in our interest rate swap and debt for a period of time. The application of this expedient preserves the presentation of the derivatives consistent with past presentation. The Company will continue to assess the impact of the guidance and may apply other elections as applicable going forward.\nNote 3 - Asset Backed Securities\nGBX Leasing 2022-1 LLC (GBXL I) was formed as a wholly owned special purpose entity (SPE) of GBX Leasing to securitize the leasing assets of GBX Leasing. On February 9, 2022, GBXL I (Issuer) issued $323.3 million of term notes secured by a portfolio of railcars and associated operating leases and other assets, acquired and owned by GBXL I. Greenbrier Management Services, LLC (GMS) entered into certain agreements relating to the management and servicing of the Issuers assets. The Company used the net proceeds received from the issuance of the term notes to pay down the GBX Leasing warehouse credit facility.\nThe Company evaluated the accounting for the transaction and concluded that, based on its equity investment in the Issuer combined with GMSs capacity as servicer, the Company is the primary beneficiary of the SPE and will consolidate the SPE for financial reporting purposes.\nIssued debt includes $302.6 million of GBXL I Series 2022-1 Class A Secured Railcar Equipment Notes (Class A Notes) and $20.7 million of GBXL I Series 2022-1 Class B Secured Railcar Equipment Notes (Class B Notes), collectively the GBXL Series 2022-1 Notes (the GBXL Notes). The GBXL Notes bear interest at fixed rates of 2.87% and 3.45% for the Class A Notes and Class B Notes, respectively. The GBXL Notes are payable monthly and have a legal maturity date of February 20, 2052. The Company incurred $5.0 million in debt issuance costs, which will be amortized to interest expense through the expected repayment period. Both Class A and Class B Notes have an anticipated repayment date of January 20, 2029 and a legal maturity date. While the legal maturity date is in 2052, the cash flows generated from the railcar assets will pay down the GBXL Notes in line with the agreement, which based on expected cash flow payments, would result in repayment in advance of the legal maturity date. If the principal amount of the GBXL Notes has not been repaid in full by the anticipated repayment date, then the Issuer will also be required to pay additional interest to the holders at a rate equal to 4.00% per annum.\nThe GBXL Notes are obligations of the Issuer only and are nonrecourse to Greenbrier. The GBXL Notes are subject to a Master Indenture between the Issuer and U.S. Bank Trust Company, National Association, as trustee, as supplemented by a Series 2022-1 Supplement dated February 9, 2022. The GBXL Notes may be subject to acceleration upon the occurrence of certain events of default.\nThe following table summarizes the Issuer's net carrying amount of the assets transferred and the related debt.\nAs of August 31,\n(In millions)\nAssets\nRestricted cash\n$\n6.9\nEquipment on operating leases, net\n401.8\nLiabilities\nNotes payable, net\n$\n312.8\nNote 4 - Revenue Recognition\nContract balances\nContract assets primarily consist of unbilled receivables related to marine vessel construction and railcar maintenance services, for which the respective contracts do not yet permit billing at the reporting date. Contract liabilities primarily consist of customer prepayments for manufacturing, maintenance, and other management-type services, for which the Company has not yet satisfied the related performance obligations.\nThe opening and closing balances of the Companys contract balances are as follows:\n(In millions)\nBalance sheet\nclassification\nAugust 31, 2022\nAugust 31, 2021\n$ change\nContract assets\nAccounts receivable, net\n$\n13.0\n$\n5.9\n$\n7.1\nContract assets\nInventories\n$\n6.0\n$\n6.7\n$\n(0.7\n)\nContract liabilities 1\nDeferred revenue\n$\n30.5\n$\n36.4\n$\n(5.9\n)\n1 Contract liabilities balance includes deferred revenue within the scope of Topic 606.\nFor the years ended August 31, 2022 and 2021 the Company recognized $16.4 million and $7.4 million of revenue, respectively, that was included in Contract liabilities as of August 31, 2021 and 2020.\nPerformance obligations\nAs of August 31, 2022, the Company has entered into contracts with customers for which revenue has not yet been recognized. The following table outlines estimated revenue related to performance obligations wholly or partially unsatisfied, that the Company anticipates will be recognized in future periods.\n(In millions)\nAugust 31, 2022\nRevenue type:\nManufacturing - Railcar sales\n$\n2,634.0\nManufacturing - Marine\n$\n30.9\nManufacturing - Conversions\n$\n183.6\nServices\n$\n123.8\nOther\n$\n12.3\nManufacturing - Railcars intended for syndication 1\n$\n623.7\n1 Not a performance obligation as defined in Topic 606\nBased on current production and delivery schedules and existing contracts, approximately $2.1 billion of the Railcar sales amount is expected to be recognized in the next 12 months while the remaining amount is expected to be recognized through 2024. The table above excludes estimated revenue to be recognized at the Companys Brazilian manufacturing operations, as they are accounted for under the equity method.\nRevenue amounts reflected in Railcars intended for syndication may be syndicated to third parties or held in the Companys fleet depending on a variety of factors.\nMarine revenue is expected to be recognized through 2023 as vessel construction is completed.\nServices includes management and maintenance services of which approximately 54% are expected to be performed through 2027 and the remaining amount through 2037.\nNote 5 - Inventories\nAs of August 31,\n(In millions)\nManufacturing supplies and raw materials\n$\n570.2\n$\n352.8\nWork-in-process\n183.3\n167.3\nFinished goods\n75.9\n73.4\nExcess and obsolete adjustment\n(14.1\n)\n(19.9\n)\n$\n815.3\n$\n573.6\nAs of August 31,\n(In millions)\nExcess and obsolete adjustment\nBalance at beginning of period\n$\n19.9\n$\n24.2\n$\n9.5\nCharge to cost of revenue\n1.5\n0.8\n18.0\nDisposition of inventory\n(6.9\n)\n(5.0\n)\n(3.6\n)\nCurrency translation effect\n(0.4\n)\n(0.1\n)\n0.3\nBalance at end of period\n$\n14.1\n$\n19.9\n$\n24.2\nNote 6 - Property, Plant and Equipment, net\nAs of August 31,\n(In millions)\nLand and improvements\n$\n88.4\n$\n94.6\nMachinery and equipment\n623.7\n609.8\nBuildings and improvements\n367.1\n379.1\nConstruction in progress\n55.3\n50.0\nOther\n107.4\n92.8\n1,241.9\n1,226.3\nAccumulated depreciation\n(596.7\n)\n(556.1\n)\n$\n645.2\n$\n670.2\nDepreciation expense was $70.7 million, $75.3 million and $86.6 million for the years ended August 31, 2022, 2021 and 2020, respectively.\nNote 7 - Goodwill\nChanges in the carrying value of goodwill are as follows:\n(In millions)\nManufacturing\nMaintenance Services\nLeasing & Management Services\nTotal\nBalance August 31, 2021\n$\n88.8\n$\n43.3\n$\n-\n$\n132.1\nTranslation and other adjustments\n(4.5\n)\n(0.3\n)\n-\n(4.8\n)\nBalance August 31, 2022\n$\n84.3\n$\n43.0\n$\n-\n$\n127.3\n(In millions)\nGoodwill\nGross goodwill balance before accumulated goodwill impairment losses and other\nreductions\n$\n290.1\nAccumulated goodwill impairment losses\n(138.2\n)\nAccumulated other reductions\n(24.6\n)\nBalance August 31, 2022\n$\n127.3\nThe Company performed its annual goodwill impairment test during the third quarter. For the annual impairment test during the third quarter of 2022, the Company utilized the qualitative assessment allowable under ASC 350 Intangibles - Goodwill and Other to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. This qualitative assessment may include, but is not limited to, reviewing factors such as macroeconomic considerations and industry indicators, financial performance and cost estimates associated with a particular reporting unit. If based on a review of qualitative factors, it is more likely than not that the fair value of a reporting unit is less than its carrying value, a quantitative impairment test is performed by comparing the fair value of a reporting unit with its carrying amount. Based on our review of the qualitative factors, the Company determined for all three of our reporting unit goodwill balances that a quantitative impairment analysis was not necessary, primarily as a result of positive market indicators and entity-specific financial performance during the assessment period.\nAs of August 31, 2022, our Manufacturing segment includes the North America Manufacturing reporting unit with a goodwill balance of $56.6 million and the Europe Manufacturing reporting unit with a goodwill balance of $27.7 million. The Maintenance Services segment had a goodwill balance of $43.0 million related to the Wheels & Parts reporting unit.\nBased on the results of the Companys annual impairment test, the Company concluded that goodwill was not impaired.\nNote 8 - Intangibles and Other Assets, net\nIntangible assets that are determined to have finite lives are amortized over their useful lives. Intangible assets with indefinite useful lives are not amortized and are periodically evaluated for impairment.\nThe following table summarizes the Companys identifiable intangible and other assets balance:\nAs of August 31,\n(In millions)\nIntangible assets subject to amortization:\nCustomer and supplier relationships\n$\n87.5\n$\n89.8\nAccumulated amortization\n(66.1\n)\n(64.1\n)\nOther intangible assets\n42.4\n40.3\nAccumulated amortization\n(16.5\n)\n(13.0\n)\n47.3\n53.0\nIntangible assets not subject to amortization\n2.4\n2.4\nPrepaid and other assets\n32.4\n26.7\nOperating lease ROU assets\n54.2\n39.8\nNonqualified savings plan investments\n40.3\n47.7\nDebt issuance costs, net\n8.7\n8.6\nAssets held for sale\n3.8\n5.4\n$\n189.1\n$\n183.6\nAmortization expense for the years ended August 31, 2022, 2021 and 2020 was $9.3 million, $11.6 million and $11.0 million, respectively. As of August 31, 2022, amortizable intangible assets had a weighted-average remaining useful life of 8 years. Amortization expense for the years ending August 31, 2023, 2024, 2025, 2026 and 2027 is expected to be $8.5 million, $7.6 million, $7.2 million, $6.0 million and $5.3 million, respectively.\nNote 9 - Revolving Notes\nSenior secured credit facilities, consisting of four components, aggregated to $1.14 billion as of August 31, 2022.\nAs of August 31, 2022, a $600.0 million revolving line of credit, maturing August 2026, secured by substantially all the Companys U.S. assets not otherwise pledged as security for term loans, the warehouse credit facility or the railcar asset-backed securities, existed to provide working capital and interim financing of equipment, principally for the Companys U.S. and Mexican operations. Advances under this North American credit facility bear interest at SOFR plus 1.50% plus 0.10% as a SOFR adjustment or Prime plus 0.50% depending on the type of borrowing. Available borrowings under the credit facility are generally based on defined levels of eligible inventory, receivables, property, plant and equipment and leased equipment, as well as total debt to consolidated capitalization and fixed charges coverage ratios.\nAs of August 31, 2022, a $350.0 million non-recourse warehouse credit facility existed to support the operations of GBX Leasing, a joint venture in which the Company owns approximately 95%. Advances under this facility bear interest at SOFR plus 1.85% plus 0.11% as a SOFR adjustment. The warehouse credit facility converts to a term loan in August 2025 which matures in August 2027.\nAs of August 31, 2022, lines of credit totaling $67.2 million secured by certain of the Companys European assets, with variable rates that range from Warsaw Interbank Offered Rate (WIBOR) plus 1.2% to WIBOR plus 1.6% and Euro Interbank Offered Rate (EURIBOR) plus 1.5%, were available for working capital needs of the Companys European manufacturing operations. The European lines of credit include $40.8 million which are guaranteed by the Company. European credit facilities are regularly renewed. Currently, these European credit facilities have maturities that range from February 2023 through October 2023.\nAs of August 31, 2022, the Companys Mexican railcar manufacturing operations had four lines of credit totaling $120.0 million. The first line of credit provides up to $30.0 million, of which the Company and its joint venture partner have each guaranteed 50%. Advances under this facility bear interest at LIBOR plus 3.75% to 4.25%. The Mexican railcar manufacturing joint venture will be able to draw amounts available under this facility through June 2024. The second line of credit provides up to $35.0 million, of which the Company and its joint venture partner have each guaranteed 50%. Advances under this facility bear interest at LIBOR plus 3.75%. The Mexican railcar manufacturing joint venture will be able to draw amounts available under this facility through June 2023. The third line of credit provides up to $50.0 million and matures in October 2024. Advances under this facility bear interest at LIBOR plus 4.25%. The fourth line of credit provided up to $5.0 million and matured September 2022. The interest rate under this facility was LIBOR plus 2.95%.\nAs of August 31,\n(In millions)\nCredit facility balances:\nNorth America\n$\n160.0\n$\n160.0\nGBX Leasing\n-\n147.0\nEurope\n51.6\n50.2\nMexico\n85.0\n15.0\nTotal Revolving notes\n$\n296.6\n$\n372.2\nIn addition, outstanding commitments under the North American credit facility included letters of credit which totaled $6.9 million and $8.4 million as of August 31, 2022 and 2021, respectively.\nAs of August 31, 2022, the Company had an aggregate of $147.9 million available to draw down under committed credit facilities.\nNote 10 - Accounts Payable and Accrued Liabilities\nAs of August 31,\n(In millions)\nTrade payables\n$\n401.5\n$\n265.1\nOther accrued liabilities\n102.8\n109.1\nOperating lease liabilities\n56.4\n42.6\nAccrued payroll and related liabilities\n140.4\n125.1\nAccrued warranty\n24.0\n27.9\n$\n725.1\n$\n569.8\nNote 11 - Warranty Accrual\nAs of August 31,\n(In millions)\nBalance at beginning of period\n$\n27.9\n$\n45.2\n$\n46.7\nCharged to cost of revenue\n5.0\n(8.0\n)\n4.0\nPayments\n(7.9\n)\n(9.2\n)\n(6.2\n)\nCurrency translation effect\n(1.0\n)\n(0.1\n)\n0.7\nBalance at end of period\n$\n24.0\n$\n27.9\n$\n45.2\nNote 12 - Notes Payable, net\nAs of August 31,\n(In millions)\nTerm loans\n$\n867.5\n$\n492.3\n2.875% Convertible senior notes, due 2028\n373.8\n373.8\n2.875% Convertible senior notes, due 2024\n47.7\n47.7\nOther notes payable\n1.2\n1.7\n$\n1,290.2\n$\n915.5\nDebt discount and issuance costs (1)\n(21.1\n)\n(89.0\n)\n$\n1,269.1\n$\n826.5\n(1)As described in Note 2 - Summary of Significant Accounting Policies, effective September 1, 2021, the debt discount associated with convertible senior notes was derecognized upon adoption of ASU 2020-06 using the modified retrospective approach. Financial results for 2021 were not adjusted. See discussion below for additional information.\nTerm loans are primarily composed of:\n$291.9 million of senior term debt, with a maturity date of August 2026. The debt bears a floating interest rate of SOFR plus 1.5% plus 0.10% as a SOFR adjustment with principal of $3.65 million paid quarterly in arrears and a balloon payment of $222.6 million due at maturity. Interest rate swap agreements cover 75% of the principal balance to swap the floating interest rate to a fixed rate. The principal balance as of August 31, 2022 was $280.9 million.\n$275.0 million of senior term debt, with a maturity date of August 2027, which is secured by a pool of leased railcars. The original $200 million term debt agreement was amended on July 29, 2022 to provide for an incremental $75 million term loan and an additional $75 million available as a delayed draw until January 2023, subject to satisfaction of certain conditions. The debt bears a floating interest rate of SOFR plus 1.375% plus 0.10% as a SOFR adjustment, with principal of $2.4 million paid quarterly in arrears and a balloon payment of $219.9 million due at maturity. Interest rate swap agreements cover 100% of the principal balance to swap the floating interest rate to a fixed rate. The principal balance as of August 31, 2022 was $268.0 million.\n$323.3 million of senior term debt, which is secured by a portfolio of railcars and associated operating leases and other assets, acquired, and owned by GBXL I. See Note 3 - Asset Backed Securities for additional information. The principal balance as of August 31, 2022 was $318.6 million.\nConvertible senior notes, due 2028 (2028 Convertible Notes), bear interest at a fixed rate of 2.875%, paid semiannually in arrears on April 15th and October 15th. Issuance costs are amortized using the effective interest rate method through 2028 and the amortization expense is included in Interest and Foreign exchange on the Company's Consolidated Statement of Income. As of August 31, 2022, the effective interest rate was 5.75%. The convertible notes mature on April 15, 2028, unless earlier repurchased, redeemed or converted in accordance with their terms prior to such date. The convertible notes are senior unsecured obligations and rank equally with other senior unsecured debt. The notes are convertible into shares of the Companys common stock, at an initial conversion rate of 18.0317 shares of common stock per $1,000 principal amount which is equivalent to an initial conversion price of approximately $55.46 per share. The conversion rate and the resulting conversion price are subject to adjustment in certain events, such as distributions, dividends or stock splits. Conversion of the par value of the note will be settled in cash, with any premium convertible in cash or shares at the Companys option. Upon a conversion of the notes, the Company may elect to pay or deliver, as the case may be, cash and, if applicable, shares of the Companys common stock, as provided in the 2028 Notes Indenture (as defined below). As of August 31, 2022, the Company has reserved approximately 8.8 million shares for issuance upon conversion of these notes.\nThe 2028 Convertible Notes are subject to an indenture entered into on April 20, 2021 by the Company and Wells Fargo Bank, National Association, as trustee, as amended and restated by the first supplemental indenture dated June 1, 2021 (2028 Notes Indenture). The 2028 Convertible Notes are convertible at the option of the holders prior to January 15, 2028, under certain circumstances as described in the 2028 Notes Indenture. Additionally, the Company may elect to call the notes on or after April 15, 2025 and on or before the 40th trading day prior to April 15, 2028, at a cash redemption price described in the 2028 Notes Indenture if the stock price exceeds 130% of the conversion price during certain trading days as defined in the 2028 Notes Indenture. Calling any Convertible Note for redemption will constitute a make-whole fundamental change with respect to that Convertible Note, in which case the conversion rate applicable to the conversion of that Convertible Note will be increased in certain circumstances if it is converted after it is called for redemption.\nConvertible senior notes, due 2024 (2024 Convertible Notes), bear interest at a fixed rate of 2.875%, paid semi-annually in arrears on February 1st and August 1st. Issuance costs are amortized using the effective interest rate method through 2024 and the amortization expense is included in Interest and Foreign exchange on the Company's Consolidated Statement of Income. As of August 31, 2022, the effective interest rate was 4.99%. The convertible notes mature on February 1, 2024, unless earlier repurchased by the Company or converted in accordance with their terms. Upon the satisfaction of certain conditions, holders may convert at their option at any time prior to the business day immediately preceding the stated maturity date. The convertible notes are senior unsecured obligations and rank equally with other senior unsecured debt. The convertible notes are convertible into shares of the Companys common stock, at an initial conversion rate of 16.6234 shares per $1,000 principal amount of the notes (which is equal to an initial conversion price of $60.16 per share). The initial conversion rate and conversion price are subject to adjustment upon the occurrence of certain events, such as distributions, dividends or stock splits. As of August 31, 2022 the Company has reserved approximately 1.1 million shares for issuance upon conversion of these notes.\nAs described in Note 2 - Summary of Significant Accounting Policies, effective September 1, 2021, the Company adopted ASU 2020-06 using the modified retrospective approach under which financial results reported in prior periods were not adjusted. Prior to the adoption of the standard, the convertible notes were separated into liability and equity components with an associated debt discount. The debt discount was amortized using the effective interest rate method over the term of the convertible notes until September 1, 2021, when the debt discount associated with these convertible notes was derecognized.\nOther notes payable includes $1.2 million of unsecured debt with maturity dates ranging from February 2023 to February 2027.\nThe notes payable, along with the revolving and operating lines of credit, contain certain covenants with respect to the Company and various subsidiaries, the most restrictive of which, among other things, limit the ability to: incur additional indebtedness or guarantees; pay dividends or repurchase stock; enter into capital leases; create liens; sell assets; engage in transactions with affiliates, including joint ventures and non U.S. subsidiaries, including but not limited to loans, advances, equity investments and guarantees; enter into mergers, consolidations or sales of substantially all the Companys assets; and enter into new lines of business. The covenants also require certain maximum ratios of debt to total capitalization and minimum levels of fixed charges (interest and rent) coverage.\nAs of August 31, 2022, principal payments on the notes payable are expected as follows:\n(In millions)\nYear ending August 31,\n$\n35.3\n2024 (1)\n83.8\n36.4\n259.1\n241.9\nThereafter (1)\n633.7\n$\n1,290.2\n(1)The repayment of the $47.7 million of 2024 Convertible Notes due February 2024 and the $373.8 million of 2028 Convertible Notes due April 2028 is assumed to occur at the scheduled maturity instead of assuming an earlier conversion by the holders.\nNote 13 - Derivative Instruments\nForeign operations give rise to market risks from changes in foreign currency exchange rates. Foreign currency forward exchange contracts with established financial institutions are utilized to hedge a portion of that risk. Interest rate swap agreements are used to reduce the impact of changes in interest rates on certain debt. The Companys foreign currency forward exchange contracts and interest rate swap agreements are designated as cash flow hedges, and therefore the effective portion of unrealized gains and losses is recorded in accumulated other comprehensive income or loss.\nAt August 31, 2022 exchange rates, notional amounts of forward exchange contracts for the purchase of Polish Zlotys and the sale of Euros; and the purchase of Mexican Pesos and the sale of U.S. Dollars aggregated to $73.6 million. The fair value of the contracts is included on the Consolidated Balance Sheets as Accounts payable and accrued liabilities when in a loss position, or as Accounts receivable, net when in a gain position. As the contracts mature at various dates through October 2023, any such gain or loss remaining will be recognized in manufacturing revenue or cost of revenue along with the related transactions. In the event that the underlying transaction does not occur or does not occur in the period designated at the inception of the hedge, the amount classified in accumulated other comprehensive loss would be reclassified to the results of operations in Interest and foreign exchange at the time of occurrence. At August 31, 2022 exchange rates, approximately $3.5 million loss would be reclassified to revenue or cost of revenue in the next year.\nAt August 31, 2022, interest rate swap agreements maturing from September 2023 through January 2032 had notional amounts that aggregated to $478.7 million. The fair value of the contracts are included on the Consolidated Balance Sheets in Accounts payable and accrued liabilities when in a loss position, or in Accounts receivable, net when in a gain position. As interest expense on the underlying debt is recognized, amounts corresponding to the interest rate swap are reclassified from Accumulated other comprehensive loss and charged or credited to interest expense. At August 31, 2022 interest rates, approximately $6.4 million would be credited to interest expense in the next year.\nFair Values of Derivative Instruments\nAsset Derivatives\nLiability Derivatives\nAugust 31,\nAugust 31,\n(In millions)\nBalance sheet\ncaption\nFair\nValue\nFair\nValue\nBalance sheet\ncaption\nFair\nValue\nFair\nValue\nDerivatives designated as hedging instruments\nForeign forward\nexchange contracts\nAccounts\nreceivable, net\n$\n0.6\n$\n0.1\nAccounts payable\nand accrued\nliabilities\n$\n2.9\n$\n0.3\nInterest rate swap\ncontracts\nAccounts\nreceivable, net\n20.8\n-\nAccounts payable\nand accrued\nliabilities\n-\n10.0\n$\n21.4\n$\n0.1\n$\n2.9\n$\n10.3\nDerivatives not designated as hedging instruments\nForeign forward\nexchange contracts\nAccounts\nreceivable, net\n$\n-\n$\n-\nAccounts payable\nand accrued\nliabilities\n$\n0.1\n$\n0.1\nThe Effect of Derivative Instruments on the Consolidated Statements of Income\nDerivatives in cash flow\nhedging relationships\nLocation of gain (loss)\nrecognized in income on derivative\nGain (loss) recognized in income on\nderivatives Years ended August 31,\nForeign forward exchange contract\nInterest and foreign exchange\n$\n(0.3\n)\n$\n(0.1\n)\nDerivatives in\ncash flow hedging\nrelationships\nGain (loss)\nrecognized in\nOCI on derivatives\nYears ended August 31,\nLocation of\ngain (loss)\nreclassified from\naccumulated\nOCI into income\nGain (loss)\nreclassified from\naccumulated OCI\ninto income\nYears ended August 31,\nLocation of gain\n(loss) in income\non derivative\n(amount\nexcluded from\neffectiveness testing)\nGain (loss)\nrecognized on\nderivative (amount\nexcluded from\neffectiveness testing)\nYears ended August 31,\nForeign forward\nexchange contracts\n$\n(4.7\n)\n$\n(2.0\n)\nRevenue\n$\n(1.5\n)\n$\n(1.3\n)\nRevenue\n$\n0.9\n$\n0.6\nForeign forward\nexchange contracts\n0.5\n-\nCost of revenue\n0.3\n(0.1\n)\nCost of revenue\n0.7\n0.1\nInterest rate swap\ncontracts\n26.1\n0.6\nInterest and\nforeign\nexchange\n(4.9\n)\n(5.3\n)\nInterest and\nforeign\nexchange\n-\n-\n$\n21.9\n$\n(1.4\n)\n$\n(6.1\n)\n$\n(6.7\n)\n$\n1.6\n$\n0.7\nThe following table presents the amounts in the Consolidated Statements of Income in which the effects of the cash flow hedges are recorded and the effects of the cash flow hedge activity on these line items for the years ended August 31, 2022, 2021 and 2020:\nFor the Year Ended August 31,\n(In millions)\nTotal\nAmount of gain\n(loss) on cash\nflow hedge\nactivity\nTotal\nAmount of gain\n(loss) on cash\nflow hedge\nactivity\nTotal\nAmount of gain\n(loss) on cash\nflow hedge\nactivity\nRevenue\n$\n2,977.7\n$\n(1.5\n)\n$\n1,747.9\n$\n(1.3\n)\n$\n2,792.2\n$\n(0.7\n)\nCost of revenue\n2,671.7\n0.3\n1,516.3\n(0.1\n)\n2,439.1\n(2.2\n)\nInterest and foreign exchange\n57.4\n(4.9\n)\n43.3\n(5.3\n)\n43.6\n(2.7\n)\nNote 14 - Equity\nStock Incentive Plan\nThe 2021 Stock Incentive Plan was approved by shareholders on January 6, 2021. The new plan replaced the 2014 Amended and Restated Stock Incentive Plan, which was amended and restated as the 2017 Amended and Restated Stock Incentive Plan on October 24, 2017 and approved by shareholders on January 5, 2018. The 2021 Stock Incentive Plan provides for the grant of incentive stock options, non-statutory stock options, restricted shares, restricted stock units and stock appreciation rights. In addition to the 1,500 thousand shares reserved for issuance under the 2021 Stock Incentive Plan, up to 466 thousand shares previously reserved for issuance, but not issued or subject to outstanding awards, are available for issuance under the 2021 Stock Incentive Plan, and up to 884 thousand shares that were subject to outstanding awards under the 2017 Amended and Restated Stock Incentive Plan as of the effective date of the 2021 Stock Incentive Plan will also become available for issuance under the 2021 Stock Incentive Plan to the extent such shares are not issued and cease to be subject to such awards following the effective date of the 2021 Stock Incentive Plan.\nOn August 31, 2022, there were 1,394 thousand shares available for grant compared to 1,618 thousand and 466 thousand shares available for grant as of the years ended August 31, 2021 and 2020, respectively. There are no stock options or stock appreciation rights outstanding as of August 31, 2022. The Company currently grants restricted stock units. Shares associated with restricted stock unit awards are not considered legally outstanding shares of common stock until they are issued following vesting. Restricted stock unit awards, including performance-based awards, some of which are entitled to participate in dividends and these awards are considered participating securities and are considered outstanding for earnings per share purposes when the effect is dilutive.\nDuring the years ended August 31, 2022, 2021 and 2020, the Company awarded restricted share and restricted stock unit grants totaling 391 thousand, 538 thousand, and 470 thousand shares, respectively, which include performance-based grants and dividend equivalent rights. As of August 31, 2022, there were a total of 653 thousand shares associated with unvested performance-based grants. The actual number of shares that will vest associated with performance-based grants will vary depending on the Companys performance. Approximately 653 thousand additional shares may be granted if performance-based restricted stock unit awards vest at maximum levels of performance. These additional shares are associated with restricted stock unit awards granted during the years ended August 31, 2022, 2021 and 2020. The fair value of awards granted was $18.7 million, $18.0 million, and $14.5 million for the years ended August 31, 2022, 2021 and 2020, respectively. The fair value of awards granted is determined based on the market closing price of the underlying shares on the date of grant.\nThe value, at the date of grant, of stock awarded under restricted share grants and restricted stock unit grants is amortized as compensation expense over the lesser of the vesting period of one to three years or to the recipients eligible retirement date. Compensation expense recognized related to restricted share grants and restricted stock unit grants for the years ended August 31, 2022, 2021 and 2020 was $15.5 million, $14.7 million, and $8.7 million, respectively, and was recorded in Selling and administrative and Cost of revenue on the Consolidated Statements of Income. Unamortized compensation cost related to restricted stock unit grants was $12.8 million as of August 31, 2022.\nTotal unvested restricted share and restricted stock unit grants were 1,042 thousand and 1,024 thousand as of August 31, 2022 and 2021, respectively. During the year ended August 31, 2022, a total of 290 thousand restricted stock units vested, including shares that were withheld on behalf of employees to satisfy the minimum statutory tax withholding requirements. The following table summarizes restricted share and restricted stock unit grant transactions for shares, both vested and unvested, under the 2021 Stock Incentive Plan and the 2017 Amended and Restated Stock Incentive Plan:\n(In thousands)\nShares\nBalance at August 31, 2019 (1)\n4,575\nGranted\nForfeited\n(86\n)\nBalance at August 31, 2020 (1)\n4,959\nGranted\nForfeited\n(190\n)\nBalance at August 31, 2021 (1)\n5,307\nGranted\nForfeited\n(167\n)\nBalance at August 31, 2022 (1)\n5,531\n(1)Balance represents cumulative grants net of forfeitures.\nShare Repurchase Program\nThe Board of Directors has authorized the Company to repurchase shares of the Companys common stock. The share repurchase program has an expiration date of January 31, 2023 and the amount remaining for repurchase is $100.0 million. Under the share repurchase program, shares of common stock may be purchased on the open market or through privately negotiated transactions from time to time. The timing and amount of purchases will be based upon market conditions, securities law limitations and other factors. The program may be modified, suspended or discontinued at any time without prior notice. The share repurchase program does not obligate the Company to acquire any specific number of shares in any period. There were no shares repurchased under this program during the years ended August 31, 2022, 2021 and 2020.\nOther Share Repurchases\nThe Company repurchased $20.0 million of its common stock during 2021. These shares were repurchased, in privately negotiated transactions, as part of the Companys debt refinancing in April 2021 and were not associated with the Companys publicly announced share repurchase program.\nNote 15 - Earnings Per Share\nThe shares used in the computation of the Companys basic and diluted earnings per common share are reconciled as follows:\nYear Ended August 31,\n(In thousands)\nWeighted average basic common shares outstanding (1)\n32,569\n32,648\n32,670\nDilutive effect of 2.875% Convertible notes, due 2024 (2)(3)\n-\n-\n-\nDilutive effect of 2.875% Convertible notes, due 2028 (4)\n-\n-\nN/A\nDilutive effect of 2.25% Convertible notes, due 2024 (5)\nN/A\n-\n-\nDilutive effect of restricted stock units (6)\n1,062\n1,017\nWeighted average diluted common shares outstanding\n33,631\n33,665\n33,441\n(1)Restricted stock grants and restricted stock units that are considered participating securities, including some grants subject to certain performance criteria, are included in weighted average basic common shares outstanding when the Company is in a net earnings position.\n(2)The dilutive effect of the 2.875% Convertible notes, due 2024 was excluded for the years ended August 31, 2021 and 2020 as the average stock price was less than the applicable conversion price and therefore was anti-dilutive under previous applicable guidance. See further discussion below.\n(3)The dilutive effect of the 2.875% Convertible notes due 2024 was excluded for the year ended August 31, 2022 as they were considered anti-dilutive under the if converted method as further discussed below.\n(4)The dilutive effect of the 2.875% Convertible notes, due 2028 was excluded for the years ended August 31, 2022 and 2021 as the average stock price was less than the applicable conversion price and therefore was considered anti-dilutive. As these notes require cash settlement for the principal, only a premium is potentially dilutive. These convertible notes were issued in April 2021.\n(5)The dilutive effect of the 2.25% Convertible notes, due 2024 was excluded for the years ended August 31, 2021 and 2020 as the average stock price was less than the applicable conversion price and therefore was considered anti-dilutive under previous applicable guidance. These convertible notes were retired in April 2021.\n(6)Restricted stock units that are not considered participating securities and restricted stock units subject to performance criteria, for which actual levels of performance above target have been achieved, are included in weighted average diluted common shares outstanding when the Company is in a net earnings position.\nBasic earnings per common share (EPS) is computed by dividing Net earnings attributable to Greenbrier by weighted average basic common shares outstanding, which includes restricted stock grants and restricted stock units that are considered participating securities when the Company is in a net earnings position.\nThe Company's approach for calculating diluted EPS was modified beginning September 1, 2021 upon the adoption of ASU 2020-06, Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. See Note 2 - Summary of Significant Accounting Policies for additional information.\nFor the year ended August 31, 2022, diluted EPS was calculated using the more dilutive of two methods. The first method includes the dilutive effect, using the treasury stock method, associated with restricted stock units that are not considered participating securities and performance based restricted stock units subject to performance criteria, for which actual levels of performance above target have been achieved. The second method supplements the first by also including the if converted effect of the 2.875% Convertible notes due 2024 and shares underlying the 2.875% Convertible notes due 2028, when there is a conversion premium. Under the if converted method, debt issuance and interest costs, both net of tax, associated with the convertible notes due 2024 are added back to net earnings and the share count is increased by the shares underlying the convertible notes.\nFor the years ended August 31, 2021 and 2020, diluted EPS was calculated using the treasury stock method associated with shares underlying the 2.875% Convertible notes due 2024, 2.25% convertible notes due 2024, restricted stock units that are not considered participating securities and performance based restricted stock units subject to performance criteria, for which actual levels of performance above target have been achieved.\n(In millions, except number of shares which are reflected in\nYear Ended August 31,\nthousands and per share amounts)\nNet earnings attributable to Greenbrier\n$\n46.9\n$\n32.4\n$\n49.0\nWeighted average basic common shares outstanding\n32,569\n32,648\n32,670\nBasic earnings per share\n$\n1.44\n$\n0.99\n$\n1.50\nNet earnings attributable to Greenbrier\n$\n46.9\n$\n32.4\n$\n49.0\nAdd back:\nInterest and debt issuance costs on the 2.875%\nconvertible notes due 2024, net of tax\nn/a\nn/a\nn/a\nEarnings before interest and debt issuance costs\non the 2.875% convertible notes due 2024\nn/a\nn/a\nn/a\nWeighted average diluted common shares outstanding\n33,631\n33,665\n33,441\nDiluted earnings per share\n$\n1.40\n$\n0.96\n$\n1.46\nNote 16 - Related Party Transactions\nThe Company has a 41.9% interest in Axis, a joint venture. The Company purchased $11.5 million, $13.5 million and $12.7 million of railcar components from Axis during the years ended August 31, 2022, 2021 and 2020, respectively.\nThe Company has a 40% interest in the common equity of an entity that buys and sells railcar assets that are leased to third parties. As of August 31, 2022 and 2021 the carrying amount of the investment was $0.7 million and $3.2 million, respectively, which is classified in Investment in unconsolidated affiliates in the Consolidated Balance Sheets. Upon sale of railcars to this entity from Greenbrier, 60% of the related revenue and margin is recognized and 40% is deferred until the railcars are ultimately sold by the entity. The Company recognized $4.7 million in revenue associated with railcars sold into the leasing warehouse during the year ended August 31, 2020. The Company had no material revenue with railcars sold into the leasing warehouse during the years ended August 31, 2022 and 2021. The Company recognized $9.3 million with railcars sold out of the leasing warehouse during the year ended August 31, 2022. The Company had no material revenue with railcars sold out of the leasing warehouse during the years ended August 31, 2021 and 2020. The Company also provides administrative and remarketing services to this entity and earns management fees for these services which were immaterial for each of the years ended August 31, 2022, 2021 and 2020.\nMr. Furman is the owner of a private aircraft managed by a private independent management company. From time to time, the Companys business requires charter use of privately-owned aircraft. In such instances, it is possible that charters may be placed on Mr. Furmans aircraft. The Company placed charters on Mr. Furmans aircraft which aggregated to $0.9 million, $0.2 million and $0.3 million for each of the years ended August 31, 2022, 2021 and 2020, respectively.\nIn May 2020, the Company and its manufacturing partner GIMSA amended its joint venture agreement for its joint ventures in Monclova, Mexico. In addition to certain temporary changes to the existing fee arrangements, the joint ventures also paid dividends of $22.5 million to each of the joint venture partners during the year ended August 31, 2020.\nAs of August 31, 2020, the Company had a $4.5 million note receivable due from Amsted-Maxion Cruzeiro, its unconsolidated Brazilian castings and components manufacturer and a $3.8 million note receivable from Greenbrier-Maxion, its unconsolidated Brazilian railcar manufacturer. These note receivables were included on the Consolidated Balance Sheets in Accounts receivable, net as of August 31, 2020 and were repaid in 2021.\nNote 17 - Income Taxes\nComponents of income tax expense (benefit) were as follows:\nYear Ended August 31,\n(In millions)\nCurrent\nFederal\n$\n(6.7\n)\n$\n(95.9\n)\n$\n21.0\nState\n0.9\n1.9\n0.8\nForeign\n19.2\n4.3\n25.4\n13.4\n(89.7\n)\n47.2\nDeferred\nFederal\n2.2\n54.1\n(8.3\n)\nState\n1.4\n(2.3\n)\n0.7\nForeign\n1.6\n(3.4\n)\n0.5\n5.2\n48.4\n(7.1\n)\nChange in valuation allowance\n(0.5\n)\n1.1\n0.1\nIncome tax expense (benefit)\n$\n18.1\n$\n(40.2\n)\n$\n40.2\nEarnings (loss) before income tax and earnings from unconsolidated affiliates for the years ended August 31, 2022, 2021 and 2020 were $12.4 million, ($30.7 million) and $71.2 million, respectively, for our domestic U.S. operations and $48.2 million, $22.1 million and $53.6 million, respectively for our foreign operations.\nIn response to the COVID 19 pandemic, the CARES Act was signed into law in March 2020. The CARES Act lifts certain deduction limitations originally imposed by the Tax Cuts and Jobs Act of 2017 (the 2017 Tax Act). Corporate taxpayers may carryback net operating losses (NOLs) originating in 2018 through 2020 for up to five years, which was not previously allowed under the 2017 Tax Act. The CARES Act also eliminates the existing limitation on taxable income of 80% by allowing corporate entities to fully utilize NOL carryforwards to offset taxable income in 2018, 2019, or 2020, and allows taxpayers with alternative minimum tax credits to claim a refund in 2020 for the entire amount of the credits instead of recovering the credits through refunds over a period of years, as originally enacted by the 2017 Tax Act. In addition, the CARES Act makes qualified improvement property generally eligible for 15-year cost-recovery and 100% bonus depreciation.\nDue to the enactment of the CARES Act, the Company filed a Federal claim to carryback fiscal year 2021 tax losses to the fiscal years 2016 through 2018, allowing the recovery of Federal income taxes previously paid at Federal rates of 35.0% or 25.7%, rather than the current Federal rate of 21.0% in effect beginning with the fiscal year 2019. The aggregate impact of the CARES Act resulted in a Federal tax benefit of $38.5 million.\nOn August 16, 2022, the Inflation Reduction Act (the IRA) was signed into law. In general, the provisions of the IRA will be effective beginning with fiscal year 2023, with certain exceptions. The IRA includes a new 15% corporate minimum tax as well as a 1% excise tax on corporate stock repurchases applicable to repurchases after December 31, 2022. The Company is in the process of evaluating the potential impacts of the IRA and does not currently expect the IRA to have a material impact on our effective tax rate. However, the analysis is ongoing and incomplete, and it is possible that the IRA could have an adverse effect on the Companys tax liability.\nThe reconciliation between effective and statutory tax rates on operations is as follows:\nYear Ended August 31,\nFederal statutory rate\n21.0\n%\n(21.0\n)%\n21.0\n%\nState income taxes, net of federal benefit\n3.4\n(15.0\n)\n2.0\nForeign operations\n9.0\n25.5\n4.5\nCarryback rate benefit\n(3.2\n)\n(379.1\n)\n-\nPermanent differences\n7.2\n(45.6\n)\n8.9\nChange in valuation allowance\n(0.8\n)\n12.6\n0.1\nUncertain tax positions\n(1.8\n)\n(44.0\n)\n3.1\nNoncontrolling interest in flow-through entity\n(3.0\n)\n(2.9\n)\n(6.1\n)\nOther\n(1.9\n)\n0.7\n(1.3\n)\nEffective tax rate\n29.9\n%\n(468.8\n)%\n32.2\n%\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and deferred tax liabilities were as follows:\nAs of August 31,\n(In millions)\nDeferred tax assets:\nAccrued payroll and related liabilities\n$\n27.6\n$\n23.7\nDeferred revenue\n6.7\n7.4\nInventories and other\n9.8\n16.8\nMaintenance and warranty accruals\n3.2\n2.5\nLease liability\n12.4\n8.5\nNet operating losses\n19.6\n15.9\nInvestment, asset tax credits and other\n1.5\n1.4\n80.8\n76.2\nValuation allowance\n(9.9\n)\n(10.4\n)\nDeferred tax liabilities:\nFixed assets\n(110.6\n)\n(106.1\n)\nOriginal issue discount\n(0.1\n)\n(17.1\n)\nIntangibles\n(5.3\n)\n(3.0\n)\nRight-of-use asset\n(11.9\n)\n(8.9\n)\nOther\n(11.7\n)\n(4.0\n)\n(139.5\n)\n(139.1\n)\nNet deferred tax liability\n$\n(68.6\n)\n$\n(73.3\n)\nAs of August 31, 2022, the Company had $104.8 million of state net operating loss carryforwards that will begin to expire in fiscal 2026, $1.2 million of state credit carryforwards that began to expire in 2022, $33.5 million of foreign net operating loss carryforwards that began to expire in fiscal 2022 and $26.1 million of foreign net operating loss carryforwards that do not expire. The Company has placed a valuation allowance of $9.9 million against the deferred tax assets for which no benefit is anticipated, including those for loss and credit carryforwards not likely to be used before their expiration dates or where the possibility of utilization is remote. The net decrease in the total valuation allowance was approximately $0.5 million for the year ended August 31, 2022.\nThe Company's cumulative undistributed foreign earnings, if repatriated, would be accompanied by foreign withholdings taxes. However, the Company does not intend to repatriate these foreign earnings and continues to assert that its foreign earnings are indefinitely reinvested. As a result, it has not recorded a liability for foreign withholding taxes associated with undistributed foreign earnings.\nThe following is a tabular reconciliation of the total amounts of unrecognized tax benefits:\nYear Ended August 31,\n(In millions)\nUnrecognized Tax Benefit - Opening Balance\n$\n1.6\n$\n5.5\n$\n1.6\nGross increases - tax positions in prior period\n-\n-\n4.0\nGross decreases - tax positions in prior period\n(0.9\n)\n(3.6\n)\n-\nSettlements\n-\n-\n-\nLapse of statute of limitations\n(0.3\n)\n(0.3\n)\n(0.1\n)\nUnrecognized Tax Benefit - Ending Balance\n$\n0.4\n$\n1.6\n$\n5.5\nThe Company is subject to taxation in the U.S. and in various states and foreign jurisdictions. The Company is effectively no longer subject to U.S. Federal examination for fiscal years ending before 2015, to state and local examinations before 2015, or to foreign examinations before 2017.\nUnrecognized tax benefits, excluding interest, at August 31, 2022 and 2021 were $0.4 million and $1.6 million, respectively which if recognized, would affect the effective tax rate. Accrued interest on unrecognized tax benefits as of August 31, 2022 and August 31, 2021 was $0.1 million and $0.4 million, respectively, and included a reduction of $0.3 million and $0.6 million during the period for changes in unrecognized tax benefits. The Company has not accrued any penalties on the unrecognized tax benefits, and does not anticipate a significant decrease in unrecognized tax benefits or accrued interest during the next twelve months.\nInterest and penalties related to income taxes are classified as a component of income tax expense. Benefits from the realization of unrecognized tax benefits for deductible differences attributable to ordinary operations will be recognized as a reduction of income tax expense.\nNote 18 - Segment Information\nThe Company operates in three reportable segments: Manufacturing; Maintenance Services; and Leasing & Management Services.\nThe accounting policies of the segments are the same as those described in the summary of significant accounting policies. Performance is evaluated based on Earnings from operations. Corporate includes selling and administrative costs not directly related to goods and services and certain costs that are intertwined among segments due to our integrated business model. The Company does not allocate Interest and foreign exchange or Income tax benefit (expense) for either external or internal reporting purposes. Intersegment sales and transfers are valued as if the sales or transfers were to third parties. Related revenue and margin are eliminated in consolidation and therefore are not included in consolidated results in the Companys Consolidated Financial Statements.\nIn the first quarter of 2022 the Company renamed two of its reportable segments to more prominently display the nature of the customer solutions it provides and markets in which it operates. The new names of its reportable segments are Manufacturing (unchanged), Maintenance Services (previously Wheels, Repair & Parts), and Leasing & Management Services (previously Leasing & Services). The name changes have no impact on the organizations reporting structure nor on financial information previously reported. Separately, effective September 1, 2021, the Company changed its measurement basis for allocating syndication revenue between the Manufacturing and Leasing & Management Services reportable segments. This change in measurement reflects the information currently used by management to assess the Company's operating performance in accordance with its refined leasing strategy and has no impact to the Companys total consolidated revenue. Segment results for the prior periods have been recast to conform to the current period presentation.\nThe information in the following table is derived directly from the segments internal financial reports used for corporate management purposes.\nFor the year ended August 31, 2022:\nRevenue\nEarnings (loss) from operations\n(In millions)\nExternal\nIntersegment\nTotal\nExternal\nIntersegment\nTotal\nManufacturing\n$\n2,476.6\n$\n191.6\n$\n2,668.2\n$\n97.2\n$\n11.9\n$\n109.1\nMaintenance Services\n347.7\n26.4\n374.1\n21.7\n-\n21.7\nLeasing & Management Services\n153.4\n1.9\n155.3\n108.3\n0.1\n108.4\nEliminations\n-\n(219.9\n)\n(219.9\n)\n-\n(12.0\n)\n(12.0\n)\nCorporate\n-\n-\n-\n(109.2\n)\n-\n(109.2\n)\n$\n2,977.7\n$\n-\n$\n2,977.7\n$\n118.0\n$\n-\n$\n118.0\nFor the year ended August 31, 2021:\nRevenue\nEarnings (loss) from operations\n(In millions)\nExternal\nIntersegment\nTotal\nExternal\nIntersegment\nTotal\nManufacturing\n$\n1,311.1\n$\n92.4\n$\n1,403.5\n$\n48.3\n$\n6.9\n$\n55.2\nMaintenance Services\n298.3\n9.1\n307.4\n6.5\n0.1\n6.6\nLeasing & Management Services\n138.5\n1.1\n139.6\n68.9\n0.2\n69.1\nEliminations\n-\n(102.6\n)\n(102.6\n)\n-\n(7.2\n)\n(7.2\n)\nCorporate\n-\n-\n-\n(82.7\n)\n-\n(82.7\n)\n$\n1,747.9\n$\n-\n$\n1,747.9\n$\n41.0\n$\n-\n$\n41.0\nFor the year ended August 31, 2020:\nRevenue\nEarnings (loss) from operations\n(In millions)\nExternal\nIntersegment\nTotal\nExternal\nIntersegment\nTotal\nManufacturing\n$\n2,309.5\n$\n3.0\n$\n2,312.5\n$\n157.0\n$\n0.1\n$\n157.1\nMaintenance Services\n324.7\n12.6\n337.3\n9.0\n(0.9\n)\n8.1\nLeasing & Management Services\n158.0\n2.3\n160.3\n81.4\n0.2\n81.6\nEliminations\n-\n(17.9\n)\n(17.9\n)\n-\n0.6\n0.6\nCorporate\n-\n-\n-\n(79.0\n)\n-\n(79.0\n)\n$\n2,792.2\n$\n-\n$\n2,792.2\n$\n168.4\n$\n-\n$\n168.4\nYear Ended August 31,\n(In millions)\nAssets:\nManufacturing\n$\n1,853.9\n$\n1,493.5\n$\n1,301.7\nMaintenance Services\n284.8\n260.9\n271.9\nLeasing & Management Services\n1,152.2\n949.4\n739.0\nUnallocated, including cash\n560.6\n686.9\n861.2\n$\n3,851.5\n$\n3,390.7\n$\n3,173.8\nDepreciation and amortization:\nManufacturing\n$\n61.7\n$\n67.8\n$\n78.0\nMaintenance Services\n10.7\n12.0\n12.6\nLeasing & Management Services\n29.6\n20.9\n19.3\n$\n102.0\n$\n100.7\n$\n109.9\nCapital expenditures:\nManufacturing\n$\n48.3\n$\n26.6\n$\n48.2\nMaintenance Services\n9.2\n8.6\n11.7\nLeasing & Management Services\n323.2\n103.8\n7.0\n$\n380.7\n$\n139.0\n$\n66.9\nThe following table summarizes selected geographic information.\nYear Ended August 31,\n(In millions)\nRevenue (1):\nU.S.\n$\n2,452.1\n$\n1,221.4\n$\n2,018.7\nForeign\n525.6\n526.5\n773.5\n$\n2,977.7\n$\n1,747.9\n$\n2,792.2\nAssets:\nU.S.\n$\n2,689.6\n$\n2,506.1\n$\n2,359.3\nMexico\n948.4\n656.6\n590.8\nEurope\n213.5\n228.0\n223.7\n$\n3,851.5\n$\n3,390.7\n$\n3,173.8\n(1)Revenue is presented on the basis of geographic location of customers.\nReconciliation of Earnings from operations to Earnings (loss) before income tax and earnings from unconsolidated affiliates:\nYear Ended August 31,\n(In millions)\nEarnings from operations\n$\n118.0\n$\n41.0\n$\n168.4\nInterest and foreign exchange\n57.4\n43.3\n43.6\nNet loss on extinguishment of debt\n-\n6.3\n-\nEarnings (loss) before income tax and earnings\nfrom unconsolidated affiliates\n$\n60.6\n$\n(8.6\n)\n$\n124.8\nNote 19 - Customer Concentration\nCustomer concentration is defined as a single customer that accounts for more than 10% of total revenues or accounts receivable. In 2022, revenue from three customers represented 16%, 12% and 11% of total revenue. In 2021, revenue from two customers each represented 13% of total revenue. In 2020, revenue from two customers represented 15% and 11% of total revenue. No other customers accounted for more than 10% of total revenues for the years ended August 31, 2022, 2021, or 2020. One customer had a balance that represented 12% of the consolidated accounts receivable balance at August 31, 2022. No customer had a balance that individually equaled or exceeded 10% of accounts receivable at August 31, 2021.\nNote 20 - Lease Commitments\nLessor\nEquipment on operating leases is reported net of accumulated depreciation of $48.6 million, $34.4 million, and $33.4 million as of August 31, 2022, 2021, and 2020, respectively. Depreciation expense was $22.0 million, $13.8 million and $11.6 million as of August 31, 2022, 2021, and 2020 respectively. In addition, certain railcar equipment leased-in by the Company on operating leases is subleased to customers under non-cancelable operating leases with lease terms ranging from one to fourteen years. Operating lease rental revenues included in the Companys Consolidated Statements of Income as of August 31, 2022, 2021, and 2020 was $66.8 million, $69.4 million and $38.7 million respectively, which included $18.1 million, $17.1 million, and $11.2 million respectively, of revenue as a result of daily, monthly or car hire utilization arrangements.\nAggregate minimum future amounts receivable under all non-cancelable operating leases and subleases at August 31, 2022, will mature as follows:\n(In millions)\n$\n46.4\n37.7\n30.3\n26.6\n22.8\nThereafter\n51.2\n$\n215.0\nLessee\nThe Company leases railcars, real estate, and certain equipment under operating and, to a lesser extent, finance lease arrangements. As of and for the twelve months ended August 31, 2022, 2021, and 2020, finance leases were not a material component of the Company's lease portfolio. The Companys real estate and equipment leases have remaining lease terms ranging from less than one year to 76 years, with some including options to extend up to 15 years. The Company recognizes a lease liability and corresponding right-of-use (ROU) asset based on the present value of lease payments. To determine the present value of lease payments, as most of its leases do not provide a readily determinable implicit rate, the Companys incremental borrowing rate is used to discount the lease payments based on information available at lease commencement date. The Company gives consideration to its recent debt issuances as well as publicly available data for instruments with similar characteristics when estimating its incremental borrowing rate.\nThe components of operating lease costs were as follows:\nTwelve Months Ended August 31,\n(In millions)\nOperating lease expense\n$\n10.7\n$\n13.2\n$\n15.3\nShort-term lease expense\n6.0\n5.3\n8.3\nTotal\n$\n16.7\n$\n18.5\n$\n23.6\nAggregate minimum future amounts payable under operating leases having initial or remaining non-cancelable terms at August 31, 2022 will mature as follows:\n(In millions)\n$\n12.9\n11.1\n8.4\n7.3\n4.6\nThereafter\n17.4\nTotal lease payments\n$\n61.7\nLess: Imputed interest\n(5.3\n)\nTotal lease obligations\n$\n56.4\nThe table below presents additional information related to the Companys leases:\nWeighted average remaining lease term\nOperating leases\n11.4 years\nWeighted average discount rate\nOperating leases\n2.3\n%\nSupplemental cash flow information related to leases were as follows:\n(In millions)\nTwelve months ended August 31, 2022\nCash paid for amounts included in the measurement of lease liabilities\nOperating cash flows from operating leases\n$\n11.4\nROU assets obtained in exchange for new operating lease liabilities\n$\n24.7\nROU assets disposed of for lease terminations\n$\n-\nNote 21 - Commitments and Contingencies\nPortland Harbor Superfund Site\nThe Companys Portland, Oregon manufacturing facility (the Portland Property) is located adjacent to the Willamette River. In December 2000, the U.S. Environmental Protection Agency (EPA) classified portions of the Willamette River bed known as the Portland Harbor, including the portion fronting the Companys manufacturing facility, as a federal \"National Priority List\" or \"Superfund\" site due to sediment contamination (the Portland Harbor Site). The Company and more than 140 other parties have received a \"General Notice\" of potential liability from the EPA relating to the Portland Harbor Site. The letter advised the Company that it may be liable for the costs of investigation and remediation (which liability may be joint and several with other potentially responsible parties) as well as for natural resource damages resulting from releases of hazardous substances to the site. Ten private and public entities, including the Company (the Lower Willamette Group or LWG), signed an Administrative Order on Consent (AOC) to perform a remedial investigation/feasibility study (RI/FS) of the Portland Harbor Site under EPA oversight, and several additional entities did not sign such consent, but nevertheless contributed financially to the effort. The EPA-mandated RI/FS was produced by the LWG and cost over $110 million during a 17-year period. The Company bore a percentage of the total costs incurred by the LWG in connection with the investigation. The Companys aggregate expenditure during the 17-year period was not material. Some or all of any such outlay may be recoverable from other responsible parties. The EPA issued its Record of Decision (ROD) for the Portland Harbor Site on January 6, 2017 and accordingly on October 26, 2017, the AOC was terminated.\nSeparate from the process described above, which focused on the type of remediation to be performed at the Portland Harbor Site and the schedule for such remediation, 83 parties, including the State of Oregon and the federal government, entered into a non-judicial mediation process to try to allocate costs associated with remediation of the Portland Harbor Site. Approximately 110 additional parties signed tolling agreements related to such allocations. On April 23, 2009, the Company and the other AOC signatories filed suit against 69 other parties due to a possible limitations period for some such claims; Arkema Inc. et al v. A & C Foundry Products, Inc. et al, U.S. District Court, District of Oregon, Case #3:09-cv-453-PK. All but 12 of these parties elected to sign tolling agreements and be dismissed without prejudice, and the case has been stayed by the court until January 14, 2025.\nThe EPA's January 6, 2017 ROD identifies a clean-up remedy that the EPA estimates will take 13 years of active remediation, followed by 30 years of monitoring with an estimated undiscounted cost of $1.7 billion. The EPA typically expects its cost estimates to be accurate within a range of -30% to +50%, but this ROD states that changes in costs are likely to occur. The EPA has identified 15 Sediment Decision Units within the ROD cleanup area. One of the units, RM9W, includes the nearshore area of the river sediments offshore of the Portland Property as well as downstream of the facility. It also includes a portion of the Companys riverbank. The ROD does not break down total remediation costs by Sediment Decision Unit. The EPA requested that potentially responsible parties enter AOCs during 2019 agreeing to conduct remedial design studies. Some parties have signed AOCs, including one party with respect to RM9W which includes the area offshore of the Portland Property. The Company has not signed an AOC in connection with remedial design, but will assist in conducting or funding a portion of the RM9W remedial design.\nThe ROD does not address responsibility for the costs of clean-up, nor does it allocate such costs among the potentially responsible parties. Responsibility for funding and implementing the EPA's selected cleanup remedy will be determined at an unspecified later date. Based on the investigation to date, the Company believes that it did not contribute in any material way to contaminants of concern in the river sediments or the damage of natural resources in the Portland Harbor Site and that the damage in the area of the Portland Harbor Site adjacent to its property precedes the Companys ownership of the Portland Property. Because these environmental investigations are still underway, sufficient information is currently not available to determine the Companys liability, if any, for the cost of any required remediation or restoration of the Portland Harbor Site or to estimate a range of potential loss. Based on the results of the pending investigations and future assessments of natural resource damages, the Company may be required to incur costs associated with additional phases of investigation or remedial action, and may be liable for damages to natural resources. In addition, the Company may be required to perform periodic maintenance dredging in order to continue to launch vessels from its launch ways in Portland, Oregon, on the Willamette River, and the river's classification as a Superfund site could result in some limitations on future dredging and launch activities. Any of these matters could adversely affect the Companys business and Consolidated Financial Statements, or the value of the Portland Property.\nOn January 30, 2017 the Confederated Tribes and Bands of Yakama Nation sued 33 parties including the Company as well as the U.S. and the State of Oregon for costs it incurred in assessing alleged natural resource damages to the Columbia River from contaminants deposited in Portland Harbor. Confederated Tribes and Bands of the Yakama Nation v. Air Liquide America Corp., et al., U.S. Court for the District of Oregon Case No. 3i17-CV-00164-SB. The complaint does not specify the amount of damages the plaintiff will seek. The case has been stayed until January 14, 2025.\nOregon Department of Environmental Quality (DEQ) Regulation of Portland Manufacturing Operations\nThe Company entered into a Voluntary Cleanup Agreement with the Oregon Department of Environmental Quality (DEQ) in which the Company agreed to conduct an investigation of whether, and to what extent, past or present operations at the Portland Property may have released hazardous substances into the environment. The Company has also signed an Order on Consent with the DEQ to finalize the investigation of potential onsite sources of contamination that may have a release pathway to the Willamette River. Interim precautionary measures are also required in the order and the Company is discussing with the DEQ potential remedial actions which may be required. The Companys aggregate expenditure has not been material, however it could incur significant expenses for remediation. Some or all of any such outlay may be recoverable from other responsible parties.\nOther Litigation, Commitments and Contingencies\nFollowing conclusion of an investigation, the Company reached a preliminary agreement in principle (Proposed Settlement) with the Securities and Exchange Commission (SEC) staff pursuant to which the Company would consent, without admitting or denying the SECs allegations, to the entry of an administrative order to cease-and-desist from violating certain federal securities laws and would pay a civil penalty of $1 million. The Proposed Settlement relates to disclosures of executive compensation perquisites and related party transactions in the Companys proxy statements filed with the SEC in connection with annual meetings of shareholders. None of the violations included in the Proposed Settlement include an allegation of intentional wrongdoing by the Company. The Proposed Settlement with the SEC staff is subject to approval by the Commissioners of the SEC. There can be no assurance that the Proposed Settlement will be approved by the Commissioners of the SEC upon the terms as currently proposed or at all.\nIn consultation with outside advisors, the Company has determined that no amendment to the Companys previously filed periodic reports, and no restatement of the previously issued financial statements of the Company for the applicable periods, would be required in connection with the matters described above. The Company believes the Proposed Settlement is in the best interest of the Company and its shareholders.\nFrom time to time, Greenbrier is involved as a defendant in litigation in the ordinary course of business, the outcomes of which cannot be predicted with certainty. While the ultimate outcome of such legal proceedings cannot be determined at this time, the Company believes that the resolution of pending litigation will not have a material adverse effect on the Company's Consolidated Financial Statements.\nAs of August 31, 2022, the Company had outstanding letters of credit aggregating to $6.9 million associated with performance guarantees, facility leases and workers compensation insurance.\nNote 22 - Fair Value Measures\nCertain assets and liabilities are reported at fair value on either a recurring or nonrecurring basis. Fair value, for this disclosure, is defined as an exit price, representing the amount that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants, under a three-tier fair value hierarchy which prioritizes the inputs used in measuring a fair value as follows:\nLevel 1 - observable inputs such as unadjusted quoted prices in active markets for identical instruments;\nLevel 2 - inputs, other than the quoted market prices in active markets for similar instruments, which are observable, either directly or indirectly; and\nLevel 3 - unobservable inputs for which there is little or no market data available, which require the reporting entity to develop its own assumptions.\nAssets and liabilities measured at fair value on a recurring basis as of August 31, 2022 are:\n(In millions)\nTotal\nLevel 1\nLevel 2(1)\nLevel 3\nAssets:\nDerivative financial instruments\n$\n21.4\n$\n-\n$\n21.4\n$\n-\nNonqualified savings plan investments\n40.3\n40.3\n-\n-\nCash equivalents\n119.4\n119.4\n-\n-\n$\n181.1\n$\n159.7\n$\n21.4\n$\n-\nLiabilities:\nDerivative financial instruments\n$\n3.0\n$\n-\n$\n3.0\n$\n-\nAssets and liabilities measured at fair value on a recurring basis as of August 31, 2021 are:\n(In millions)\nTotal\nLevel 1\nLevel 2(1)\nLevel 3\nAssets:\nDerivative financial instruments\n$\n0.1\n$\n-\n$\n0.1\n$\n-\nNonqualified savings plan investments\n47.7\n47.7\n-\n-\nCash equivalents\n228.9\n228.9\n-\n-\n$\n276.7\n$\n276.6\n$\n$\n-\nLiabilities:\nDerivative financial instruments\n$\n10.4\n$\n-\n$\n10.4\n$\n-\n(1)Level 2 assets include derivative financial instruments which are valued based on significant observable inputs. See Note 13 - Derivative Instruments for further discussion.\nNote 23 - Fair Value of Financial Instruments\nThe estimated fair values of financial instruments and the methods and assumptions used to estimate such fair values are as follows:\n(In millions)\nCarrying\nAmount 1\nEstimated\nFair Value\n(Level 2)\nNotes payable as of August 31, 2022\n$\n1,289.0\n$\n1,231.2\nNotes payable as of August 31, 2021\n$\n913.8\n$\n935.9\n1 Carrying amount disclosed in this table excludes debt discount and debt issuance costs.\nThe carrying amount of cash and cash equivalents, accounts and notes receivable, revolving notes and accounts payable and accrued liabilities is a reasonable estimate of fair value of these financial instruments. Estimated rates currently available to the Company for debt with similar terms and remaining maturities and current market data are used to estimate the fair value of notes payable. Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. Item 9A.\tCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management has evaluated, under the supervision and with the participation of our Principal Executive Officer and Principal Financial and Accounting Officer, the effectiveness of our disclosure controls and procedures as of the end of the period covered by this report pursuant to Rule 13a-15(b) under the Securities Exchange Act of 1934 (the Exchange Act). Based on that evaluation, our Principal Executive Officer and Principal Financial and Accounting Officer have concluded that, as of the end of the period covered by this report, our disclosure controls and procedures were not effective at the reasonable assurance level in ensuring that information required to be disclosed in our Exchange Act reports is (1) recorded, processed, summarized and reported in a timely manner, and (2) accumulated and communicated to our management, including our Principal Executive Officer and Principal Financial and Accounting Officer, due to the material weakness in internal control over financial reporting, described below, to allow timely decisions regarding required disclosure.\nIn light of the material weakness described below, management performed additional analysis and other procedures to ensure that our consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). Accordingly, management believes that the consolidated financial statements included in this Annual Report on Form 10-K fairly present, in all material respects, our financial position, results of operations, and cash flows as of and for the periods presented, in accordance with U.S. GAAP.\nManagements Report on Internal Control over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control over financial reporting is a process designed under the supervision of our Principal Executive Officer and Principal Financial and Accounting Officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external reporting purposes in accordance with U.S. GAAP.\nAs of the end of our 2022 fiscal year, management conducted an assessment of the effectiveness of our internal control over financial reporting based on the framework established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management has determined that our internal control over financial reporting was not effective as of August 31, 2022 because of a material weakness in our internal control over financial reporting. We did not have effective controls over change management of system configurations in one IT environment to ensure all changes were logged and approved. As a result, process level automated controls that are dependent on the affected IT environment were ineffective because they could have been adversely impacted. This control deficiency was the result of our risk assessment not identifying a control to ensure the completeness and accuracy of all system configuration changes subject to change management controls.\nNotwithstanding that we did not identify any material misstatements to the consolidated financial statements and there were no changes to previously released financial results as a result of this material weakness, the control deficiency created a reasonable possibility that a material misstatement to the consolidated financial statements would not be prevented or detected on a timely basis.\nOur independent registered public accounting firm, KPMG LLP, who audited the consolidated financial statements included in this report, has issued an adverse opinion on the effectiveness of the Companys internal control over financial reporting, which is included at the end of Part II, Item 9A of this Form 10-K.\nRemediation Plans\nWe plan to implement controls to ensure that all system changes to configurations within this IT environment are logged and approved. Once controls are designed and implemented, the controls must be operating effectively for a sufficient period of time and be tested by management in order to consider them remediated and conclude that the design is effective to address the risks of material misstatement.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the quarter ended August 31, 2022 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nInherent Limitations on Effectiveness of Controls\nOur management, including the Principal Executive Officer and Principal Financial and Accounting Officer, does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent or detect all error and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that misstatements due to error or fraud will not occur or that all control issues and instances of fraud, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based in part on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Projections of any evaluation of controls effectiveness to future periods are subject to risks. Over time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nThe Greenbrier Companies, Inc.:\nOpinion on Internal Control Over Financial Reporting\nWe have audited The Greenbrier Companies, Inc. and subsidiaries' (the Company) internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. In our opinion, because of the effect of the material weakness, described below, on the achievement of the objectives of the control criteria, the Company has not maintained effective internal control over financial reporting as of August 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of August 31, 2022 and 2021, the related consolidated statements of income, comprehensive income, equity, and cash flows for each of the years in the three-year period ended August 31, 2022, and the related notes (collectively, the consolidated financial statements), and our report dated October 28, 2022 expressed an unqualified opinion on those consolidated financial statements.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. A material weakness related to ineffective controls over change management of system configurations in one IT environment to ensure all changes were logged and approved resulted in ineffective process level automated controls dependent on the affected IT environment that could have been adversely impacted and has been identified and included in managements assessment. The material weakness was considered in determining the nature, timing, and extent of audit tests applied in our audit of the 2022 consolidated financial statements, and this report does not affect our report on those consolidated financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audit also included performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ KPMG LLP\nPortland, Oregon\nOctober 28, 2022 Item 9B.\tOTHER INFORMATION\nNone\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable\nPART III Item 10.\tDIRECTORS AND EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation required by this item will be included under the captions Election of Directors, Board Committees, Meetings and Charters and Our Code of Business Conduct and Ethics and FCPA Compliance in our definitive Proxy Statement on Schedule 14A for the 2023 Annual Meeting of Shareholders to be filed with the Securities and Exchange Commission within 120 days after the year ended August 31, 2022 (as amended, updated, supplemented, or restated, 2023 Proxy Statement) and is incorporated herein by reference. Information required by this item regarding the executive officers of the Company is included under the caption Information about our Executive Officers in Part I of this 10-K and is incorporated herein by reference. Item 11.\tEXECUTIVE COMPENSATION\nThe information required by this item will be included under the caption Executive Compensation, Compensation Committee Report, 2022 Director Compensation and Risk Oversight in the 2023 Proxy Statement and is incorporated herein by reference. Item 12.\tSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDERS MATTERS\nThe information required by this item will be included under the captions Stock Ownership of Certain Beneficial Owners and Management and Equity Compensation Plan Information in the 2023 Proxy Statement and is incorporated herein by reference. Item 13.\tCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this item will be included under the captions Related Person Transactions and Board Independence in the 2023 Proxy Statement and is incorporated herein by reference. Item 14.\tPRINCIPAL ACCOUNTING FEES AND SERVICES\nThe information required by this item will be included under the caption Ratification of Appointment of Independent Auditors in the 2023 Proxy Statement and is incorporated herein by reference.\nPART IV Item 15.\tEXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(1) Financial Statements\nSee Consolidated Financial Statements in Item 8\n(a)\t(2) Financial Statements Schedule**\n* * All other schedules have been omitted because they are inapplicable, not required or because the information is given in the Consolidated Financial Statements or notes thereto. This supplemental schedule should be read in conjunction with the Consolidated Financial Statements and notes thereto included in this report.\n(a)\n(3)\nThe following exhibits are filed herewith and this list is intended to constitute the exhibit index:\n3.1\nRegistrants Articles of Incorporation are incorporated herein by reference to Exhibit 3.1 to the Registrants Form 10-Q filed April 5, 2006.\n3.2\nArticles of Merger amending the Registrants Articles of Incorporation are incorporated herein by reference to Exhibit 3.2 to the Registrants Form 10-Q filed April 5, 2006.\n3.3\nAmended and Restated Bylaws of The Greenbrier Companies, Inc. dated July 6, 2022 and Effective September 1, 2022\n4.1\nSpecimen Common Stock Certificate of Registrant is incorporated herein by reference to Exhibit 4.1 to the Registrants Registration Statement on Form S-3 filed April 7, 2010 (SEC File Number 333-165924).\n4.2\nIndenture between the Registrant and Wells Fargo Bank, National Association, as Trustee, including the Form of Note attached as Exhibit A thereto, dated February 6, 2017, is incorporated herein by reference to Exhibit 4.1 to the Registrants Form 8-K filed February 6, 2017.\n4.3\nDescription of the Registrant's Securities Under Section 12 of the Securities Exchange Act of 1934 is incorporated herein by reference to Exhibit 4.3 to the Registrants Form 10-K filed October 29, 2019.\n4.4\nIndenture between the Registrant and Wells Fargo Bank, National Association, as Trustee, including the Form of Note attached as Exhibit A thereto, dated April 20, 2021 is incorporated herein by reference to Exhibit 4.1 to the Registrants Form 8-K filed April 21, 2021.\n4.5\nFirst Supplemental Indenture dated June 1, 2021 to the Indenture dated April 20, 2021 between the Registrant and Wells Fargo Bank, National Association, as Trustee, including the Form of Note attached as Exhibit A thereto is incorporated herein by reference to Exhibit 4.5 to the Registrants Form 10-Q filed July 9, 2021.\n10.1*\nAmended and Restated Employment Agreement between the Registrant and Mr. William A. Furman, dated August 28, 2012, is incorporated herein by reference to Exhibit 10.3 to the Registrants Form 10-Q filed January 9, 2013.\n10.2*\nAmendment to Amended and Restated Employment Agreement between Registrant and Mr. William A. Furman dated as of July 6, 2020, is incorporated herein by reference to Exhibit 10.1 to the Registrants Form 8-K filed July 10, 2020.\n10.3*\nForm of Amended and Restated Employment Agreement between the Registrant and certain of its executive officers, as amended and restated on August 28, 2012, is incorporated herein by reference to Exhibit 10.8 to the Registrants Form 10-K filed November 1, 2012.\n10.4*\nAmendment No. 1 to Form of Amended and Restated Employment Agreement between the Registrant and certain of its executive officers, as amended and restated on August 28, 2012, is incorporated herein by reference to Exhibit 10.1 to the Registrants Form 10-Q filed January 8, 2014.\n10.5*\nSecond Amendment to Form of Amended and Restated Employment Agreement between the Registrant and certain of its executive officers, as amended and restated on August 28, 2012, is incorporated herein by reference to Exhibit 10.1 to the Registrants Form 10-Q filed June 29, 2018.\n10.6*\nForm of Amendment to Amended and Restated Employment Agreement between the Registrant and certain of its executive officers is incorporated herein by reference to Exhibit 10.5 to the Registrants Form 10-K filed October 29, 2019.\n10.7*\nAmended and Restated Fourth Amendment to the Amended and Restated Employment Agreement between Registrant and Alejandro Centurion dated as of September 17, 2021 is incorporated herein by reference to Exhibit 10.7 to the Registrants Form 10-K filed October 26, 2021.\n10.8*\nForm of Change of Control Agreement is incorporated herein by reference to Exhibit 10.5 to the Registrants Form 10-Q filed April 4, 2013.\n10.9*\nThe Greenbrier Companies, Inc. Form of Amendment to Change of Control Agreement, approved on May 28, 2013, is incorporated herein by reference to Exhibit 10.2 of the Registrants Form 8-K filed June 3, 2013.\n10.10*\nThe Greenbrier Companies, Inc. 2014 Amended and Restated Stock Incentive Plan is incorporated herein by reference to Appendix A to the Registrants Proxy Statement on Schedule 14A filed November 19, 2014.\n10.11*\nThe Greenbrier Companies, Inc. 2021 Stock Incentive Plan is incorporated herein by reference to Exhibit 99.1 to Registrant's Form S-8 filed January 6, 2021.\n10.12*\nStock Incentive Grant Program for Non-Employee Directors under the 2021 Stock Incentive Plan is incorporated by reference to Exhibit 10.2 to Registrant's Form 10-Q filed April 6, 2021.\n10.13*\nThird Amendment dated as of January 27, 2021 to Amended and Restated Employment Agreement between Registrant and Mark Rittenbaum is incorporated by reference to Exhibit 10.3 to Registrant's Form 10-Q filed April 6, 2021.\n10.14*\nThe Greenbrier Companies, Inc. 2017 Amended and Restated Stock Incentive Plan is incorporated herein by reference to Appendix A to the Registrants Proxy Statement on Schedule 14A filed November 14, 2017.\n10.15*\nThe Greenbrier Companies, Inc. Nonqualified Deferred Compensation Plan 2018 Amendment and Restatement of the Basic Plan Document is incorporated herein by reference to Exhibit 10.4 to the Registrants Form 10-Q filed June 29, 2018.\n10.16*\nThe Greenbrier Companies Nonqualified Deferred Compensation Plan 2018 Amendment and Restatement of the Adoption Agreement is incorporated herein by reference to Exhibit 10.5 to the Registrants Form 10-Q filed June 29, 2018.\n10.17*\nUpdated Rabbi Trust Agreements, dated October 1, 2012, related to The Greenbrier Companies, Inc. Nonqualified Deferred Compensation Plan, are incorporated herein by reference to Exhibit 10.1 to the Registrants Form 10-Q filed January 9, 2013.\n10.18*\nAmendment No. 1 to Trust Agreement, dated June 15, 2018, related to The Greenbrier Companies, Inc. Nonqualified Deferred Compensation Plan, is incorporated by reference to Exhibit 10.6 to the Registrants Form 10-Q filed June 29, 2018.\n10.19*\nThe Greenbrier Companies Nonqualified Deferred Compensation Plan Adoption Agreement for Directors, dated July 1, 2012, is incorporated herein by reference to Exhibit 10.28 to the Registrants Form 10-K filed November 1, 2012.\n10.20*\nAmendment No. 1 to the Greenbrier Companies Nonqualified Deferred Compensation Plan Adoption Agreement for Directors, dated December 15, 2015, is incorporated herein by reference to Exhibit 10.1 to the Registrants Form 10-Q filed April 5, 2016.\n10.21*\nThe Greenbrier Companies, Inc. 2014 Employee Stock Purchase Plan is incorporated herein by reference to Appendix B to the Registrants Definitive Proxy Statement on Schedule 14A filed on November 19, 2014.\n10.22*\nThe Greenbrier Companies, Inc. Amendment to 2014 Employee Stock Purchase Plan is incorporated herein by reference to Appendix A to the Registrants Definitive Proxy Statement on Schedule 14A filed on November 14, 2018.\n10.23*\nConsulting Services Agreement between Greenbrier Leasing Company LLC and Charles J. Swindells dated January 7, 2016 is incorporated herein by reference to Exhibit 10.3 to the Registrants Form 10-Q filed April 5, 2016.\n10.24\nDissolution Agreement, dated August 20, 2018, by and among the Registrant, Greenbrier Rail Services Holdings, LLC, Watco Companies, L.L.C., Millennium Rail, L.L.C., Watco Mechanical Services, L.L.C., GBW Railcar Services Holdings, L.L.C., GBW Railcar Services, L.L.C., and GBW Railcar Services Canada, Inc. is incorporated herein by reference to Exhibit 10.26 to the Registrants Form 10-K filed October 26, 2018.\n10.25\nSecond Amended and Restated Limited Liability Company Agreement of GBW Railcar Services Holdings, L.L.C., dated August 20, 2018, by and among Greenbrier Rail Services Holdings, LLC, Watco Mechanical Services, L.L.C., and Millennium Rail, L.L.C. is incorporated herein by reference to Exhibit 10.27 to the Registrants Form 10-K filed October 26, 2018.\n10.26\nFourth Amended and Restated Credit Agreement, dated as of September 26, 2018, by and among The Greenbrier Companies, Inc., Bank of America, N.A., as Administrative Agent, Merrill Lynch, Pierce, Fenner & Smith Incorporated, as Sole Lead Arranger and Sole Bookrunner, MUFG Union Bank, N.A., as Syndication Agent, Bank of the West, Branch Banking and Trust Company, Fifth Third Bank, and Wells Fargo Bank, National Association, as Co-Documentation Agents, and the lenders identified therein is incorporated herein by reference to Exhibit 10.28 to the Registrants Form 10-K filed October 26, 2018.\n10.27\nFirst Amendment to the Fourth Amended and Restated Credit Agreement, dated as of September 26, 2018, by and among The Greenbrier Companies, Inc., Bank of America, N.A., as Administrative Agent, Merrill Lynch, Pierce, Fenner & Smith Incorporated, as Sole Lead Arranger and Sole Bookrunner, MUFG Union Bank, N.A., as Syndication Agent, Bank of the West, Branch Banking and Trust Company, Fifth Third Bank, and Wells Fargo Bank, National Association, as Co-Documentation Agents, and the lenders identified therein is incorporated by reference to Exhibit 10.22 to the Registrants Form 10-K filed October 29, 2019.\n10.28\nSecond Amendment to the Fourth Amended and Restated Credit Agreement, dated as of August 27, 2021, by and among The Greenbrier Companies, Inc., the guarantors and lenders party thereto, and Bank of America, N.A., as Administrative Agent is incorporated herein by reference to Exhibit 10.28 to the Registrants Form 10-K filed October 26, 2021.\n10.29\nFourth Amended and Restated Security Agreement, dated as of September 26, 2018, by and among The Greenbrier Companies, Inc., and the other parties identified as Debtors therein, in favor of Bank of America, N.A., as Administrative Agent is incorporated herein by reference to Exhibit 10.29 to the Registrants Form 10-K filed October 26, 2018.\n10.30\nFourth Amended and Restated Pledge Agreement, dated as of September 26, 2018, by and among The Greenbrier Companies, Inc., and the other parties identified as Debtors therein, in favor of Bank of America, N.A., as Administrative Agent is incorporated herein by reference to Exhibit 10.30 to the Registrants Form 10-K filed October 26, 2018.\n10.31\nAmended and Restated Credit Agreement, dated as of September 26, 2018, by and among Greenbrier Leasing Company LLC, an Oregon limited liability company, Bank of America, N.A., as Administrative Agent, Merrill Lynch, Pierce, Fenner & Smith Incorporated, as Sole Lead Arranger and Sole Bookrunner, MUFG Union Bank, N.A., as Syndication Agent, and the lenders identified therein is incorporated herein by reference to Exhibit 10.31 to the Registrants Form 10-K filed October 26, 2018.\n10.32\nFirst Amendment to Amended and Restated Credit Agreement, dated as of August 27, 2021, by and among Greenbrier Leasing Company LLC, an Oregon limited liability company, lenders party thereto, and Bank of America, N.A., as Administrative Agent is incorporated herein by reference to Exhibit 10.32 to the Registrants Form 10-K filed October 26, 2021.\n10.33\nAmended and Restated Security Agreement, dated as of September 26, 2018, by and between Greenbrier Leasing Company LLC, an Oregon limited liability company, in favor of Bank of America, N.A., as Administrative Agent is incorporated herein by reference to Exhibit 10.32 to the Registrants Form 10-K filed October 26, 2018.\n10.34\nPurchase Agreement, dated January 31, 2017, among The Greenbrier Companies, Inc., Merrill Lynch, Pierce, Fenner & Smith Incorporated and Goldman, Sachs & Co. is incorporated herein by reference to Exhibit 10.1 of the Registrants Form 8-K filed February 6, 2017.\n10.35\nAsset Purchase Agreement, dated as of April 17, 2019, by and among The Greenbrier Companies, Inc., GBXL, LLC, and American Railcar Industries, Inc., is incorporated herein by reference to Exhibit 2.1 to the Registrants Form 8-K filed April 18, 2019.\n10.36\nConvertible Promissory Note issued by The Greenbrier Companies, Inc. to American Railcar Industries, Inc. is incorporated herein by reference to Exhibit 4.1 to the Registrants Form 8-K filed July 29, 2019.\n10.37\nSecond Amendment to Amended and Restated Credit Agreement, dated as of July 29, 2022, by and among Greenbrier Leasing Company LLC, an Oregon limited liability company, lenders party thereto, and Bank of America, N.A., as Administrative Agent.\n10.38\nThird Amendment to the Fourth Amended and Restated Credit Agreement, dated as of July 29, 2022, by and among The Greenbrier Companies, Inc., the guarantors and lenders party thereto, and Bank of America, N.A., as Administrative Agent.\n10.39*\nAmended and Restated Third Amendment to the Amended and Restated Employment Agreement between the Registrant and William A. Furman is incorporated herein by reference to Exhibit 10.1 to the Registrant's Form 10-Q filed on July 11, 2022.\n10.40*\nAmended and Restated Fifth Amendment to the Amended and Restated Employment Agreement between the Registrant and Alejandro Centurion is incorporated herein by reference to Exhibit 10.2 to the Registrant's Form 10-Q filed on July 11, 2022.\n10.41\nMaster Indenture dated February 9, 2022 between GBX Leasing 2022-1 LLC and U.S. Bank Trust Company, National Association as indenture trustee and U.S. Bank National Association, as securities intermediary is incorporated herein by reference to Exhibit 10.37 to the Registrant's Form 10-Q filed on April 6, 2022. [Portions omitted]\n10.42\nSeries 2022-1 Supplement dated February 9, 2022 between GBX Leasing 2022-1 LLC and U.S. Bank National Association, as Indenture Trustee (including Forms of Note attached as Exhibit A and Exhibit B thereto) is incorporated herein by reference to Exhibit 10.38 to the Registrant's Form 10-Q filed on April 6, 2022. [Portions omitted]\n10.43\nAmendment No. 2 to Warehouse Loan Agreement dated August 26, 2022 by among GBXL I, LLC, as borrower, Bank of America N.A. as a lender and as agent and Credit Agricole Corporate and Investment Bank, as lender.\n21.1\nList of the subsidiaries of the Registrant.\n23.1\nConsent of KPMG LLP.\n31.1\nCertification pursuant to Rule 13(a) - 14(a).\n31.2\nCertification pursuant to Rule 13(a) - 14(a).\n32.1\nCertification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2\nCertification pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (Formatted as inline XBRL and contained in Exhibit 101).\n* Management contract or compensatory plan or arrangement\nNote: For all exhibits incorporated by reference, unless otherwise noted above, the SEC file number is 001-13146.\nItem 16.\tFORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities and Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTHE GREENBRIER COMPANIES, INC.\nDated: October 28, 2022\nBy: /s/ Lorie L. Tekorius\nLorie L. Tekorius\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nDate\n/s/ Lorie L. Tekorius\nOctober 28, 2022\nLorie Tekorius, President,\nChief Executive Officer and Director\n/s/ Thomas B. Fargo\nOctober 28, 2022\nThomas B. Fargo, Chair of the Board\n/s/ Wanda F. Felton\nOctober 28, 2022\nWanda F. Felton, Director\n/s/ William A. Furman\nOctober 28, 2022\nWilliam A. Furman, Director\n/s/ Antonio Garza\nOctober 28, 2022\nAntonio Garza, Director\n/s/ James R. Huffines\nOctober 28, 2022\nJames R. Huffines, Director\n/s/ Graeme A. Jack\nOctober 28, 2022\nGraeme A. Jack, Director\n/s/ David L. Starling\nOctober 28, 2022\nDavid L. Starling, Director\n/s/ Charles J. Swindells\nOctober 28, 2022\nCharles J. Swindells, Director\n/s/ Wendy L. Teramoto\nOctober 28, 2022\nWendy L. Teramoto, Director\n/s/ Kelly M. Williams\nOctober 28, 2022\nKelly M. Williams, Director\n/s/ Adrian J. Downes\nOctober 28, 2022\nAdrian J. Downes, Senior Vice President,\nChief Financial Officer and Chief Accounting Officer\n(Principal Financial Officer and Principal Accounting Officer)"
}