{
    "cik": "924095",
    "company": "Metavesco, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "6199",
    "state_of_inc": "NV",
    "state_location": "VA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/924095/0001493152-23-037175-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/924095/000149315223037175/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/924095/0001493152-23-037175.txt",
    "filename": "924095_10K_2023_0001493152-23-037175.htm",
    "content": "ITEM 1. BUSINESS\nThe Company was incorporated in the Commonwealth of Virginia on July 13, 1993, and was a closed-end investment company licensed by the Small Business Administration (the SBA) as a Small Business Investment Company (SBIC). The Company previously made equity investments in and provided loans to small businesses to finance their growth, expansion, and development. Under applicable SBA regulations, the Company was restricted to investing only in qualified small businesses as contemplated by the Small Business Investment Act of 1958. As a registered investment company under the Act, the Companys investment objective was to provide its shareholders with a high level of income, with capital appreciation as a secondary objective. The Company made its first investment in a small business in October 1996.\nOn March 30, 2010, the SBA notified the Company that its account had been transferred to liquidation status and that the outstanding debentures of $16.1 million-plus accrued interest (the Debentures) were due and payable within fifteen days of the date of the letter. The Company did not possess adequate liquid assets to make this payment. The Company negotiated terms of a settlement agreement with the SBA effective September 1, 2010. The Debentures were repurchased by the SBA in September 2010, represented by a Note Agreement between the SBA and the Company. The Note Agreement had a maturity of March 31, 2013. In the event of a default, the SBA had the ability to seek receivership.\nOn May 24, 2012, the SBA delivered to the Company a notice of an event of default for failure to meet the principal repayment schedule under the Note Agreement (the Notice). Under the terms of the Notice and the Note Agreement, the SBA maintained a continuing right to terminate the Note Agreement and appoint a receiver to manage the Companys assets.\nOn November 20, 2013, the SBA filed a complaint in the United States District Court for the Eastern District of Virginia (the District Court) seeking, among other things, receivership for the Company and judgment in the amount outstanding under the Note Agreement plus continuing interest. The complaint alleged that as of October 31, 2013, there remained an outstanding balance of $11,762,634.58 under the Note Agreement, including interest, which continued to accrue at the rate of $2,021.93 per day. In filing the complaint, the SBA requested that the District Court take exclusive jurisdiction of the Company and all of its assets wherever located and appoint the SBA as permanent receiver of the Company to liquidate all of the Companys assets and satisfy the claims of its creditors in the order of priority as determined by the District Court.\nOn May 28, 2014, the District Court entered a Consent Order and Judgment Dismissing Counterclaim, Appointing Receiver, Granting Permanent Injunctive Relief and Granting Money Judgment (the Order). The Order appointed the SBA as receiver of the Company, and the SBA designated Charles Fulford as its principal agent to act on its behalf as the receiver (the Receiver). The Order authorized the Receiver to marshal and liquidate all of the Companys assets in an orderly manner. The Order also served to enter judgment in favor of the United States of America, on behalf of the SBA, against the Company for $11,770,722. Such amount represented $11,700,000 in principal and $70,722 in accrued interest. The District Court assumed jurisdiction over the Company, and the SBA was appointed Receiver effective May 28, 2014.\nThe Company effectively stopped conducting an active business upon the appointment of the SBA as Receiver and the commencement of the receivership ordered by the District Court (the Receivership). Over the course of the Receivership, the activity of the Company was limited to the liquidation of the Companys assets by the Receiver and the payment of the proceeds therefrom to the SBA and for the expenses of the Receivership.\nThe SBIC license granted to the Company by the SBA was revoked by the SBA effective March 20, 2017, in conjunction with the entry by the District Court of the Order Approving the Procedures for Winding Up and Terminating the Receivership Estate. On June 28, 2017, the Receivership was terminated pursuant to the entry of a Final Order by the District Court, further discharged all claims and obligations of the Company other than the judgment held by SBA (the Final Order). Prior to the Final Order, the Receiver provided notice to all shareholders of the Company. The Receiver also initiated separate contact with the largest shareholders of the Company in an attempt to identify a shareholder willing to assume responsibility for the control of the Company on behalf of the Companys shareholders. Roran Capital, LLC (Roran), was the only shareholder willing to assume such control. As such, at the direction of the Receiver, paragraph 4 of the Final Order specifically stated that Control of Waterside shall be unconditionally transferred and returned to its shareholders c/o Roran Capital, LLC (Roran) upon notification of entry of this Order. At that time Roran owned 510,000 shares of the Company which represented 2.7% of the issued and outstanding common stock at that time (and owns 42,476,660 shares currently which represents 64.05% of the issued and outstanding shares of the Company at this time). 99% of the equity interests in Roran were at the time, and remain, beneficially owned by Yitzhak Zelmanovitch. At the time of the Final Order, the Company had no assets, and a sole remaining liability owed to the SBA in an amount exceeding $10,000,000.\nUpon termination of the Receivership, Roran took possession of all books and records made available to it by the Receiver. The termination of the Receivership, and the termination of the power and authority of the Receiver, left the Company with no Board of Directors and no officers. It was impossible to convene a shareholders meeting as there were no corporate officers or directors to provide (i) notice, or (ii) the administrative oversight required for such a meeting. Roran, in reliance on and in compliance with the Final Order, sought to appoint a new board of directors (the New Board). Without a New Board, the Company would be unable to operate as a viable business, and appointment by Roran was the only manner in which the New Board could be constituted.\nRoran expended a good faith effort to seek out qualified third parties to serve on the New Board. Because of the liability exposure inherent in serving on the board of a public company, the Companys lack of financial resources, and the Companys loss of its SBIC license, Roran was unable to locate any qualified individuals to serve on the New Board and thus appointed Zindel Zelmanovitch, the father of Yitzhak Zelmanovitch, as the sole director and officer of the Company. Zindel is an experienced business person who has previously served as the CEO and director of a public company; thus, although related to the 99% owner of Roran, he has objectively acceptable qualifications to serve in this dual position. Zindel Zelmanovitch has never owned any shares of stock of the Company and has not been compensated for any of his services as a director or officer of the Company to date.\nIn his capacity as the sole director and officer of the Company, Zindel Zelmanovitch considered a variety of options for the Company, including bankruptcy and liquidation, neither of which would have yielded any economic benefit for the Companys shareholders. Thus, Zindel Zelmanovitch negotiated with Roran to provide a loan or loans to fund reasonable expenses of the Company, on arms length terms, so long as progress was being made to reorganize the Company and to identify either (i) a new business to enter into; or, (ii) an active business with which to merge or otherwise acquire, which would benefit from operating as a public entity. The New Board (Zindel Zelmanovitch) has continued to work toward achieving that goal. With no assets and no SBIC license from the SBA, no income, and liabilities in excess of $10,000,000 (which has now been forgiven in full, as stated below), the New Board (Zindel Zelmanovitch) concluded that continuing to operate as a registered investment company was impossible; furthermore, the consistent feedback from third parties with which the New Board has sought to consummate a transaction to commence a new business or acquire or merge a new business into the Company has been that until the Companys Application Pursuant to Section 8(f) of the Investment Company Act of 1940 for an order declaring that the Company has ceased to be an Investment Company is approved, no such transaction was feasible. On April 22, 2020, the SEC issued an order declaring that the Company had ceased to be an investment company.\nSince the entry of the Final Order (June 28, 2017) and the termination of the Receivership, the Company has been maintained for the benefit of its shareholders and pursuant to, and in compliance with, the Final Order. The Company has no assets, and the Company no longer has the SBIC license from the SBA. The Company is no longer operating as a registered investment company under the Investment Company Act. While it would have been possible for the Company to merely dissolve, the Company has instead decided to endeavor to reconstitute itself as a viable business. The Company has engaged and intends to continue to engage, qualified professionals and personnel to bring the Company current in its SEC filings and audits. The Company filed a Form 10-K for the period ending June 30, 2017 and has subsequently timely filed all periodic reports on Forms 10-Q and Forms 10-K.\nThe Companys outstanding judgment payable owed to the SBA was purchased by Roran from the SBA in July 2017. As such, all amounts due under the outstanding judgment payable were owed to Roran rather than the SBA. Upon purchase, the Company began to accrue interest that was due under the original terms of the judgment payable. The statutory interest rate was 0.094%. The Company accrued $163,991 in interest on the judgment payable as of March 31, 2019. On May 16, 2019, Roran forgave the entire principal amount and interest due thereon of $10,609,635.\nOn September 19, 2017, the Company issued a Convertible Promissory Note in an amount up to $150,000 in favor of Roran which was increased to $200,000 on June 17, 2019 and $250,000 on December 13, 2019 (the Note), and as of June 30, 2021, $149,838 has been drawn by the Company under the Note (exclusive of accrued interest). The Note was issued pursuant to a Convertible Loan Agreement with Roran (the Loan Agreement). All outstanding principal and accrued interest on the Note is due and payable on the maturity date, which was March 19, 2019 and then extended to September 19, 2019 and then June 19, 2020. Roran has agreed to extend the loan and advance additional funds until further negotiations regarding the loan have concluded. Amounts borrowed under the Note bear interest at 12% per annum. Roran has the right to convert all or any portion of the Note into shares of the Companys common stock at a conversion price equal to 60% of the 20 day trailing lowest share price. The use of proceeds of this loan has been and continues to be the payment by the Company of its reasonable operational expenses payable to third-party service providers (consisting solely of third party expenses such as legal, accounting, transfer agent and edgarization costs, all at the actual cost for such services). The loan is not a senior or a secured instrument.\nOn June 8, 2020, Roran converted $124,500 principal amount of its promissory note with the Company and $25,500 of accrued and unpaid interest thereon, totaling $150,000, into 41,666,660 shares of Company Common Stock at the stated conversion price per share of $0.0036. The remaining balance due on the promissory note, as of the conversion date, was $104,838 in principal and $19,988 in interest.\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran. Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644, which is comprised of convertible note payable - related party, accrued interest payable - related party, and advances from related party. The Buyer acquired 42,476,660 shares of the Companys Common Stock, representing 69.7% of the issued and outstanding shares of Common Stock. As such, the SPA resulted in a change of control of the Company.\nEffective November 29, 2021, the Company converted from a Virginia corporation to a Nevada corporation.\nOn December 15, 2021, the Company filed with the Nevada Secretary of State amended and restated articles of incorporation. The amended and restated articles had the effect of (i) increasing the Companys authorized common stock to 100 million shares, (ii) increasing the Companys authorized preferred stock to 20 million shares, and (iii) reducing the par value of each of the Companys common stock and preferred stock to $0.0001 per share. Common stock and additional paid-in capital for all periods presented in these financial statements have been adjusted retroactively to reflect the reduction in par value.\nOn December 17, 2021, the majority shareholder and board of directors approved an amendment to the amended and restated articles of incorporation that would change the Companys name from Waterside Capital Corporation to Metavesco, Inc. The name change was cleared by Financial Industry Regulatory Authority (FINRA) and was effective June 3, 2022.\nIn March 2022, the Company commenced operations as a web3 enterprise. The Company generates income as a liquidity provider, via decentralized exchanges such as Uniswap. Additionally, the Company farms tokens via Proof of Stake protocols on decentralized exchanges as well as centralized exchanges including Coinbase exchange. The Company also invests in promising NFT projects and virtual land, primarily on EVM protocols.\nOn June 12, 2023, the Company entered into a Limited Liability Company Interest Purchase Agreement (the Purchase Agreement) with Eddy Rodrigeuz (the Seller). The Seller is the sole owner of Boring Brew LLC (Boring) and Bored Coffee Lab, LLC (Bored). Under the terms of the Purchase Agreement, the Seller sold to the Company, all of the outstanding limited liability company interests in Boring and Bored. The Company paid the Seller total consideration with a fair value of $249,245, paid as follows: (i) $9,245 in cash and (ii) 5,000,000 shares of the Companys common stock at a fair value of $240,000 ($0.048 per share based on the closing price of the Company common stock on June 12, 2023).\nThe Company is currently authorized to issue twenty million (20,000,000) shares of preferred stock, with a par value of $0.0001 per share. There are twenty two (22) shares of Series A Convertible Preferred Stock issued. The Company is also authorized to issue one hundred million (100,000,000) shares of common stock, with a par value of $0.0001 per share. As of June 30, 2023, and currently, 66,322,140 shares of common stock of the Company were outstanding. These shares are quoted over the counter with Pink OTC Markets Inc. under the ticker symbol MVCO and are held by 25 shareholders of record as of September 30, 2023. The Company does not have any other equity securities outstanding.\nCurrent Business Strategy and Operations\nOn April 22, 2020, the SEC issued an order declaring that the Company had ceased to be an investment company. The Companys common stock continues to be quoted on the Pink OTC Markets for the benefit of its shareholders.\nOur Business\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran Capital, LLC (Roran). Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644 which is comprised of convertible note payable - related party, accrued interest payable - related party and advances from related party. The Buyer acquired 42,476,660 shares of the Companys Common Stock, representing 69.7% of the issued and outstanding shares of Common Stock. As such, the Schadel SPA resulted in a change of control of the Company.\nIn March 2022, the Company commenced operations as a web3 enterprise. The Company generates income as a liquidity provider, via decentralized exchanges such as Uniswap. Additionally, the Company farms tokens via Proof-of-Stake (PoS) protocols on decentralized exchanges, as well as centralized exchanges, including Coinbase. The Company also invests in non-fungible token (NFT) projects and virtual land that it believes are promising, primarily on EVM protocols.\nThe Company has three areas of focus:\n● Liquidity Provider - In decentralized finance (DeFi), the ability to trade assets from one to another is facilitated by Liquidity Pools (LPs) which generally contain a 50/50 balance between both underlying tokens. The Company expects to invest substantially in LPs to generate ongoing revenue. We expect that this revenue will fuel our other initiatives as we build the Company.\n● Staking - Like LPs, staking can provide potential passive revenue to the Company. Purchasing large blocks of lucrative PoS assets to grow the passive income portfolio is expected to be a major cornerstone to our success. This is a much greener approach to the traditional Proof of Work model, which is used by Bitcoin and Ethereum. Ethereum 2.0 is expected to be on PoS in the near future and our goal is to eventually become a validator on the network.\n● NFTs - The Company holds NFTs for capital appreciation and for potential income from IP licensing.\nOn August 29, 2022, the Company announced its plan to begin Bitcoin mining operations. Bitcoin mining has been part of the Company roadmap since entering the web3 space in March of 2022, although our plans have been accelerated with the recent decrease in the price of Bitcoin. Mining equipment has become much more affordable as overleveraged miners are forced to sell equipment at reduced prices.\nIn February 2023, the Company commenced bitcoin mining operations at a hosted facility in Texas.\nOn June 12, 2023, the Company entered into a Limited Liability Company Interest Purchase Agreement the (Purchase Agreement) with Eddy Rodrigeuz (the Seller). The Seller is the sole owner of Boring Brew LLC (Boring) and Bored Coffee Lab, LLC (Bored) and collectively known a Boring Brew. Under the terms of the Purchase Agreement, the Seller sold to the Company, all of the outstanding limited liability company interests in Boring and Bored for a total purchase price of $9,245 in cash and 5,000,000 shares of common stock of the Company. Boring Brew, a web3 startup known for its unique and limited edition coffee bags. Boring Brew partners with influential NFT holders to transform their intellectual property into an exquisite collection of specialty coffee.\nGovernment Regulations\nThe Company is no longer a registered investment company.\nThe Companys common stock is a penny stock, as defined in Rule 3a51-1 under the Exchange Act. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, the penny stock rules require that the broker-dealer, not otherwise exempt from such rules, must make a special written determination that the penny stock is suitable for the purchaser and receive the purchasers written agreement to the transaction. These disclosure rules have the effect of reducing the level of trading activity in the secondary market for a stock that becomes subject to the penny stock rules. So long as the Companys common stock is subject to the penny stock rules, it may be more difficult to sell our common stock.\nPatents, Trademarks, Franchises, Royalty Agreements or Labor Contracts\nWe have no current plans for any registrations such as patents, trademarks, copyrights, franchises, concessions, royalty agreements, or labor contracts. We will assess the need for any copyright, trademark, or patent applications on an ongoing basis.\nCompetition\nOur current and future competition includes other digital assets focused companies, such as Coinshares International Limited and private operators that are in the same business as us.\nMany of our current and potential competitors have greater resources and longer histories, and greater brand recognition. They may devote more resources to technology, infrastructure, marketing and may be able to more rapidly develop their solutions. Other companies also may enter into business combinations or alliances that strengthen their competitive positions. Our small team and relative lack of capital is a competitive disadvantage.\nEmployees\nThe Company currently has one employee, the sole officer and director of the Company. We generally work remotely and we anticipate as we hire additional staff they will also work remotely.\nAvailable Information\nThe Company expects to continue to file annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, proxy statements and other information with the SEC. Any materials filed by the Company with the SEC may be read and copied at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. Information on the operation of the SECs Public Reference Room is available by calling the SEC at 1-800-SEC-0330. The SEC maintains a website that contains annual, quarterly and current reports, proxy statements and other information that issuers (including the Company) file electronically with the SEC. The Internet address of the SECs website is http://www.sec.gov. At some point in the future, we intend to make our reports, amendments thereto, and other information available, free of charge, on a website for the Company. Our website can be found at www.metavesco.com.\nOur corporate offices are located at 410 Peachtree Pkwy, Suite 4245, Cummings, GA 30041. Our telephone number is 678-241-5898. ITEM 1A RISK FACTORS\nYou should carefully consider the risks described below, together with the other information set forth in this report, which could materially affect our business, financial condition, and future results. The risks described below are not the only risks facing our Company. Risks and uncertainties not currently known to us or that we currently deem to be immaterial also may materially adversely affect our business, financial condition, and operating results.\nRisks Related to Our Business\nOur holdings are controlled by one shareholder which owns approximately 70% of our issued and outstanding stock.\n70% of our issued and outstanding common stock is controlled by Mr. Schadel, our sole officer and director. As a result, Mr. Schadel can direct the affairs of the Company as the majority shareholder and there is no assurance that any decisions made through a shareholder vote will be the same decisions that one or more minority shareholders would make.\nThe Company has a limited operating history.\nThe Company has a limited history of operations and is in the early stage of development. As such, the Company will be subject to many risks common to such enterprises, including undercapitalization, cash shortages, limitations with respect to personnel, financial and other resources and lack of revenues. There is no assurance that the Company will be successful in achieving a return on shareholders investment and the likelihood of success must be considered in light of its early stage of operations. There can be no assurance that the Company will be able to develop any of its projects profitably or that any of its activities will generate positive cash flow.\nThe Companys compliance and risk management programs may not be effective.\nThe Companys ability to comply with applicable laws and rules will be largely dependent on the establishment and maintenance of compliance, review and reporting systems, as well as the ability to attract and retain qualified compliance and other risk management personnel. The Company cannot provide any assurance that its compliance policies and procedures will always be effective or that the Company will be successful in monitoring or evaluating its risks. In the case of alleged non-compliance with applicable laws or regulations, the Company could be subject to investigations and judicial or administrative proceedings that may result in substantial penalties or civil lawsuits, including by customers, for damages, restitution or other remedies, which could be significant. Any of these outcomes, individually or together, may among other things, materially and adversely affect the Companys reputation, financial condition, investment and trading strategies, and asset value and the value of any investment in the Companys common stock.\nThe Company may require additional funds to finance its operations.\nAdditional funds, raised through debt or equity offerings, may be needed to finance the Companys future activities. There can be no assurance that the Company will be able to obtain adequate financing in the future or that the terms of such financing will be favorable. Failure to obtain such additional financing could cause the Company to reduce or terminate its operations.\nIf additional funds are raised through further issuances of equity or securities convertible into equity, existing shareholders could suffer significant dilution, and any new equity securities issued could have rights, preferences and privileges superior to those of holders of the Companys common stock. Any debt financing secured in the future could involve restrictive covenants relating to capital raising activities and other financial and operational matters, which may make it more difficult for the Company to obtain additional capital and to pursue business opportunities.\nMarket adoption of digital assets has been limited to date and further adoption is uncertain.\nCurrently, there is relatively small use of digital assets in the retail and commercial marketplace in comparison to relatively large use by speculators, thus contributing to price volatility that could adversely affect an investment in the Companys common stock. Digital assets have only recently become accepted as a means of payment for goods and services by certain major retail and commercial outlets and use of digital assets by consumers to pay such retail and commercial outlets remains limited. Conversely, a significant portion of digital asset demand is generated by speculators and investors seeking to profit from the short- or long-term holding of tokens. A lack of expansion by digital assets into the retail and commercial markets, or a contraction of such use, may result in increased volatility or a reduction in the market price of these assets. Further, if fees increase for recording transactions on these blockchains, demand for digital assets may be reduced and prevent the expansion of the networks to retail merchants and commercial businesses, resulting in a reduction in the price of these assets.\nThe value of digital assets may be subject to momentum pricing risk.\nMomentum pricing typically is associated with growth stocks and other assets whose valuation, as determined by the investing public, accounts for anticipated future appreciation in value. Market prices of digital assets are determined primarily using data from various exchanges, over-the-counter markets, and derivative platforms. Momentum pricing may have resulted, and may continue to result, in speculation regarding future appreciation in the value of digital assets, inflating and making their market prices more volatile. As a result, they may be more likely to fluctuate in value due to changing investor confidence in future appreciation (or depreciation) in their market prices, which could adversely affect the value of the Companys digital asset holdings and the value of the Companys common stock.\nA decline in the adoption and use of digital assets could materially and adversely affect the performance of the Company.\nBecause digital assets are a relatively new asset class and a technological innovation, they are subject to a high degree of uncertainty. As a related but separate issue from that of the regulatory environment, the adoption, growth and longevity of any digital asset will require growth in its usage and in the blockchain for various applications. A lack of expansion in use of digital assets and blockchain technologies would adversely affect the financial performance of the Company. In addition, there is no assurance that any digital assets will maintain their value over the long term. Even if growth in the use of any digital assets occurs in the near or medium term, there is no assurance that such use will continue to grow over the long term. A lack of expansion of digital assets into the retail and commercial markets, may result in increased volatility or a reduction in the market price of these assets. Further, if fees increase for recording transactions on these blockchains, demand for digital assets may be reduced and prevent the expansion of the networks to retail merchants and commercial businesses, resulting in a reduction in the price of these assets. A contraction in use of any digital asset may result in increased volatility or a reduction in prices, which could materially and adversely affect the Companys investment and trading strategies, the value of its assets and the value of any investment in the Companys common stock.\nWe may invest or spend our cash in ways with which you may not agree or in ways which may not yield a significant return.\nMr. Schadel, our sole officer and director and a significant stockholder, has considerable discretion in the use of our cash. Our cash may be used for purposes that do not increase our operating results or market value. Until the cash is used, it may be placed in investments that do not produce significant income or that may lose value. The failure of our management to invest or spend our cash effectively could result in unfavorable returns and uncertainty about our prospects, each of which could cause the price of our common stock to decline.\nOur digital assets may be subject to concentration risk.\nConcentration risk is the risk of amplified losses that may occur from having a large portion of our holdings in digital assets. Digital assets returns may be highly corelated and may also be Illiquid. Investments within the same industry, geographic region or security type tend to be highly correlated, meaning that what happens to one investment is likely to happen to the others. Digital assets may also be difficult to sell off quickly. Should we need quick access to cash and are heavily invested in illiquid securities, we may not be able to tap this money in a timely or cost-efficient manner.\nRisks Related to our Operations\nCyber-attacks, data breaches or malware may disrupt our operations and trigger significant liability for us, which could harm our operating results and financial condition, and damage our reputation or otherwise materially harm our business.\nAs a publicly traded company, we may experience cyber-attacks and other attempts to gain unauthorized access to our systems on a regular basis. There is a risk that some or all of our cryptocurrencies could be lost or stolen as a result of one or more of these incursions. As we increase in size, we may become a more appealing target of hackers, malware, cyber-attacks or other security threats, and, despite our implementation of strict security measures and it is impossible to eliminate all such vulnerability. For instance, we may not be able to ensure the adequacy of the security measures employed by third parties, such as our service providers. Efforts to limit the ability of malicious actors to disrupt the operations of the internet or undermine our own security efforts may be costly to implement and may not be successful. Such breaches, whether attributable to a vulnerability in our systems or otherwise, could result in claims of liability against us, damage our reputation and materially harm our business.\nWe have not to date experienced a material cyber-event; however, the occurrence of any such event in the future could subject us to liability give rise to legal and/or regulatory action, which could damage our reputation or otherwise materially harm our business, operating results, and financial condition.\nIncorrect or fraudulent digital assets transactions may be irreversible and we could lose access to our digital assets.\nDigital asset transactions are not, from an administrative perspective, reversible without the consent and active participation of the recipient of the digital assets from the transaction. Because of the decentralized nature of the blockchain, once a transaction has been verified and recorded in a block that is added to the blockchain, an incorrect transfer of a digital or a theft thereof generally will not be reversible, and we may not have sufficient recourse to recover our losses from any such transfer or theft. It is possible that, through computer or human error, or through theft or criminal action, our rewards or fees could be transferred in incorrect amounts or to unauthorized third parties, or to uncontrolled accounts. Though recent high profile enforcement actions against individuals laundering stolen digital assets have demonstrated some means of bringing malicious actors to justice for their theft, the stolen digital assets is likely to remain unrecoverable. Furthermore, we must possess both the unique public and private keys to our digital wallets to gain access to our digital assets and the loss of a private key required may be irreversible. Therefore, if we lose, or if a malicious actor successfully denies us access to our private keys, we may be permanently denied access to the digital assets held in the wallet corresponding to the lost, stolen or blocked keys. Though we have taken and continue to take reasonable steps to secure our private keys. if we were to lose access to our private keys or otherwise experience data loss relating to our digital wallets, we could effectively lose access to and the ability to use our digital assets. Moreover, we may be unable to secure insurance policies for our digital assets at rates or on terms acceptable to us, if at all. To the extent that we are unable to recover our losses from such action, error or theft, such events could have a material adverse effect on our business, results of operations and financial condition.\nOur business could be harmed by prolonged power and internet outages, shortages, or capacity constraints.\nOur operations require access to high-speed internet to be successful. If we lose internet access for a prolonged period, we may be required to reduce our operations or cease them altogether. If this occurs, our business and results of operations may be materially and adversely affected.\nRisks Related to Governmental Regulation and Enforcement\nA particular digital assets status as a security in any relevant jurisdiction is subject to a high degree of uncertainty, and if we are unable to correctly characterize a digital asset, we may be subject to regulatory scrutiny, investigations, fines, sanctions, penalties and other adverse consequences, including potentially becoming subject to the Investment Company Act of 1940 which would impose significant regulatory burdens and compliance costs.\nThe SEC and its staff have taken the position that certain digital assets fall within the definition of a security under the U.S. federal securities laws. The legal test for determining whether any given digital asset is a security is a highly complex, fact-driven analysis that evolves over time, and the outcome is difficult to predict. The SEC generally does not provide advance guidance or confirmation on the status of any particular digital asset as a security. Furthermore, the SECs views in this area have evolved over time and it is difficult to predict the direction or timing of any continuing evolution. It is also possible that a change in the governing administration or the appointment of new SEC commissioners could substantially impact the views of the SEC and its staff. Public statements by senior officials at the SEC indicate that the SEC does not intend to take the position that Bitcoin or Ethereum are securities (in their current form). Bitcoin and Ethereum are the only digital assets as to which senior officials at the SEC have publicly expressed such a view. Moreover, such statements are not official policy statements by the SEC and reflect only the speakers views, which are not binding on the SEC or any other agency or court and cannot be generalized to any other digital asset. With respect to all other digital assets, there is currently no certainty under the applicable legal test that such assets are not securities, notwithstanding the conclusions we may draw based on our risk-based assessment regarding the likelihood that a particular digital asset could be deemed a security under applicable laws. Similarly, though the SECs Strategic Hub for Innovation and Financial Technology published a framework for analyzing whether any given digital asset is a security in April 2019, this framework is also not a rule, regulation or statement of the SEC and is not binding on the SEC.\nThe classification of a digital asset as a security under applicable law has wide-ranging implications for the regulatory obligations that flow from the offer, sale, trading, and clearing of such assets. For example, a digital asset that is a security in the U.S. may generally only be offered or sold in the U.S. pursuant to a registration statement filed with the SEC or in an offering that qualifies for an exemption from registration. Persons that effect transactions in digital assets that are securities in the U.S. may be subject to registration with the SEC as a broker or dealer. Platforms that bring together purchasers and sellers to trade digital assets that are securities in the U.S. are generally subject to registration as national securities exchanges, or must qualify for an exemption, such as by being operated by a registered broker-dealer as an alternative trading system, or ATS, in compliance with rules for ATSs. Persons facilitating clearing and settlement of securities may be subject to registration with the SEC as a clearing agency. Foreign jurisdictions may have similar licensing, registration, and qualification requirements.\nWhile we do not currently, nor do we plan to, offer, sell, trade, and clear digital assets or take custody of others digital assets as part of any potential Staking-as-a-Service operations we may undertake, however, digital assets we stake and validate transactions for could be deemed to be a security under applicable laws. Our blockchain infrastructure operations which entails securing blockchains by processing and validating blockchain transactions (most analogous to Bitcoin mining or operating a Bitcoin mining pool) could be construed as facilitating transactions in digital assets; as such we could be subject to legal or regulatory action in the event the SEC, a foreign regulatory authority, or a court were to determine that a blockchain we secure is a security under applicable laws. Because our platform is not registered or licensed with the SEC or foreign authorities as a broker-dealer, national securities exchange, or ATS (or foreign equivalents), and we do not seek to register or rely on an exemption from such registration or license to secure blockchains.\nFurther, if any digital asset is deemed to be a security under any U.S. federal, state, or foreign jurisdiction, or in a proceeding in a court of law or otherwise, it may have adverse consequences for such digital asset. For instance, the networks on which such digital assets are utilized may be required to be regulated as securities intermediaries, and subject to applicable rules, which could effectively render the network impracticable for its existing purposes. Further, it could draw negative publicity and a decline in the general acceptance of the digital asset. Also, such a development may make it difficult for such supported digital asset to be traded, cleared, and custodied as compared to other digital asset that are not considered to be securities.\nRegulatory changes or actions may alter the nature of an investment in us or restrict the use of digital assets in a manner that adversely affects our business, prospects, or operations.\nAs digital assets have grown in both popularity and market size, governments around the world have reacted differently to digital assets; certain governments have deemed them illegal, and others have allowed their use and trade without restriction, while in some jurisdictions, such as in the U.S., subject the mining, ownership and exchange of digital assets to extensive, and in some cases overlapping, unclear and evolving regulatory requirements. Ongoing and future regulatory actions could have a material adverse effect on our business, prospects or operations.\nOur interactions with a blockchain may expose us to SDN or blocked persons and new legislation or regulation could adversely impact our business or the market for cryptocurrencies.\nThe Office of Financial Assets Control (OFAC) of the U.S. Department of Treasury requires us to comply with its sanction program and not conduct business with persons named on its specially designated nationals (SDN) list. However, because of the pseudonymous nature of blockchain transactions we may inadvertently and without our knowledge engage in transactions with persons named on OFACs SDN list. Our Companys policy prohibits any transactions with such SDN individuals, but we may not be adequately capable of determining the ultimate identity of the individual with whom we transact with respect to selling cryptocurrency assets. Moreover, the use of cryptocurrencies, including Bitcoin, as a potential means of avoiding federally-imposed sanctions, such as those imposed in connection with the Russian invasion of Ukraine. For example, on March 2, 2022, a group of United States Senators sent the Secretary of the United States Treasury Department a letter asking Secretary Yellen to investigate its ability to enforce such sanctions vis-à-vis Bitcoin, and on March 8, 2022, President Biden announced an executive order on cryptocurrencies which seeks to establish a unified federal regulatory regime for cryptocurrencies. We are unable to predict the nature or extent of new and proposed legislation and regulation affecting the cryptocurrency industry, or the potential impact of the use of cryptocurrencies by SDN or other blocked or sanctioned persons, which could have material adverse effects on our business and our industry more broadly. Further, we may be subject to investigation, administrative or court proceedings, and civil or criminal monetary fines and penalties as a result of any regulatory enforcement actions, all of which could harm our reputation and affect the value of our common stock.\nDigital assets may be made illegal in certain jurisdictions which could adversely affect our business prospects and operations.\nAlthough we do not anticipate any material adverse regulations on digital assets in our jurisdictions of operation, it is possible that state or federal regulators may seek to impose harsh restrictions or total bans on digital assets which may make it impossible for us to do business. Further, although digital assets in general are largely unregulated in most countries (including the United States), regulators in certain jurisdictions may undertake new or intensify existing regulatory actions in the future that could severely restrict the right to mine, acquire, own, hold, sell, or use digital assets or to exchange it for traditional fiat currency such as the United States Dollar. Such restrictions may adversely affect us as the large-scale use of digital assets as a means of exchange is presently confined to certain regions globally. Such circumstances could have a material adverse effect on us, which could have a material adverse effect on our business, prospects or operations and potentially the value of digital assets we acquire and thus harm investors.\nThe Company will have to adapt to respond to evolving security risks.\nAs technological change occurs, the security threats to the Companys digital assets will likely adapt, and previously unknown threats may emerge. The ability of the Company and Coinbase to adopt technology in response to changing security needs or trends may pose a challenge to the safekeeping of their assets. To the extent that the Company or Coinbase is unable to identify and mitigate or stop new security threats, The Companys assets may be subject to theft, loss, destruction or other attack.\nThe majority of the Companys digital assets are held in Self Custody (Non-Custodial) wallets. The Company holds the majority of its digital assets in Self Custody (Non-Custodial) wallets. These wallets are used to interact with Decentralized Exchanges and other DeFi focused protocols. Mr. Schadel, our sole officer and director and our majority stockholder, is currently the holder of the private keys that provide access to these wallets.\nAdditionally, the Company from time to time holds assets at Coinbase, a SOC 1/ SOC 2 certified digital asset custodian. If Coinbase were to be subject to a malicious attack or otherwise cease its operations, the Company will be at risk of losing the majority of its digital assets. There is no assurance that Coinbase will not be subject to any such attack and there is no guarantee that Coinbase wont cease its operations.\nBanks may not provide banking services, or may cut off banking services, to businesses that provide digital asset-related services.\nA number of companies that provide digital asset-related services have been unable to find banks that are willing to provide them with bank accounts and banking services. Similarly, a number of such companies have had their existing bank accounts closed by their banks. Banks may refuse to provide bank accounts and other banking services to digital asset-related companies, or companies that accept digital assets, for a number of reasons, such as perceived compliance risks or costs. The difficulty that many businesses that provide digital asset-related services have and may continue to have in finding banks willing to provide them with bank accounts and other banking services may decrease the usefulness of digital assets as a payment system and harm public perception of digital assets. Similarly, the usefulness of digital assets as a payment system and the public perception of digital assets could be damaged if banks were to close the accounts of many or of a few key businesses providing digital asset-related services. This could decrease the market prices of digital assets, and adversely affect the value of the Companys digital asset holdings and the Companys common stock.\nThe Companys business is exposed to the potential misuse of digital assets and malicious actors.\nSince the existence of digital assets, there have been attempts to use them for speculation or malicious purposes. Although lawmakers increasingly regulate the use and applications of digital assets, and software is being developed to curtail speculative and malicious activities, there can be no assurances that those measures will sufficiently deter those and other illicit activities in the future. Advances in technology, such as quantum computing, could lead to a malicious actor or botnet (a voluntary or hacked collection of computers controlled by networked software coordinating the actions of the computers) being able to alter the blockchain on which digital asset transactions rely. In such circumstances, the malicious actor or botnet could control, exclude or modify the ordering of transactions, or generate new digital assets or transactions using such control. The malicious actor or botnet could double spend its own digital assets and prevent the confirmation of other users transactions for so long as it maintains control. Such changes could adversely affect an investment in the Companys common stock.\nThe security procedures and operational infrastructure of the Company and Coinbase may be breached due to the actions of outside parties, error or malfeasance of an employee of the Company or Coinbase, or otherwise, and, as a result, an unauthorized party may obtain access to the Companys digital asset accounts, private keys, data or tokens. Additionally, outside parties may attempt to fraudulently induce employees of the Company or Coinbase to disclose sensitive information in order to gain access to the infrastructure of the Company or Coinbase. As the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently, or may be designed to remain dormant until a predetermined event, and often are not recognized until launched against a target, The Company may be unable to anticipate these techniques or implement adequate preventative measures. If an actual or perceived breach of the Companys digital assets account occurs, the market perception of the effectiveness of its security protocols could be harmed and the value of the Companys common stock could be materially adversely affected.\nThe Companys use of proprietary and non-proprietary software, data and intellectual property may be subject to substantial risk.\nThe Companys token selection strategy may rely heavily on the use of proprietary and non-proprietary software, data and intellectual property of third parties in the digital asset sector. The reliance on this technology and data is subject to a number of important risks. For example, the operation of any element of the digital assets network, or any other electronic platform, may be severely and adversely affected by the malfunction of technology. For example, an unforeseen software or hardware malfunction could occur as a result of a virus or other outside force, or as result of a design flaw in the design and operation of the network or platform. In addition, the underlying technology of the tokens themselves, may be inactive for periods of time, known as downtime and could have serious adverse effects on our business.\nRisks Related to Ownership of Our Common Stock\nNevada law contains provisions that could discourage, delay or prevent a change in control of our company, prevent attempts to replace or remove current management and reduce the market price of our stock.\nCertain provisions of Nevada law described below may make us a less attractive candidate for acquisition, which may adversely impact the value of the shares of our capital stock held by our stockholders. We have not opted out of these provisions in our Bylaws, as permitted under the Nevada Revised Statutes.\nNevada Revised Statutes Sections 78.411 through 78.444 (the Nevada Combinations Statute) generally prohibit combinations including mergers, consolidations, sales and leases of assets, issuances of securities and similar transactions by a Nevada corporation having a requisite number of stockholders of record (of which we are one) with any person who beneficially owns (or any affiliate or associate of the corporation who within the previous two years owned), directly or indirectly, 10% or more of the voting power of the outstanding voting shares of the corporation (an interested stockholder), within two years after such person first became an interested stockholder unless (i) the board of directors of the corporation approved the combination or transaction by which the person first became an interested stockholder before the person first became an interested stockholder or (ii) the board of directors of the corporation has approved the combination in question and, at or after that time, such combination is approved at an annual or special meeting of the stockholders of the target corporation, and not by written consent, by the affirmative vote of holders of stock representing at least 60% of the outstanding voting power of the target corporation not beneficially owned by the interested stockholder or the affiliates or associates of the interested stockholder.\nTwo years after the date the person first became an interested stockholder, the Nevada Combinations Statute prohibits any combination with that interested stockholder unless (i) the board of directors of the corporation approved the combination or transaction by which the person first became an interested stockholder before the person first became an interested stockholder or (ii) such combination is approved by a majority of the outstanding voting power of the corporation not beneficially owned by the interested stockholder or any affiliate or associate of the interested stockholder. The Nevada Combinations Statute does not apply to combinations with an interested stockholder after the expiration of four years from when the person first became an interested stockholder.\nBecause there has been limited precedent set for financial accounting of digital assets, the determination that we have made for how to account for digital assets transactions may be subject to change.\nBecause there has been limited precedent set for the financial accounting of cryptocurrencies and related revenue recognition and no official guidance has yet been provided by the FASB or the SEC, it is unclear how companies may in the future be required to account for cryptocurrency transactions and assets and related revenue recognition. A change in regulatory or financial accounting standards could result in the necessity to change our accounting methods and restate our financial statements. Such a restatement could adversely affect the accounting for our newly mined cryptocurrency rewards and more generally negatively impact our business, prospects, financial condition and results of operations. Such circumstances would have a material adverse effect on our ability to continue as a going concern or to pursue our new strategy at all, which would have a material adverse effect on our business, prospects or operations as well as and potentially the value of any cryptocurrencies we hold or expects to acquire for our own account and harm investors.\nWe have identified material weaknesses in our internal control over financial reporting and may identify additional material weaknesses in the future or otherwise fail to maintain an effective system of internal controls, which may result in material misstatements of our financial statements or cause us to fail to meet our periodic reporting obligations.\nWe are required to comply with certain provisions of Section 404 of the Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley Act). Section 404 requires that we document and test our internal control over financial reporting and issue managements assessment of our internal control over financial reporting. Management assessed the effectiveness of our internal control over financial reporting as of June 30, 2023. In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (2013). A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis. Based on our assessment, as of June 30, 2023, we concluded that our internal control over financial reporting contained material weaknesses. To remediate these material weaknesses, our management has been implementing and continues to implement measures designed to ensure that control deficiencies contributing to the material weakness are remediated, such that these controls are designed, implemented, and operating effectively.\nWe believe that these actions will remediate the material weakness. However, the remediation cannot be deemed successful until the applicable controls operate for a sufficient period of time and our management has concluded, through testing, that these controls are operating effectively. If we fail to comply with the requirements of Section 404 of the Sarbanes-Oxley Act, the accuracy and timeliness of the filing of our annual and quarterly reports may be materially adversely affected and could cause investors to lose confidence in our reported financial information, which could have a negative effect on the trading price of our common stock. In addition, a material weakness in the effectiveness of our internal control over financial reporting could result in an increased chance of fraud and the loss of customers, reduce our ability to obtain financing and require additional expenditures to comply with these requirements, each of which could have a material adverse effect on our business, results of operations and financial condition.\nSubstantial sales of our common stock may impact the market price of our common stock.\nFuture sales of substantial amounts of our common stock, including shares that we may issue upon exercise of options and warrants could adversely affect the market price of our common stock. Furthermore, if we raise additional funds through the issuance of common stock or securities convertible into our common stock, the percentage ownership of our shareholders will be reduced, and the price of our common stock may fall. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.\nITEM 1C. CYBERSECURITY\nNot applicable. ITEM 2. PROPERTIES\nWe do not currently own any property. We rent office space month to month from Regus for $281 per month. We generally work remotely and we anticipate as we hire additional staff they will also work remotely. As of September 30 2023, we believe that our properties are suitable and adequate to meet our anticipated needs. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may be involved in routine legal proceedings, as well as demands, claims and threatened litigation that arise in the normal course of our business. The ultimate amount of liability, if any, for any claims of any type (either alone or in the aggregate) may materially and adversely affect our financial condition, results of operations and liquidity. In addition, the ultimate outcome of any litigation is uncertain. Any outcome (including any for the actions described above), whether favorable or unfavorable, may materially and adversely affect us due to legal costs and expenses, diversion of management attention and other factors. We expense legal costs in the period incurred. We cannot assure you that additional contingencies of a legal nature or contingencies having legal aspects will not be asserted against us in the future, and these matters could relate to prior, current or future transactions or events.\nWe are not currently a party to any other material legal proceedings. We are not aware of any pending or threatened litigation against us that in our view would have a material adverse effect on our business, financial condition, liquidity, or operating results. However, legal claims are inherently uncertain, and we cannot assure you that we will not be adversely affected in the future by legal proceedings. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY; RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nInformation About Our Common Stock\nOur shares are quoted on the OTC Pink under the symbol MVCO. The OTC Market is a network of security dealers who buy and sell stock. The dealers are connected by a computer network that provides information on current bids and asks, as well as volume information. The trading of securities on the OTC Pink is often sporadic and investors may have difficulty buying and selling our shares or obtaining market quotations for them, which may have a negative effect on the market price of our common stock.\nThe following table sets forth, for the periods indicated the high and low bid quotations for our common stock. These quotations represent inter-dealer quotations, without adjustment for retail markup, markdown, or commission and may not represent actual transactions.\nHigh Low\nFiscal Year 2023\nApril 1 to June 30, 2023 $ 0.098 $ 0.098\nJanuary 1, 2023 to March 31, 2023 0.051 0.036\nOctober 1 to December 31, 2022 0.082 0.025\nJuly 1 to September 30, 2022 0.114 0.025\nFiscal Year 2022\nApril 1 to June 30, 2022 $ 0.159 $ 0.070\nJanuary 1, 2022 to March 31, 2022 0.170 0.098\nOctober 1 to December 31, 2021 0.170 0.037\nJuly 1 to September 30, 2021 0.090 0.017\nOn September 30, 2023, the closing price of our common stock was $0.053.\nPenny Stock Rules\nThe Securities and Exchange Commission has also adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00 (other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system).\nA purchaser is purchasing penny stock, which limits the ability to sell the stock. Our shares constitute penny stock under the Securities and Exchange Act. The shares will remain penny stocks for the foreseeable future. The classification of penny stock makes it more difficult for a broker-dealer to sell the stock into a secondary market, which makes it more difficult for a purchaser to liquidate his/her investment. Any broker-dealer engaged by the purchaser for the purpose of selling his or her shares in us will be subject to Rules 15g-1 through 15g-10 of the Securities and Exchange Act. Rather than creating a need to comply with those rules, some broker-dealers will refuse to attempt to sell penny stock.\nThe penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from those rules, to deliver a standardized risk disclosure document, which:\n● contains a description of the nature and level of risk in the market for penny stock in both public offerings and secondary trading;\n● contains a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to a violation of such duties or other requirements of the Securities Act of 1934, as amended;\n● contains a brief, clear, narrative description of a dealer market, including bid and ask price for the penny stock and the significance of the spread between the bid and ask price;\n● contains a toll-free telephone number for inquiries on disciplinary actions;\n● defines significant terms in the disclosure document or the conduct of trading penny stocks; and\n● contains such other information and is in such form (including language, type, size, and format) as the SEC shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, to the customer:\n● the bid and offer quotations for the penny stock;\n● the compensation of the broker-dealer and its salesperson in the transaction;\n● the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and\n● monthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules; the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitability statement. These disclosure requirements will have the effect of reducing the trading activity in the secondary market for our stock because it will be subject to these penny stock rules. Therefore, shareholders may have difficulty selling their securities.\nReports\nWe will furnish annual financial statements to our shareholders, audited by our independent registered public accounting firm, and will furnish un-audited quarterly financial statements in our quarterly reports filed electronically with the SEC. All financial statements and information filed by us can be found at the SEC website, www.sec.gov.\nTransfer Agent\nThe Company has retained Computershare Investor Services Inc., 1500 Robert-Bourassa Blvd., 7th Floor, Montreal, Quebec, H3A 3S8, as its transfer agent.\nNumber of Equity Security Holders\nAs of September 30, 2023, we had 25 holders of record of our common stock. This does not include beneficial owners holding common stock in street name. As such, the number of beneficial holders of our shares could be substantially larger than the number of shareholders of record.\nDividend Policy\nWe have no current plans to pay dividends. We currently anticipate that we will retain all of our future earnings, if any, for use in the development and expansion of our business and for general corporate purposes. Any determination to pay dividends in the future will be at the discretion of our Board and will depend upon our results of operations, financial condition, and other factors that the Board, in its discretion, may deem relevant. There are no restrictions, other than applicable law, on the ability of the Board to declare and pay dividends.\nRecent Sales of Unregistered Securities\nNone.\nRepurchase of Equity Securities\nNone.\nInformation About Our Equity Compensation Plans\nThe information required under this heading is incorporated herein by reference to the applicable information set forth in Item 12 of this Annual Report on Form 10-K. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of the results of operations and financial condition for the fiscal years ended June 30, 2023, and 2022 should be read in conjunction with our financial statements, and the notes to those financial statements that are included elsewhere in this Annual Report.\nAll references to Metavesco, we, our, us and the Company in this Item 7 refer to Metavesco, Inc.\nThe discussion in this section contains forward-looking statements. These statements relate to future events or our future financial performance. We have attempted to identify forward-looking statements by terminology such as anticipate, believe, can, continue, could, estimate, expect, intend, may, plan, potential, predict, should, would or will or the negative of these terms or other comparable terminology, but their absence does not mean that a statement is not forward-looking. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors, which could cause our actual results to differ from those projected in any forward-looking statements we make. Several risks and uncertainties we face are discussed in more detail under Risk Factors in Part I, Item 1A of this Annual Report, or in the discussion and analysis below. You should, however, understand that it is not possible to predict or identify all risks and uncertainties, and you should not consider the risks and uncertainties identified by us to be a complete set of all potential risks or uncertainties that could materially affect us. You should not place undue reliance on the forward-looking statements we make herein because some or all of them may turn out to be wrong. We undertake no obligation to update any of the forward-looking statements contained herein to reflect future events and developments, except as required by law. The following discussion should be read in conjunction with the financial statements, and the notes to those statements included elsewhere in this Annual Report on Form 10-K.\nOverview & Management Plans\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran Capital, LLC (Roran). Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644 which is comprised of convertible note payable - related party, accrued interest payable - related party and advances from related party. The Buyer acquired 42,476,660 shares of the Companys Common Stock, representing 69.7% of the issued and outstanding shares of Common Stock. As such, the Schadel SPA resulted in a change of control of the Company.\nIn March 2022, the Company commenced operations as a web3 enterprise. The Company generates income as a liquidity provider, via decentralized exchanges such as Uniswap. Additionally, the Company farms tokens via Proof-of-Stake (PoS) protocols on decentralized exchanges, as well as centralized exchanges, including Coinbase. The Company also invests in non-fungible token (NFT) projects and virtual land that it believes are promising, primarily on EVM protocols.\nThe Company has three areas of focus:\n● Liquidity Provider - In decentralized finance (DeFi), the ability to trade assets from one to another is facilitated by Liquidity Pools (LPs) which generally contain a 50/50 balance between both underlying tokens. The Company expects to invest substantially in LPs to generate ongoing revenue. We expect that this revenue will fuel our other initiatives as we build the Company.\n● Staking - Like LPs, staking can provide potential passive revenue to the Company. Purchasing large blocks of lucrative PoS assets to grow the passive income portfolio is expected to be a major cornerstone to our success. This is a much greener approach to the traditional Proof of Work model, which is used by Bitcoin and Ethereum. Ethereum 2.0 is expected to be on PoS in the near future and our goal is to eventually become a validator on the network.\n● NFTs - The Company holds NFTs for capital appreciation and for potential income from IP licensing.\nOn August 29, 2022, the Company announced its plan to begin Bitcoin mining operations. Bitcoin mining has been part of the Company roadmap since entering the web3 space in March of 2022, although our plans have been accelerated with the recent decrease in the price of Bitcoin. Mining equipment has become much more affordable as overleveraged miners are forced to sell equipment at reduced prices.\nIn February 2023, the Company commenced bitcoin mining operations at a hosted facility in Texas.\nOn June 12, 2023, the Company entered into a Limited Liability Company Interest Purchase Agreement the (Purchase Agreement) with Eddy Rodrigeuz (the Seller). The Seller is the sole owner of Boring Brew LLC (Boring) and Bored Coffee Lab, LLC (Bored) and collectively known a Boring Brew. Under the terms of the Purchase Agreement, the Seller sold to the Company, all of the outstanding limited liability company interests in Boring and Bored for a total purchase price of $9,245 in cash and 5,000,000 shares of common stock of the Company. Boring Brew, a web3 startup known for its unique and limited edition coffee bags. Boring Brew partners with influential NFT holders to transform their intellectual property into an exquisite collection of specialty coffee.\nCritical Accounting Policies\nCritical Accounting Policies and Significant Judgments and Estimates\nOur managements discussion and analysis of our financial condition and results of operations are based on our consolidated financial statements which we have been prepared in accordance with the U.S. generally accepted accounting principles (GAAP). In preparing our consolidated financial statements, we are required to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting periods.\nCritical accounting estimates are estimates for which (a) the nature of the estimate is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change and (b) the impact of the estimate on financial condition or operating performance is material. These significant accounting estimates or assumptions bear the risk of change due to the fact that there are uncertainties attached to these estimates or assumptions, and certain estimates or assumptions are difficult to measure or value.\nManagement bases its estimates on historical experience and on various assumptions that are believed to be reasonable in relation to the consolidated financial statements taken as a whole under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Management regularly evaluates the key factors and assumptions used to develop the estimates utilizing currently available information, changes in facts and circumstances, historical experience and reasonable assumptions. After such evaluations, if deemed appropriate, those estimates are adjusted accordingly.\nActual results could differ from those estimates.\nWhile our significant accounting policies are described in more detail in Note 2 to our consolidated financial statements included in this Annual Report, we believe the following accounting policies to be critical to the judgments and estimates used in the preparation of our consolidated financial statements:\nDigital Assets\nDigital assets held by the Company are accounted for as intangible assets with indefinite useful lives, and are initially measured at cost. The Company assigns costs to transactions on a first-in, first-out basis (FIFO).\nAn intangible asset with an indefinite useful life is not amortized but assessed for impairment annually, or more frequently, when events or changes in circumstances occur indicating that it is more likely than not that the indefinite-lived asset is impaired. Impairment exists when the carrying amount exceeds its fair value, which is measured using the quoted price of the digital assets at the time its fair value is being measured.\nTokens are subject to impairment losses if the fair value of a token decreases below the carrying value at any time during the period. The fair value is measured using the quoted price in the principal market of the tokens. The Company currently obtains the quoted price of tokens from www.cryptocompare.com.\nLiquidity pool tokens and NFTs are subject to impairment losses if the fair value a token decreases below the carrying value at the end of each quarterly accounting period. The fair value of liquidity pool tokens is based on the quoted price on the last day of the quarter at 4PM Eastern Time. The fair value of NFTs is based on the average trading price on the last day of each quarter.\nImpairment for liquidity pool tokens and NFTs is assessed quarterly due to each token being a unique asset and due to the illiquid markets in which these tokens trade. The Company is continuously reviewing available markets and information and its methodology when determining the fair value of digital assets.\nThe Company currently reviews quoted prices of its liquidity pool tokens, NFTs and comparable tokens at https://uniswap.org/ and https://opensea.io. Impairment expense is reflected in total expense in the consolidated statements of operations. Subsequent reversal of impairment losses is not permitted.\nThe sales of digital assets held are included within investing activities in the accompanying consolidated statements of cash flows and any realized gains or losses from such sales are included in other income (expense) in the consolidated statements of operations.\nIdentifiable Intangible Assets\nIdentifiable intangible assets consist primarily of design and websites. These assets are tested for impairment using undiscounted cash flow methodology annually and whenever there is an indicator of impairment. Estimating future cash flows requires significant judgment and projections may vary from cash flows eventually realized. Several impairment indicators are beyond the Companys control, and determining whether or not they will occur cannot be predicted with any certainty. Design and websites are amortized on a straight-line basis over an estimated life of three years.\nThe website development costs of the Company are accounted for in accordance with ASC 350-50, Website Development Costs. These costs are included in intangible assets in the accompanying consolidated financial statements. Upgrades or enhancements that add functionality are capitalized while other costs during the operating stage are expensed as incurred. The Company amortizes the capitalized website development costs over an estimated useful life of three years.\nGoodwill\nGoodwill represents the premium paid over the fair value of the net tangible and identifiable intangible assets acquired in the Companys business combinations. The Company performs a goodwill impairment test on at least an annual basis at the reporting unit level. Application of the goodwill impairment test requires significant judgments, including estimation of future cash flows, which is dependent on internal forecasts, estimation of the long-term rate of growth for the businesses, the useful life over which cash flows will occur and determination of our weighted average cost of capital. Changes in these estimates and assumptions could materially affect the determination of fair value and/or conclusions on goodwill impairment for each reporting unit. The Company will conduct its annual goodwill impairment test as of June 30 of each year or more frequently if indicators of impairment exist. The Company periodically analyzes whether any such indicators of impairment exist. A significant amount of judgment is involved in determining if an indicator of impairment has occurred. Such indicators may include a sustained significant decline in our stock price and market capitalization, a significant adverse change in legal factors or in the business climate, unanticipated competition and/or slower expected growth rates, adverse actions or assessments by a regulator, among others. The Company compares the fair value of its reporting unit to its respective carrying value, including related goodwill.\nRevenue recognition\nThe Company recognizes revenue under the Financial Accounting Standards Boards (the FASB) Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. The core principle of the revenue standard is that a company should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the company expects to be entitled in exchange for those goods or services. The following five steps are applied to achieve that core principle:\n● Step 1: Identify the contract with the customer\n● Step 2: Identify the performance obligations in the contract\n● Step 3: Determine the transaction price\n● Step 4: Allocate the transaction price to the performance obligations in the contract\n● Step 5: Recognize revenue when the Company satisfies a performance obligation\nRevenue is recognized when control of the promised goods or services is transferred to the customer, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. The Company generates revenue through liquidity pools and staking rewards.\nLiquidity Pools\nLiquidity pools are a collection of digital assets locked in a smart contract that provide liquidity to decentralized exchanges. Liquidity allows digital assets to be converted to cash quickly and efficiently without drastic price swings. An important component of a liquidity pool are automated market makers (AMMs). An AMM is a protocol that uses liquidity pools to allow digital assets to be traded by a mathematical formula rather than though a traditional market of buyers and sellers.\nThe Company earns fees by providing liquidity on Uniswap V2 and Uniswap V3. The Company earns fees proportionate to the liquidity they have supplied to the exchange. The fee for each trade is set at 0.05% for stable coins, 0.3% for most pairs and 1.0% for exotic pairs. The fees earned by the Company depend on the risk characteristics of each pair of tokens selected and the price range liquidity is provided. Uniswap V2 requires users to provide liquidity over the entire price curve, whereas Uniswap V3 provides users with liquidity over a price range.\nRevenue is recognized from liquidity pools when the award is claimed and deposited in the Company wallet. The transaction consideration the Company receives is noncash in the form of digital assets. Revenue is measured at the fair value of the digital asset awards received.\nMining Pools\nThe Company earns transaction fees with its crypto mining machines by validating requesting customers transactions to a distributing ledger. We joined a mining pool and receive a pro-rata share of a bitcoin award for completing a blockchain.\nThe Company has entered into digital asset mining pools by executing an agreement with one mining pool operator The agreement is terminable at any time by either party. In exchange for providing computing power, the Company is entitled to a fractional share of the fixed cryptocurrency award the mining pool operator receives (less digital asset transaction fees to the mining pool operator which are immaterial and are recorded as a deduction from revenue), for successfully adding a block to the blockchain. The Companys fractional share is based on the proportion of computing power the Company contributed to the mining pool operator to the total computing power contributed by all mining pool participants in solving the current algorithm.\nProviding computing power in digital asset transaction verification services is an output of the Companys ordinary activities. The provision of providing such computing power is the only performance obligation in the Companys contracts with mining pool operators. The transaction consideration the Company receives, if any, is noncash consideration, which the Company measures at fair value on the date received, which is not materially different than the fair value at contract inception or the time the Company has earned the award from the pools. The consideration is all variable. Because it is not probable that a significant reversal of cumulative revenue will not occur, the consideration is constrained until the mining pool operator successfully places a block (by being the first to solve an algorithm) and the Company receives confirmation of the consideration it will receive, at which time revenue is recognized. There is no significant financing component in these transactions.\nFair value of the cryptocurrency award received is determined using the quoted price of the related cryptocurrency at the time of receipt.\nStaking Rewards\nStaking rewards are granted to holders of a crypto asset when the holders lock up that crypto asset as collateral to secure fairness when validating transactions or other network actions.\nThe Company participates in networks with proof-of-stake consensus algorithms, through creating or validating blocks on the network. In exchange for participating in the consensus mechanism of these networks, the Company earns rewards in the form of the native token of the network. Each block creation or validation is a performance obligation. Revenue is recognized at the point when the block creation or validation is complete and the rewards are transferred into a digital wallet that the Company controls. Revenue is measured based on the number of tokens received and the fair value of the token at contract inception.\nAirdrops\nAirdrops are the distribution of tokens without compensation generally undertaken with a view of increasing awareness of a new token, to encourage adoption of a new token and to increase liquidity in the early stages of a token project.\nThe Company recognizes crypto assets received through an airdrop if the crypto asset is expected to generate a probable future benefit and if the Company is able to support the trading, custody, or withdrawal of these assets.\nAirdrops are accounted for in accordance with ASC 610-20, Sales and Transfer of Nonfinancial Assets, Receipt of a airdrops are classified as other income in the statement of operations.\nDeferred Tax Assets and Income Taxes Provision\nThe Company follows the provisions of ASC 740-10-25-13, which addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the consolidated financial statements. Under ASC 740-10-25-13, the Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the consolidated financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. ASC 740-10-25-13 also provides guidance on de-recognition, classification, interest, and penalties on income taxes, accounting in interim periods and requires increased disclosures. The Company had no material adjustments to its liabilities for unrecognized income tax benefits.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying balance sheets, as well as tax credit carry-backs and carry-forwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nTax years that remain subject to examination by major tax jurisdictions are generally the prior three years for federal purposes, and the prior four years for state purposes; however, as a result of the Companys operating losses, all tax years remain subject to examination by tax authorities.\nComparison of Years Ended June 30, 2023 and 2022\nRevenue\nIn March 2022, the Company commenced operations as a web3 enterprise and began purchasing digital assets. Revenue for the years ended June 30, 2023 and 2022 was derived from liquidity pools fees of $102,403 and $81,765, mining pool fees of $18,911 and $0 and staking rewards of $5,348 and $852, respectively.\nOur business plan includes earning income from liquidity fees, mining pool fees and staking. The Company seeks higher returns from liquidity pool fees by selecting pairs with higher risk and good volumes.\nOur high trade volume is due to adjusting parameters on our liquidity pools. Each trade generates a realized gain or may be an indicator of impairment which may trigger an impairment loss.\nIn February 2023, the Company commenced bitcoin mining operations at a hosted facility in Texas.\nOn June 12, 2023, we acquired Boring Brew, a web3 startup known for its unique and limited edition coffee bags, Boring Brew partners with influential NFT holders to transform their intellectual property into an exquisite collection of specialty coffee. We generated $425 is sales during the year ended June 30, 2023 for these activities.\nAdministrative Expenses\nAdministrative expenses totaled $313,519 and $164,669 for the years ended June 30, 2023 and 2022, respectively. These expenses were primarily costs related to accounting, audit, legal and investor relations.\nInterest Expense\nInterest expense totaled $97,432 and $12,761 for the years ended June 30, 2023 and 2022, respectively. The increase in interest expense was due to amortization of debt discount and accrued interest on new promissory notes issued since October 2021.\nImpairment of Digital Assets Held\nImpairment of digital assets held totaled $474,242 and $1,351,074 for the years ended June 30, 2023 and 2022, respectively. Digital assets are accounted for as intangible assets and are subject to impairment losses if the fair value of digital assets decreases below the carrying value at any time during the period. Subsequent reversal of impairment losses is not permitted. We will not recognize any increases in the fair value of digital assets held until a gain is recognized on sale. Impairment losses are a non-cash expense.\nGoodwill\nA goodwill impairment charge of $257,353 was recorded as at June 30, 2023. The impairment of goodwill was due to the inability of the Company to identify future cash flows with suitable reliability associated with Boring Brew LLC and Bored Coffee Lab LLC acquired on June 12, 2023.\nOther Income (Expense)\nOther digital rewards totaled $12,900 and $17,439 for the year ended June 30, 2023 and 2022, respectively. We received $GOO tokens as a result of holding two Art Gobblers NFTs and we received tokens from Blur as a result of using the Blur NFT trading platform. Other digital rewards or airdrops were issued by the platforms to simultaneously reward users and bootstrap growth and liquidity of a new marketplace. Airdrops are unpredictable and the Company does not seek out these rewards.\nOther realized gain on sale/exchange of digital totaled $546,617 and $312,598 for the year ended June 30, 2023 and 2022, respectively. We generally do not seek to earn income from actively trading digital assets held. We will dispose of assets in circumstances when there is a significant increase in the fair value of an asset or when holding an asset is no longer consistent with our business plan. The rebalancing of the portfolio was due to the uncertainty in the crypto market in March 2023 highlighted by the insolvency of Silvergate Bank and Silicon Valley Bank.\nNet Loss\nWe reported a net loss of $572,845 and $1,115,850 for the years ended June 30, 2023 and 2022, respectively. Any increase in revenue and realized gain on sales/exchange on digital assets held was offset by an increase in administrative, interest and impairment expenses.\nOur net loss was primarily due to a steep drop in the market price of crypto assets, high volatility of cryptocurrency prices and a broad deterioration of the cryptocurrency market. During the year ended June 30, 2023, the sustained period of lower market prices which started in 2022 continued. The broad deterioration of the cryptocurrency market has been highlighted by well publicized business failures such as FTX Exchange and BlockFi and the price collapse of TerraUSD and LUNA. We have not suffered direct losses as a counterparty in a contract as a result of recent business failures. The broad deterioration in cryptocurrency prices has reduced the capital we can invest and, therefore, reduced our revenue from liquidity pools and staking rewards. We are unable to predict if or when prices will recover.\nLiquidity and Capital Resources\nWe have incurred recurring operating losses and negative operating cash flows through June 30, 2023, and we expect to continue to incur losses and negative operating cash flows at least through the near future. During the year ended June 30, 2023, we obtained $75,000 of funding by issuing a demand promissory note and a promissory note - related party to meet our most critical cash requirements. At June 30, 2023, $17,086 of cash was held at a financial institution and $0 was held at Coinbase, Inc. The Company expects over the next twelve months, cash held at a financial institution will be expended on professional fees, transfer agent, Edgar agent and other administrative costs. We estimate $200,000 of cash per annum will be required to maintain current operations and remain in business. We hope that we can generate enough revenue from liquidity pools and staking rewards to pay ongoing expenses. In order to remain in business we may have to sell digital assets for cash or issue additional debt order equity. Cash held at Coinbase Inc., if any, will be deployed to purchase digital assets to generate staking rewards and liquidity pool fees. We hope to start paying some of our suppliers and contractors in digital assets in the coming months. However, there can be no assurance we will be able to pay any of our suppliers and contractors in digital assets.\nAs a result of the aforementioned factors, management has concluded that there is substantial doubt about our ability to continue as a going concern. Our independent registered public accounting firm, in its report on our fiscal 2023 financial statements, expressed substantial doubt about our ability to continue as a going concern. Our financial statements as of and for the year ended June 30, 2023, do not contain any adjustments for this uncertainty. In response to our Companys cash needs, we raised funding as described in Note 8 and Note 9 to our financial statements. Any additional amounts raised will be used for our future investing and operating cash flow needs. However, there can be no assurance that we will be successful in raising additional amounts of financing.\nOff-Balance Sheet Arrangements\nThere are no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a Smaller Reporting Company as defined by Rule 12b-2 of the Exchange Act and in Item 10(f)(1) of Regulation S-K, we are electing scaled disclosure reporting obligations and therefore are not required to provide the information requested by this Item. ITEM 8. CONSOLIDATED FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS AND NOTES\nCONTENTS:\nPAGE #\nReports of Independent Registered Public Accounting Firm (PCAOB ID: 6849)\nBalance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the years ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity (Deficit) for the years ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022\nNotes to the Consolidated financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nof Metavesco, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Metavesco, Inc. (the Company) as of June 30, 2023, and the related consolidated statements of operations, consolidated statement of stockholders equity, and consolidated statement of cash flows for the year then ended, and the related notes (collectively referred to as the financial statements).\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nEvaluation of the Accounting for and Disclosure of Digital Currency Held\nAs disclosed in Note 2 to the consolidated financial statements, the Companys digital currency held as of June 30, 2023 are accounted for as indefinite-lived intangible assets. We identified the accounting for and disclosure of the digital currency held as a critical audit matter because, currently, no specific definitive guidance exists for the accounting for and disclosure of digital currencies held in accordance with accounting principles generally accepted in the United States (GAAP). The Companys management has exercised significant judgment in their determination of how existing GAAP should be applied to the accounting for its digital currency held, the associated financial statement presentation and accompanying footnote disclosures.\nThe primary procedures we performed to address this critical audit matter included the following:\n● Evaluated managements rationale for the application of Accounting Standards Codification (ASC) 350 to account for its digital currency held and examined managements processes for determining the amount of impairment expense recognized.\n● Examined supporting evidence for digital currency transactions including managements processes for calculating any gains or losses on sales of its digital currency.\nGreenGrowth CPAs\nOctober 13, 2023\nWe have served as the Companys auditor since 2023\nLos Angeles, California\nPCAOB ID Number 6580\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Metavesco, Inc. (formerly Waterside Capital Corporation)\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Metavesco, Inc. (the Company) as of June 30, 2022 and, and the related statements of operations, stockholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has a working capital deficit, has generated net losses since its inception and further losses are anticipated. The Company requires additional funds to meet its obligations and the costs of its operations. These factors raise substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nEvaluation of the Accounting for and Disclosure of Digital Currency Held\nAs disclosed in Note 2 to the consolidated financial statements, the Companys digital currency held as of June 30, 2022 are accounted for as indefinite-lived intangible assets, and have been included in current assets on the balance sheet. We identified the accounting for and disclosure of the digital currency held as a critical audit matter because, currently, no specific definitive guidance exists for the accounting for and disclosure of digital currencies held in accordance with accounting principles generally accepted in the United States (GAAP). The Companys management has exercised significant judgment in their determination of how existing GAAP should be applied to the accounting for its digital currency held, the associated financial statement presentation and accompanying footnote disclosures.\nThe primary procedures we performed to address this critical audit matter included the following:\n● Evaluated managements rationale for the application of Accounting Standards Codification (ASC) 350 to account for its digital currency held and examined managements processes for determining the amount of impairment expense recognized.\n● Examined supporting evidence for digital currency transactions including managements processes for calculating any gains or losses on sales of its digital currency.\n/s/ Hudgens CPA, PLLC\nwww.hudgenscpas.com\nWe have served as the Companys auditor since 2022.\nHouston, Texas\nOctober 7, 2022\nMETAVESCO, INC.\nCONSOLIDATED BALANCE SHEETS\nJune 30, 2023 June 30, 2022\nAssets\nCurrent assets:\nCash and cash equivalents $ 17,086 $ 35,151\nDeposits -\nInventory 7,788 -\nPrepaid expenses 8,602 13,847\nTotal current assets 34,079 48,998\nDigital assets held, net of impairment 194,229 434,642\nEquipment, net 66,616 -\nIntangible assets, net 41,402 -\nTotal assets $ 336,326 $ 483,640\nLiabilities and Stockholders Equity\nCurrent liabilities:\nAccounts payable and accrued liabilities $ 58,160 $ 26,549\nPromissory notes - related parties, accrued interest (net of debt discount of $2,386 and $0, respectively) 164,129 100,000\nTotal current liabilities 222,289 126,549\nLong-term liabilities\nPromissory note, accrued interest (net of debt discount of $933 and $0, respectively) 25,170 -\nConvertible promissory note, accrued interest (net of debt discount of $15,442 and $19,441, respectively) 5,299\nConvertible promissory notes - related party, accrued interest (net of debt discount of $228,542 and $328,658, respectively) 77,167 12,202\nConvertible promissory notes 77,167 12,202\nTotal long-term liabilities 107,636 12,761\nTotal liabilities 329,925 139,310\nStockholders Equity:\nPreferred stock: $0.0001 par value; 20,000,000 shares authorized - -\nSeries A Convertible Preferred Stock: 22 shares issued and outstanding at June 30, 2023 and June 30, 2022 - -\nPreferred stock value - -\nCommon stock: $0.0001 par value; 100,000,000 shares authorized; 66,322,140 and 60,822,140 shares issued and outstanding at June 30, 2023 and June 30, 2022, respectively 6,632 6,082\nAdditional paid-in capital 19,609,816 19,384,450\nShares to be issued 9,000 -\nAccumulated deficit (19,619,047 ) (19,046,202 )\nTotal stockholders equity 6,401 344,330\nTotal liabilities and stockholders equity $ 336,326 $ 483,640\nThe accompanying notes are an integral part of these consolidated financial statements.\nMETAVESCO, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears ended June 30,\nRevenue\nLiquidity pool fees $ 102,403 $ 81,765\nMining pool fees 18,911 -\nStaking rewards 5,348\nSales -\nTotal Revenue 127,087 82,617\nExpense\nAdministrative expenses 313,539 164,669\nInterest expense 97,432 12,761\nImpairment of digital assets held 591,125 1,351,074\nImpairment of goodwill 257,353\nTotal Expense 1,259,449 1,528,504\nOther income\nOther digital rewards 12,900 17,439\nRealized gain on sale/ exchange of digital assets held 546,617 312,598\nTotal Other income (expense) 559,517 330,037\nNet loss $ (572,845 ) $ (1,115,850 )\nNet loss per share - basic and diluted $ (0.01 ) $ (0.02 )\nWeighted average number of common shares outstanding - basic and diluted 61,183,783 60,822,140\nThe accompanying notes are an integral part of these consolidated financial statements.\nMETAVESCO, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nFor the years ended June 30, 2023 and 2022\nShares Par\nValue Shares Par\nValue paid-in capital to be Issued Accumulated Deficit stockholders\nEquity\nSeries A Convertible Preferred Stock ($0.0001 par value) Common Stock ($0.0001 par value) Additional Shares\nTotal\nShares Par\nValue Shares Par\nValue paid-in capital to be Issued Accumulated Deficit stockholders\nEquity\nBalance at June 30, 2022 $ - 60,822,140 $ 6,082 $ 19,384,450 $ - $ (19,046,202 ) $ 344,330\nShares issued for website\n500,000 17,950\n18,000\nShares issued for investment in Boring Brew LLC and Bored Coffee Lab LLC - - 5,000,000 239,500 - - 240,000\nWarrants - - - - 7,916 - - 7,916\nShares to be issued - - - - - 9,000 - 9,000\nBeneficial conversion feature - - - - (40,000 ) - - (40,000 )\nNet loss - - - - - - (572,845 ) (572,845 )\nBalance at June 30, 2023 $ - 66,322,140 $ 6,632 $ 19,609,816 $ 9,000 $ (19,619,047 ) $ 6,401\nSeries A Convertible Preferred Stock ($0.0001 par value) Common Stock ($0.0001 par value) Additional Shares\nTotal\nShares Par\nValue Shares Par\nValue paid-in capital to be issued Accumulated deficit stockholders\nequity\nBalance at June 30, 2021 - $ - 60,822,140 $ 6,082 $ 17,715,946 $ - $ (17,930,352 ) $ (208,324 )\nBeginning balance value - $ - 60,822,140 $ 6,082 $ 17,715,946 $ - $ (17,930,352 ) $ (208,324 )\nIssue of Series A Convertible Preferred Stock for cash - - - 1,100,000 - - 1,100,000\nBeneficial conversion feature - - - - 360,860 - - 360,860\nForgiveness of convertible note payable, accrued interest and advances - related party - - - - 207,644 - - 207,644\nNet loss - - - - - - (1,115,850 ) (1,115,850 )\nBalance at June 30, 2022 $ - 60,822,140 $ 6,082 $ 19,384,450 $ - $ (19,046,202 ) $ 344,330\nEnding balance value $ - 60,822,140 $ 6,082 $ 19,384,450 $ - $ (19,046,202 ) $ 344,330\nThe accompanying notes are an integral part of these consolidated financial statements.\nMETAVESCO, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOW\nYears ended June 30,\nCash Flows from Operating Activities:\nNet loss $ (572,845 ) $ (1,115,850 )\nAdjustments to reconcile net loss to net cash used in operating activities\nAmortization of intangible assets -\nDepreciation 10,143 -\nImpairment of digital assets held 591,125 1,351,074\nRealized gain on sales/ exchange digital assets held (546,617 ) (312,598 )\nDigital assets received as revenue and other rewards (139,562 ) (100,056 )\nDigital assets paid for expenses 46,557 17,751\nNon-cash interest expense 88,422 12,761\nGain on settlement of debt (55 ) -\nImpairment of goodwill 257,353 -\nForgiveness of interest - related party - 2,997\nChanges in operating assets and liabilities:\nIncrease in deposit (359 ) -\nIncrease in inventory (2,585 ) -\nIncrease (decrease) in prepaid 11,481 (13,847 )\nIncrease in accounts payable and accrued liabilities 57,482 4,460\nNet cash used in operating activities (198,863 ) (153,308 )\nCash Flows from Investing Activities:\nPurchase of digital assets held (55,000 ) (1,289,952 )\nSale of digital assets held 232,206 -\nPurchase of fixed assets (4,664 ) -\nPurchase of website (2,499 ) -\nInvestment in Boring Brew LLC and Bored Coffee Lab LLC (9,245 ) -\nNet cash provided by (used in) investing activities 160,798 (1,289,952 )\nCash Flows from Financing Activities:\nAdvances from related party - 18,367\nProceeds from issuance of promissory note payable 25,000 100,000\nProceeds from issuance of convertible notes payable - related party 50,000 240,000\nProceeds from issuance of convertible notes payable - 20,000\nRepayment of convertible notes payable - related party (20,000 ) -\nRepayment of advances (35,000 ) -\nIssuance of Series A Convertible Preferred Stock - 1,100,000\nNet cash provided by financing activities 20,000 1,478,367\nNet change in cash and cash equivalents (18,065 ) 35,107\nCash and cash equivalents, beginning of year 35,151\nCash and cash equivalents, end of year $ 17,086 $ 35,151\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION\nCash paid during period for:\nInterest paid $ 9,010 $ -\nIncome taxes paid $ - $ -\nNon-cash Investing and Financing Activities\nPurchase of digital assets held with convertible promissory notes - related party $ - $ 100,860\nPurchase of digital assets held with other digital assets $ 6,941,826 $ 10,244,898\nProceeds from sale of digital assets for other digital assets $ 7,292,387 $ 10,244,898\nShares issued for website $ 18,000 $ -\nShares issued for investment in Boring Brew LLC and Bored Coffee Lab LLC $ 240,000 $ -\nShares to be issued in conjunction with the amendment of terms of promissory note - related party $ 9,000 $ -\nIntrinsic value of embedded beneficial conversion feature on convertible note payable - related party $ 40,000 $ 360,860\nEquipment paid with digital assets $ 72,095 $ -\nWarrants issued in conjunction with promissory note $ 7,916 $ -\nDigital assets for payment of promissory note - related party $ 7,502 $ -\nForgiveness of convertible note payable, accrued interest and advances - related party $ - $ 207,644\nThe accompanying notes are an integral part of these consolidated financial statements.\nMETAVESCO, INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2023\nNOTE 1 - ORGANIZATION AND OPERATIONS\nMetavesco, Inc. (formerly Waterside Capital Corporation) (the Company) was incorporated in the Commonwealth of Virginia on July 13, 1993 and was a closed-end investment company licensed by the Small Business Administration (the SBA) as a Small Business Investment Company (SBIC). The Company previously made equity investments in, and provided loans to, small businesses to finance their growth, expansion, and development. Under applicable SBA regulations, the Company was restricted to investing only in qualified small businesses as contemplated by the Small Business Investment Act of 1958. As a registered investment company under the Investment Company Act of 1940, as amended (the Investment Company Act), the Companys investment objective was to provide its shareholders with a high level of income, with capital appreciation as a secondary objective. The Company made its first investment in a small business in October 1996.\nOn May 28, 2014, with the Companys consent, the United States District Court for the Eastern District of Virginia, having jurisdiction over an action filed by the SBA (the Court), entered a Consent Order and Judgment Dismissing Counterclaim, Appointing Receiver, Granting Permanent Injunctive Relief and Granting Money Judgment (the Order). The Order appointed the SBA receiver of the Company for the purpose of marshaling and liquidating in an orderly manner all of the Companys assets and entered judgment in favor of the United States of America, on behalf of the SBA, against the Company in the amount of $11,770,722. The Court assumed jurisdiction over the Company and the SBA was appointed receiver effective May 28, 2014.\nThe Company effectively stopped conducting an active business upon the appointment of the SBA as the receiver and the commencement of the court-ordered receivership (the Receivership). Over the course of the Receivership, the activity of the Company was limited to the liquidation of the Companys assets by the receiver and the payment of the proceeds therefrom to the SBA and for the expenses of the Receivership. On June 28, 2017, the Receivership was terminated with the entry of a Final Order by the Court. The Final Order specifically stated that Control of Waterside shall be unconditionally transferred and returned to its shareholders c/o Roran Capital, LLC (Roran) upon notification of entry of this Order. Upon termination of the Receivership, Roran took possession of all books and records made available to it by the SBA.\nThe Company filed with the Securities and Exchange Commission (the SEC) an application pursuant to Section 8(f) of the Investment Company Act for an order declaring that the Company had ceased to be a registered investment company. On April 22, 2020, the SEC issued an order under Section 8(f) of the Investment Company Act declaring that the Company had ceased to be an investment company. As a result, the Company is now a reporting company under the Securities Exchange Act of 1934, as amended.\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran. Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644, which is comprised of convertible note payable - related party, accrued interest payable - related party, and advances from related party. The Buyer acquired 42,476,660 shares of the Companys Common Stock, representing 69.7% of the issued and outstanding shares of Common Stock. As such, the SPA resulted in a change of control of the Company.\nEffective November 29, 2021, the Company converted from a Virginia corporation to a Nevada corporation.\nOn December 15, 2021, the Company filed with the Nevada Secretary of State amended and restated articles of incorporation. The amended and restated articles of incorporation had the effect of (i) increasing the Companys authorized common stock to 100 million shares, (ii) increasing the Companys authorized preferred stock to 20 million shares, and (iii) reducing the par value of each of the Companys common stock and preferred stock to $0.0001 per share. Common stock and additional paid-in capital for all periods presented in these financial statements have been adjusted retroactively to reflect the reduction in par value.\nOn December 17, 2021, the majority shareholder and board of directors approved an amendment to the amended and restated articles of incorporation that would change the Companys name from Waterside Capital Corporation to Metavesco, Inc. The name change was effective June 3, 2022, following clearance by the Financial Industry Regulatory Authority (FINRA).\nIn March 2022, the Company commenced operations as a web3 enterprise. The Company generates income as a liquidity provider, via decentralized exchanges such as Uniswap. Additionally, the Company farms tokens via Proof of Stake protocols on decentralized exchanges, as well as centralized exchanges including the Coinbase, Inc. (Coinbase) exchange. The Company also invests in what it considers promising non-fungible token (NFT) projects and virtual land, primarily on Ethereum virtual machine (EVM) protocols.\nOn June 12, 2023, the Company entered into a Limited Liability Company Interest Purchase Agreement the (Purchase Agreement) with Eddy Rodrigeuz (the Seller). The Seller is the sole owner of Boring Brew LLC (Boring) and Bored Coffee Lab, LLC (Bored). Under the terms of the Purchase Agreement, the Seller sold to the Company, all of the outstanding limited liability company interests in Boring and Bored for a total purchase price of $9,245 in cash and 5,000,000 shares of common stock of the Company.\nGoing Concern\nThe Companys consolidated financial statements have been prepared in accordance with GAAP applicable to a going concern. This contemplates the realization of assets and the liquidation of liabilities in the normal course of business. During the year ended June 30, 2023, the Company incurred a net loss of $572,845 and used cash in operating activities of $198,863, and on June 30, 2023, had an accumulated deficit of $19,619,047. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern for a period of one year from the date that the consolidated financial statements are issued. The Company will be dependent upon the raising of additional capital through placement of debt and its common stock in order to implement its business plan. There can be no assurance that the Company will be successful in this situation. The Company expects over the next twelve months, cash held at a consolidated financial institution will be expended on professional fees, transfer agent, Edgar agent and other administrative costs. The cash held at Coinbase will be deployed to purchase crypto assets to generate staking rewards and liquidity pool fees. We hope to start paying some of our suppliers and contractors in crypto assets in the coming months. However, there can be no assurance we will be able to pay any of our suppliers and contractors in digital assets.\nNOTE 2 - SIGNIFICANT ACCOUNTING POLICIES\nFiscal Year-End\nThe Company elected June 30 as its fiscal year-end date.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries (1) Boring Brew LLC and (2) Bored Coffee Lab, LLC. All significant intercompany transactions are eliminated.\nUse of Estimates and Assumptions and Critical Accounting Estimates and Assumptions\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the dates of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nThese significant accounting estimates or assumptions bear the risk of change due to the fact that there are uncertainties attached to these estimates or assumptions, and certain estimates or assumptions are difficult to measure or value.\nManagement bases its estimates on historical experience and on various assumptions that are believed to be reasonable in relation to the consolidated financial statements taken as a whole under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nManagement regularly evaluates the key factors and assumptions used to develop the estimates utilizing currently available information, changes in facts and circumstances, historical experience, and reasonable assumptions. After such evaluations, if deemed appropriate, those estimates are adjusted accordingly.\nSignificant matter requiring use of estimates and assumptions include, but may not be limited to, evaluation of impairment of digital assets, equipment, identifiable intangible assets and goodwill, recognition and valuation of revenue, valuation allowance for deferred tax assets and fair value used in business acquisitions..\nActual results could differ from those estimates.\nBusiness Acquisitions\nThe Company accounts for its business combinations using the acquisition method of accounting in accordance with ASC 805 Business Combinations. The cost of an acquisition is measured at the aggregate of the acquisition date fair value of the assets transferred to the sellers and liabilities incurred by the Company and equity instruments issued. Transaction costs directly attributable to the acquisition are expensed as incurred. Identifiable assets and liabilities acquired or assumed are measured separately at their fair values as of the acquisition date, irrespective of the extent of any non-controlling interests. The excess of (i) the total costs of acquisition, fair value of the non-controlling interests and acquisition date fair value of any previously held equity interest in the acquiree over (ii) the fair value of the identifiable net assets of the acquiree is recorded as goodwill. If the cost of acquisition is less than the fair value of the net assets of the subsidiary acquired, the difference is recognized directly in the consolidated income statements. During the measurement period, which can be up to one year from the acquisition date, the Company may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded to the consolidated income statements.\nCash and cash equivalents\nCash and cash equivalents include cash and interest-bearing highly liquid investments held at consolidated financial institutions, cash on hand that is not restricted as to withdrawal or use with an initial maturity of three months or less, and cash held in accounts at crypto trading venues. At June 30, 2023, $17,086 of cash was at held a consolidated financial institution which is a member of the Federal Deposit Insurance Corporation (FDIC) and $0 was held at Coinbase. The contract with Coinbase requires USD balances in a clients fiat wallet be held in an omnibus custodial account for the benefit of Coinbases customers. These accounts are either omnibus bank accounts insured by the FDIC (currently up to $250,000 per entity) or trust accounts holding short term U.S. treasuries.\nDigital Assets\nDigital assets held by the Company are accounted for as intangible assets with indefinite useful lives, and are initially measured at cost. The Company assigns costs to transactions on a first-in, first-out basis (FIFO).\nAn intangible asset with an indefinite useful life is not amortized but assessed for impairment annually, or more frequently, when events or changes in circumstances occur indicating that it is more likely than not that the indefinite-lived asset is impaired. Impairment exists when the carrying amount exceeds its fair value, which is measured using the quoted price of the digital assets at the time its fair value is being measured.\nTokens are subject to impairment losses if the fair value of a token decreases below the carrying value at any time during the period. The fair value is measured using the quoted price in the principal market of the tokens. The Company currently obtains the quoted price of tokens from www.cryptocompare.com.\nLiquidity pool tokens and NFTs are subject to impairment losses if the fair value a token decreases below the carrying value at the end of each quarterly accounting period. The fair value of liquidity pool tokens is based on the quoted price on the last day of the quarter at 4PM Eastern Time. The fair value of NFTs is based on the average trading price on the last day of each quarter.\nImpairment for liquidity pool tokens and NFTs is assessed quarterly due to each token being a unique asset and due to the illiquid markets in which these tokens trade. The Company is continuously reviewing available markets and information and its methodology when determining the fair value of digital assets.\nThe Company currently reviews quoted prices of its liquidity pool tokens, NFTs and comparable tokens at https://uniswap.org/ and https://opensea.io. Impairment expense is reflected in total expense in the consolidated statements of operations. Subsequent reversal of impairment losses is not permitted.\nThe sales of digital assets held are included within investing activities in the accompanying consolidated statements of cash flows and any realized gains or losses from such sales are included in other income (expense) in the consolidated statements of operations.\nIdentifiable Intangible Assets\nIdentifiable intangible assets consist primarily of design and websites. These assets are tested for impairment using undiscounted cash flow methodology annually and whenever there is an indicator of impairment. Estimating future cash flows requires significant judgment and projections may vary from cash flows eventually realized. Several impairment indicators are beyond the Companys control, and determining whether or not they will occur cannot be predicted with any certainty. Design and websites are amortized on a straight-line basis over an estimated life of three years.\nThe website development costs of the Company are accounted for in accordance with ASC 350-50, Website Development Costs. These costs are included in intangible assets in the accompanying consolidated financial statements. Upgrades or enhancements that add functionality are capitalized while other costs during the operating stage are expensed as incurred. The Company amortizes the capitalized website development costs over an estimated useful life of three years.\nGoodwill\nGoodwill represents the premium paid over the fair value of the net tangible and identifiable intangible assets acquired in the Companys business combinations. The Company performs a goodwill impairment test on at least an annual basis at the reporting unit level. Application of the goodwill impairment test requires significant judgments, including estimation of future cash flows, which is dependent on internal forecasts, estimation of the long-term rate of growth for the businesses, the useful life over which cash flows will occur and determination of our weighted average cost of capital. Changes in these estimates and assumptions could materially affect the determination of fair value and/or conclusions on goodwill impairment for each reporting unit. The Company will conduct its annual goodwill impairment test as of June 30 of each year or more frequently if indicators of impairment exist. The Company periodically analyzes whether any such indicators of impairment exist. A significant amount of judgment is involved in determining if an indicator of impairment has occurred. Such indicators may include a sustained significant decline in our stock price and market capitalization, a significant adverse change in legal factors or in the business climate, unanticipated competition and/or slower expected growth rates, adverse actions or assessments by a regulator, among others. The Company compares the fair value of its reporting unit to its respective carrying value, including related goodwill.\nA goodwill impairment charge of $257,353 was recorded as at June 30, 2023. The impairment of goodwill was due to the inability of the Company to identify future cash flows with suitable reliability associated with Boring Brew LLC and Bored Coffee Lab LLC acquired on June 12, 2023. See Note 3 - Business Acquisition.\nSCHEDULE OF GOODWILL\nOpening balance at June 30, 2022 $ 0\nPurchase of goodwill 257,353\nImpairment of goodwill (257,353 )\nClosing balance at June 30, 2023 $ 0\nRevenue recognition\nThe Company recognizes revenue under the Financial Accounting Standards Boards (the FASB) Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. The core principle of the revenue standard is that a company should recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the company expects to be entitled in exchange for those goods or services. The following five steps are applied to achieve that core principle:\n● Step 1: Identify the contract with the customer\n● Step 2: Identify the performance obligations in the contract\n● Step 3: Determine the transaction price\n● Step 4: Allocate the transaction price to the performance obligations in the contract\n● Step 5: Recognize revenue when the Company satisfies a performance obligation\nRevenue is recognized when control of the promised goods or services is transferred to the customer, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. The Company generates revenue through liquidity pools and staking rewards.\nLiquidity Pools\nLiquidity pools are a collection of digital assets locked in a smart contract that provide liquidity to decentralized exchanges. Liquidity allows digital assets to be converted to cash quickly and efficiently without drastic price swings. An important component of a liquidity pool are automated market makers (AMMs). An AMM is a protocol that uses liquidity pools to allow digital assets to be traded by a mathematical formula rather than though a traditional market of buyers and sellers.\nThe Company earns fees by providing liquidity on Uniswap V2 and Uniswap V3. The Company earns fees proportionate to the liquidity they have supplied to the exchange. The fee for each trade is set at 0.05% for stable coins, 0.3% for most pairs and 1.0% for exotic pairs. The fees earned by the Company depend on the risk characteristics of each pair of tokens selected and the price range liquidity is provided. Uniswap V2 requires users to provide liquidity over the entire price curve, whereas Uniswap V3 provides users with liquidity over a price range.\nRevenue is recognized from liquidity pools when the award is claimed and deposited in the Company wallet. The transaction consideration the Company receives is noncash in the form of digital assets. Revenue is measured at the fair value of the digital asset awards received.\nMining Pools\nThe Company earns transaction fees with its crypto mining machines by validating requesting customers transactions to a distributing ledger. We joined a mining pool and receive a pro-rata share of a bitcoin award for completing a blockchain.\nThe Company has entered into digital asset mining pools by executing an agreement with one mining pool operator The agreement is terminable at any time by either party. In exchange for providing computing power, the Company is entitled to a fractional share of the fixed cryptocurrency award the mining pool operator receives (less digital asset transaction fees to the mining pool operator which are immaterial and are recorded as a deduction from revenue), for successfully adding a block to the blockchain. The Companys fractional share is based on the proportion of computing power the Company contributed to the mining pool operator to the total computing power contributed by all mining pool participants in solving the current algorithm.\nProviding computing power in digital asset transaction verification services is an output of the Companys ordinary activities. The provision of providing such computing power is the only performance obligation in the Companys contracts with mining pool operators. The transaction consideration the Company receives, if any, is noncash consideration, which the Company measures at fair value on the date received, which is not materially different than the fair value at contract inception or the time the Company has earned the award from the pools. The consideration is all variable. Because it is not probable that a significant reversal of cumulative revenue will not occur, the consideration is constrained until the mining pool operator successfully places a block (by being the first to solve an algorithm) and the Company receives confirmation of the consideration it will receive, at which time revenue is recognized. There is no significant financing component in these transactions.\nFair value of the cryptocurrency award received is determined using the quoted price of the related cryptocurrency at the time of receipt.\nStaking Rewards\nStaking rewards are granted to holders of a crypto asset when the holders lock up that crypto asset as collateral to secure fairness when validating transactions or other network actions.\nThe Company participates in networks with proof-of-stake consensus algorithms, through creating or validating blocks on the network. In exchange for participating in the consensus mechanism of these networks, the Company earns rewards in the form of the native token of the network. Each block creation or validation is a performance obligation. Revenue is recognized at the point when the block creation or validation is complete and the rewards are transferred into a digital wallet that the Company controls. Revenue is measured based on the number of tokens received and the fair value of the token at contract inception.\nAirdrops\nAirdrops are the distribution of tokens without compensation generally undertaken with a view of increasing awareness of a new token, to encourage adoption of a new token and to increase liquidity in the early stages of a token project.\nThe Company recognizes crypto assets received through an airdrop if the crypto asset is expected to generate a probable future benefit and if the Company is able to support the trading, custody, or withdrawal of these assets.\nAirdrops are accounted for in accordance with ASC 610-20, Sales and Transfer of Nonfinancial Assets, Receipt of a airdrops are classified as other income in the statement of operations.\nEquipment\nEquipment is stated at cost, less accumulated depreciation and amortization. Expenditures for maintenance and repairs are charged to expense when incurred, while renewals and betterments that materially extend the life of an asset are capitalized.\nThe costs of assets sold, retired, or otherwise disposed of, and the related allowance for depreciation, are eliminated from the accounts, and any resulting gain or loss is recognized in the results from operations. Depreciation is provided over the estimated useful lives of the assets, which are as follows:\nSCHEDULE OF ESTIMATED USEFUL LIVES OF ASSETS\nMining equipment Straight-line over 36 months\nConvertible Financial Instruments\nThe Company bifurcates conversion options from their host instruments and accounts for them as free-standing derivative financial instruments if certain criteria are met. The criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. An exception to this rule is when the host instrument is deemed to be conventional, as that term is described under applicable GAAP.\nWhen the Company has determined that the embedded conversion options should not be bifurcated from their host instruments, discounts are recorded for the intrinsic value of conversion options embedded in the instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the transaction and the effective conversion price embedded in the instrument.\nBeneficial conversion feature - The issuance of the convertible debt generated a beneficial conversion feature (BCF), which arises when a debt or equity security is issued with a non-separated embedded conversion option that is beneficial to the investor or in the money at inception because the conversion option has an effective strike price that is less than the market price of the underlying stock at the commitment date. The Company recognized the BCF by allocating the intrinsic value of the conversion option, which is the number of shares of common stock available upon conversion multiplied by the difference between the effective conversion price per share and the fair value of common stock per share on the commitment date, resulting in a discount on the convertible debt (recorded as a component of additional paid-in capital). The BCF is amortized into interest expense over the life of the related debt.\nRelated Parties\nThe Company follows subtopic 850-10 of the ASC for the identification of related parties and disclosure of related party transactions.\nThe consolidated financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. The disclosures shall include: (a) the nature of the relationship(s) involved; (b) a description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the consolidated financial statements; (c) the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and, (d) amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nCommitments and Contingencies\nThe Company follows ASC 450-20 to report accounting for contingencies. Certain conditions may exist as of the date the consolidated financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur. Management assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, management evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys consolidated financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed.\nDeferred Tax Assets and Income Taxes Provision\nThe Company follows the provisions of ASC 740-10-25-13, which addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the consolidated financial statements. Under ASC 740-10-25-13, the Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the consolidated financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. ASC 740-10-25-13 also provides guidance on de-recognition, classification, interest, and penalties on income taxes, accounting in interim periods and requires increased disclosures. The Company had no material adjustments to its liabilities for unrecognized income tax benefits.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying balance sheets, as well as tax credit carry-backs and carry-forwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nTax years that remain subject to examination by major tax jurisdictions are generally the prior three years for federal purposes, and the prior four years for state purposes; however, as a result of the Companys operating losses, all tax years remain subject to examination by tax authorities.\nNet Income (Loss) Per Common Share\nThe Company computes net income or loss per share in accordance with ASC 260 Earnings Per Share. Under the provisions of ASC 260, basic net loss per share is computed by dividing the net loss available to common stockholders for the period by the weighted average number of shares of common stock outstanding during the period. The calculation of diluted net loss per share gives effect to common stock equivalents; however, on June 30, 2023 and 2022, we excluded the common stock issuable upon conversion of warrants to 6,620,000 shares and 6,600,000 shares, respectively, as their effect would have been anti-dilutive.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of ASC for disclosures about fair value of its financial instruments and has adopted paragraph 820-10-35-37 of ASC (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in GAAP, and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. The three levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1: Quoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2: Pricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3: Pricing inputs that are generally unobservable inputs and not corroborated by market data.\nFinancial assets are considered Level 3 when their fair values are determined using pricing models, discounted cash flow methodologies or similar techniques and at least one significant model assumption or input is unobservable.\nThe fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. If the inputs used to measure the financial assets and liabilities fall within more than one level described above, the categorization is based on the lowest level input that is significant to the fair value measurement of the instrument.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free-market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\nRecently Issued Accounting Pronouncements\nIn August 2020, the FASB issued Accounting Standards Update (ASU) 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40). This update amends the guidance on convertible instruments and the derivatives scope exception for contracts in an entitys own equity and improves and amends the related earnings per share guidance for both Subtopics. This standard is effective for fiscal years and interim periods within those fiscal years beginning after December 15, 2023, which means it will be effective for our fiscal year beginning July 1, 2024. Early adoption is permitted but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. We are currently evaluating the impact of ASU 2020-06 on our consolidated financial statements.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the SEC did not or are not believed by management to have a material impact on the Companys present or future consolidated financial statements.\nNOTE 3 - BUSINESS ACQUISITION\nOn June 12, 2023, the Company entered into a Limited Liability Company Interest Purchase Agreement (the Purchase Agreement) with Eddy Rodrigeuz (the Seller). The Seller is the sole owner of Boring Brew LLC (Boring) and Bored Coffee Lab, LLC (Bored). Under the terms of the Purchase Agreement, the Seller sold to the Company, all of the outstanding limited liability company interests in Boring and Bored. The Company paid the Seller total consideration with a fair value of $249,245, paid as follows: (i) $9,245 in cash and (ii) 5,000,000 shares of the Companys common stock at a fair value of $240,000 ($0.048 per share based on the closing price of the Company common stock on June 12, 2023).\nAssets acquired and liabilities assumed in the Agreement were recorded on the Companys Consolidated Balance Sheet as of the acquisition date of June 12, 2023 based upon their estimated fair values. The results of operations of businesses acquired by the Company have been included in the statements of operations since the date of acquisition. The excess of the purchase price over the estimated fair values of the underlying identifiable assets acquired and liabilities assumed were allocated to goodwill.\nThe preliminary allocation of the purchase price and the estimated fair market values of the assets acquired and liabilities assumed are shown below:\nSCHEDULE OF FAIR MARKET VALUES OF ASSETS AND LIABILITIES\nFair value of assets acquired and liabilities assumed\nDeposit $ 244\nInventory 5,203\nDesign 9,000\nWeb development 12,500\nGoodwill 257,353\nAdvances payable (35,055 )\nPurchase Price $ 249,245\nUnaudited pro forma results of operations information for the years ended June 30, 2023 and 2022 as if the Company and the entities described above had been combined on July 1, 2021 are as follows. The pro forma results include estimates and assumptions which management believes are reasonable. The pro forma results do not include any anticipated cost savings or other effects of the planned integration of these entities, and are not necessarily indicative of the results that would have occurred if the business combinations had been in effect on the dates indicated, or which may result in the future.\nSCHEDULE OF BUSINESS ACQUISITION PROFORMA INFORMATION\nFor the Year Ended\nJune 30,\nFor the Year Ended\nJune 30,\nRevenue $ 148,182 $ 82,815\nNet loss $ (592,466 ) $ (1,124,564 )\nNet loss per share $ (0.01 ) $ (0.02 )\nNOTE 4 - DIGITAL ASSETS HELD, NET OF IMPAIRMENT\nDigital assets held, net of impairment have consisted of:\nSCHEDULE OF DIGITAL ASSETS HELD NET OF IMPAIRMENT\nDigital Assets\nBalance, June 30, 2021 $ -\nPurchase of digital assets 11,615,710\nProceeds from sale of digital assets (10,224,899 )\nRealized gain on sales/ exchange digital assets 312,598\nAcquired digital assets by Airdrop 17,439\nAcquired digital assets by Liquidity Pools 81,765\nAcquired digital assets by Staking Rewards\nDigital assets used to pay fees (17,749 )\nImpairment charges (1,351,074 )\nBalance, June 30, 2022 434,642\nBeginning balance 434,642\nPurchase of digital assets 6,904,183\nProceeds from sale of digital assets (7,107,258 )\nRealized gain on sale/ exchange of digital assets held 546,617\nAcquired digital assets by liquidity pools, mining pools and other digital rewards 139,562\nDigital assets used to pay prepaid, equipment and expenses (124,890 )\nDigital assets used to repay promissory notes (7,502 )\nImpairment charges (591,125 )\nBalance, June 30, 2023 $ 194,229\nEnding balance $ 194,229\nAs at June 30, 2023, the Companys holdings of digital assets held, net of impairment consists of:\nSCHEDULE OF ASSETS DIGITAL HOLDING IMPAIRMENTS\nUnits held Carrying value, at cost less impairment\nCryptocurrency\nAPE 20,356.45 $ 41,114\nETH 9.94 16,138\nBTC 0.61 14,904\nJOE 18,990.00 5,481\nUNI 933.08 2,816\nRBNT 5,567.49 1,733\nUSDC 1,225.96 1,209\nOther\n1,880\nCryptocurrency Total\n$ 85,275\nLiquidity Pool Tokens\nUniswap V3 2.0 $ 65,287\nCAKE 7,259.56 9,481\nLiquidity Pool Tokens Total\n$ 74,768\nNon-Fungible Tokens\nMutant Ape Yacht Club $ 13,247\nMeebits 10,006\nBored Ape Kennel Club 5,105\nNakamigos 1,555\nOnForce 1 1,506\nOther NFTs\n2,767\nNon-Fungible Tokens total\n$ 34,186\nTotal digital assets, net of impairment\n$ 194,229\nAs at June 30, 2022, the Companys holdings of digital assets held, net of impairment consists of:\nUnits held Carrying value, at cost less impairment\nCryptocurrency\nAPE 9,304.96 $ 34,276\nETH 23.25 23,666\nCAKE 4,570.35 12,061\nMKR 9.83 7,052\nRLP 249.49 6,910\nUSDC 5,251.32 5,249\nLINK 94.05\nCryptocurrency Total\n$ 89,685\nLiquidity Pool Tokens\nUniswap V3 4.2 239,827\nmooEmp 275.77 30,841\nLiquidity Pool Tokens Total\n$ 270,668\nNon-Fungible Tokens\nMutant Ape Yacht Club $ 19,573\nOther Deed 38,604\nBoard Ape Kennel Club 6,106\nMeebits 10,006\nNon-Fungible Tokens total\n$ 74,289\nTotal digital assets, net of impairment\n$ 434,642\nNOTE 5 -EQUIPMENT\nSCHEDULE OF EQUIPMENT\nCost Accumulated Depreciation June 30, 2023\nNet Book Value\nJune 30, 2022\nNet Book Value\nMining equipment $ 76,759 $ 10,143 $ 66,616 $ 0\n$ 76,759 $ 10,143 $ 66,616 $ 0\nOn August 22, 2022, the Company made a deposit of $72,095 with USD Coin (USDC) to purchase 18 Antminer S19j Pro 100TH Bitcoin mining machines. These machines were deployed, became operational and started to generate revenue on February 7, 2023.\nDepreciation expense for the years ended June 30, 2023 and 2022 was $10,143 and $0, respectively.\nNOTE 6 - IDENTIFIED INTANGIBLE ASSETS\nIntangible assets comprise website development and design which are recorded at cost.\nSCHEDULE OF IDENTIFIED INTANGIBLE ASSETS\nJune 30, 2023 June 30, 2022\nWebsite development $ 32,999 $ -\nDesign 9,000 -\nIdentifiable Intangible Assets Gross 41,999 -\nAccumulated amortization (597 ) -\nIdentifiable Intangible Assets $ 41,402 $ -\nOn June 12, 2023, the Company acquired website and design of $12,500 and $9,000, respectively, and commenced amortization upon closing of the business acquisition of all of the outstanding limited liability company interests in Boring Brew LLC and Bored Coffee Lab, LLC.\nDuring the year ended June 30, 2023, $597 (comprising website of $347 and design of $250) and $0, respectively, was recorded as amortization. The Company estimates amortization over the next two years is $14,000 per annum and amortization of $13,402 in the third year.\nNOTE 7 - NOTES PAYABLE - RELATED PARTY\nOn September 19, 2017, the Company entered into a Convertible Loan Agreement with Roran (the Loan Agreement). Pursuant to the Loan Agreement, Roran agreed to loan the Company an amount not to exceed a total of $150,000 in principal over 18 months. On June 17, 2019, the Company amended the Loan Agreement increasing the loan amount to $200,000 and extending the maturity date to September 19, 2019. Each advance under the Loan Agreement will be documented under a Convertible Promissory Note issued by the Company in favor of Roran (the Note). The Note bears interest at the rate of 12% per annum. Roran has the right to convert all or any portion of the Note into shares of the Companys common stock at a conversion price equal to 60% of the share price. The Company recorded a BCF due to the conversion option of $116,800, which has been fully amortized as of September 30, 2019. The debt discount has been amortized as interest expense through September 30, 2019. On December 13, 2019, the Company amended its Loan Agreement Note with Roran as follows: (i) the total amount to be loaned was increased to $250,000, and (ii) the maturity date was extended to June 19, 2020. Although the maturity date has passed, Roran has agreed to extend the loan and advance additional funds until further negotiations have been concluded. On June 8, 2020, Roran converted $124,500 principal amount of its promissory note with the Company and $25,500 of accrued and unpaid interest thereon, totaling $150,000, into 41,666,660 shares of Company Common Stock at the stated conversion price per share of $0.0036. The remaining balance due on the promissory note, as of the conversion date, was $104,838 in principal and $19,988 in interest. As a result of the advances made pursuant to the Loan Agreement, the Company has incurred total obligations of $149,838 as of June 30, 2021 (net of debt discounts and exclusive of accrued interest).\nDuring the year ended June 30, 2022, Roran made non-interest bearing, unsecured, short-term cash advances to the Company totaling $18,367 for the purpose of paying all accounts payable before the closing date of the SPA.\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran Capital LLC (Roran). Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644, which is comprised of convertible note payable - related party, accrued interest payable - related party and advances from related party. In accordance with ASC 470-50-40-2, the resulting forgiveness of convertible note payable, accrued interest and advances - related party of $207,644 is recorded as an increase in additional paid-in capital within the consolidated statements of shareholders equity (deficit), as the debt forgiven is in essence a capital transaction.\nSCHEDULE OF AMOUNTS OWNED TO RELATED PARTIES\nDebts forgiven by Roran on\nSeptember 2, 2021\nConvertible note payable - related party $ 149,838\nInterest on convertible note payable - related party 39,439\nAdvance from related party 18,367\nForgiveness of convertible note payable, accrued interest and advances - related party $ 207,644\nNOTE 8 - PROMISSORY NOTES\nDemand Promissory Note and Common Stock Purchase Warrant\nOn August 12, 2022, the Company issued a Promissory Note in the principal amount of $25,000 (the Promissory Note) for cash to Tom Zarro. The Promissory Note bears interest at the rate of 5.00% per annum. Any unpaid principal amount and any accrued interest is due on August 12, 2023. Mr. Zarro may demand payment of all or any portion of the outstanding principal and interest at any time. The Promissory Note is unsecured and there is no prepayment penalty. In the event the Promissory Note is not paid when due, any outstanding principal and interest will accrue interest of 12% per annum. In conjunction with the issue of the Promissory Note, the Company issued Mr. Zarro a common stock purchase warrant (the Warrant). The terms of the Warrant state that, Mr. Zarro may, at any time on or after August 12, 2022 and until August 12, 2025, exercise the Warrant to purchase 20,000 shares of the Companys common stock for an exercise price per share of $0.075, subject to adjustment as provided in the Warrant. The fair value of the Warrant was calculated using volatility of 157%, interest-free rate of 3.18%, nil expected dividend yield and expected life of 3 years. The fair value of the debt and warrant is allocated based on their relative fair values. During the year ended June 30, 2023 and 2022, $6,983 and $0, respectively, of discount amortization is included in interest expense. At June 30, 2023 and, 2022, there was an unamortized discount balance of $933 and $0, respectively, to be amortized through May 2027 and accrued interest payable of $1,103 and $0, respectively.\nDemand Promissory Note - Related Parties\nOn October 18, 2021, the Company issued a Promissory Note in the principal amount of $100,000 (the Promissory Note) for cash to Ryan Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 0.01% per annum. Any unpaid principal amount and any accrued interest was due on October 18, 2022. On August 29, 2022, the Company entered into an Amendment to Promissory Note, dated August 29, 2022, with the Holder. Pursuant to the terms of the note amendment, the maturity date of the Promissory Note was extended to October 23, 2023, and the interest rate of the Promissory Note was increased to 5% as of and following August 29, 2022. As consideration for extension of the maturity date, the Company agreed to issue to Mr. Schadel 150,000 shares of the Companys common stock with a fair value of $9,000. These shares were payable and reported as shares to be issued as of the date of this Report. The note amendment resulted in a change in the cash flows of less than 10%. Therefore, the Promissory Note is not considered to be substantially different in accordance with ASC 470-50-10-10 and applied the modification accounting model in accordance with ASC-50-40-17 (b). During the years ended June 30, 2023 and 2022, $6,614 and $0, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $2,386, and $0, respectively, to be amortized through October 2023 and accrued interest payable of $2,080 and $0, respectively.\nOn June 29, 2022, the Company issued a Promissory Note in the principal amount of $40,000 (the Promissory Note) for cash to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 0.01% per annum. Any unpaid principal amount and any accrued interest is due on June 29, 2023. Mr. Schadel may demand payment of all or any portion of the outstanding principal and interest at any time. During the year ended June 30, 2023, digital assets with a fair value of $7,502 was transferred to the Promissory Note holder to repay principal. The Promissory Note is unsecured and there is no prepayment penalty. At June 30, 2023 and 2022, there was accrued interest payable of $1 and $0, respectively.\nOn August 12, 2022, the Company issued a Promissory Note in the principal amount of $50,000 (the Promissory Note) for cash to Laborsmart Inc. (Laborsmart). Laborsmart is owned by Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 5.00% per annum. Any unpaid principal amount and any accrued interest is due on August 12, 2023. Laborsmart may demand payment of all or any portion of the outstanding principal and interest at any time. The Promissory Note is unsecured and there is no prepayment penalty. In event the Promissory Note is not paid when due, any outstanding principal and interest will accrue interest of 12% per annum. During the year ended June 30, 2023, the Company repaid $20,000 in cash for principal. At June 30, 2023 and 2022, there was accrued interest payable of $1,936 and $0, respectively.\nNOTE 9 - CONVERTIBLE PROMISSORY NOTES\nConvertible Promissory Notes\nOn May 10, 2022, the Company issued a Convertible Promissory Note in the principal amount of $20,000 (the Convertible Promissory Note), for cash, to Timothy Hackbart. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on May 10, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of the Holder, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.14 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $20,000 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $3,998 and $559, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $15,442 and $19,441, respectively, to be amortized through May 2027 and accrued interest payable of $741 and $0, respectively.\nConvertible Promissory Notes - Related Party\nOn March 4, 2022, the Company issued a Convertible Promissory Note in the principal amount of $40,874 (the Convertible Promissory Note), for value received being comprised of one bitcoin, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.5% per annum. Any unpaid principal amount and any accrued interest is due on March 4, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.125 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $40,874 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $8,170 and $2,641, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $30,062 and $38,233, respectively, to be amortized through March 2027 and accrued interest payable of $659 and $0, respectively.\nOn March 10, 2022, the Company issued a Convertible Promissory Note in the principal amount of $59,986 (the Convertible Promissory Note), for value received being comprised of 22.86012412 Ether, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on March 10, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.142 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $59,986 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $11,991 and $3,679 respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $44,316 and $56,307, respectively, to be amortized through March 2027 and accrued interest payable of $967 and $0, respectively.\nOn May 6, 2022, the Company issued a Convertible Promissory Note in the principal amount of $100,000 (the Convertible Promissory Note), for cash, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on May 6, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.145 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $100,000 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $19,989 and 3,012, respectively, discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $76,999 and $96,988, respectively, to be amortized through May 2027 and accrued interest payable of $1,612 and $0, respectively.\nOn May 9, 2022, the Company issued a Convertible Promissory Note in the principal amount of $100,000 (the Convertible Promissory Note), for cash, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on May 9, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.1415 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $100,0000 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $19,989 and $2,848, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $77,165 and $97,152, respectively, to be amortized through May 2027 and accrued interest payable of $1,611 and $0, respectively.\nNOTE 10 - SHAREHOLDERS EQUITY (DEFICIT)\nOn December 15, 2021, the Company filed with the Nevada Secretary of State amended and restated articles of incorporation. The amended and restated articles had the effect of (i) increasing the Companys authorized common stock to 100 million shares, (ii) increasing the Companys authorized preferred stock to 20 million shares, and (iii) reducing the par value of each of the Companys common stock and preferred stock to $0.0001 per share. Common stock and additional paid-in capital for all periods presented in these consolidated financial statements have been adjusted retroactively to reflect the reduction in par value.\nOn March 11, 2022, the Company filed with the State of Nevada a certificate of designations for the Companys Series A Convertible Preferred Stock (Series A Stock). The Series A Certificate of Designations provides (i) the number of authorized shares will be 100, (ii) each share will have a stated value of $50,000, (iii) each share is convertible into 100,000 shares of Company common stock, subject to a 9.99% equity blocker, (iv) shares are non-voting, and (v) shares are not entitled to receive dividends or distributions.\nOn April 7, 2023, the Company agreed to issue 500,000 shares of common stock with a fair value of $18,000 for website development services.\nOn June 12, 2023, the Company agreed to issue 5,000,000 shares of common stock with a fair value of $240,000 for an investment in Boring Brew LLC and Bored Coffee Lab LLC (See Note 3 - Business Acquisition).\nWarrants\nOn March 16, 2022, the Company entered into Stock Purchases Agreements whereby the Company issued 22 shares to Series A Stock and various Warrants for $1,100,000 in cash. The Warrants comprise of 2,200,000 Company common stock issuable at $0.13 per share, 2,200,000 Company common stock issuable at $0.15 per share and 2,200,000 Company common stock issuable at $0.175 per share. Upon issuance on March 16, 2022, the Warrant remains exercisable for a period of five years.\nOn August 12, 2022, the Company issued a common stock purchase warrant in conjunction with a Promissory Note. The Warrant comprise of 20,000 Company common stock issuable at $0.075 per share. Upon issuance on August 12, 2022, the Warrant remains exercisable for a period of three years.\nThe weighted average remaining legal life of the warrants outstanding at June 30, 2023 is 3.70 years.\nForward Stock Split\nOn July 15, 2022, the Companys director and shareholders approved an amendment of the Companys Articles of Incorporation that would effect a 10-for-1 forward stock split of the Companys common stock (the Forward Split). The Forward Split is subject to clearance by the Financial Industry Regulatory Authority (FINRA), and the Company will not effect the Forward Split until it is cleared by FINRA. On September 11, 2023, the Financial Industry Regulatory Authority, Inc. notified us that the Forward Split would take effect on September 19, 2023. All common stock share and per-share amounts for all periods presented in these consolidated financial statements have been adjusted retroactively to reflect the Forward Split.\nNOTE 11 - INCOME TAXES\nThe Company had no income tax expense due to operating losses incurred for the years ended June 30, 2023 and 2022.\nUnited States\nModifications for net operating losses (NOL): Under Code Section 172(a) the amount of the NOL deduction is equal to the lesser of (a) the aggregate of the NOL carryovers to such year and NOL carrybacks to such year, or (b) 80% of taxable income computed without regard to the deduction allowable in this section. Thus, NOLs are currently subject to a taxable-income limitation and cannot fully offset income. The Act temporarily removes the taxable income limitation to allow an NOL to fully offset income.\nModifications of limitation on business interest: The 2017 Tax Cuts and Jobs Act of 2017 (TCJA) generally limited the amount of business interest allowed as a deduction to 30% of adjusted taxable income. The Act temporarily and retroactively increases the limitation on the deductibility of interest expense under Code Section 163(j)(1) from 30% to 50% for tax years beginning in 2019 and 2020. (Code Section 163(j)(10)(A)(i) as amended by Act Section 2306(a)).\nThe Company has not recorded the necessary provisional adjustments in the consolidated financial statements in accordance with its current understanding of the CARES Act and guidance currently available as of this filing. But is reviewing the CARES Act potential ramifications.\nThe tax effects of temporary differences and tax loss and credit carry forwards that give rise to significant portions of deferred tax assets and liabilities on June 30, 2023 and 2022 are comprised of the following:\nSCHEDULE OF DEFERRED TAX ASSETS AND LIABILITIES\nYear Ended\nJune 30, 2023 Year Ended\nJune 30, 2022\nDeferred tax assets:\nNet-operating loss carryforward $ 287,503 $ 259,803\nTotal deferred tax assets 287,503 259,803\nValuation allowance (287,503 ) (259,803 )\nDeferred tax assets, net of allowance $ - $ -\nSCHEDULE OF PROVISION FOR INCOME TAXES\nYear Ended\nJune 30, 2023 Year Ended\nJune 30, 2022\nFederal\nCurrent $ - $ -\nDeferred 287,503 259,803\nState - -\nCurrent - -\nDeferred - -\nChange in valuation allowance (287,503 ) (259,803 )\nIncome tax provision $ - $ -\nWe have a net operating loss (NOL) carry forward for U.S. income tax purposes aggregating approximately $1,369,100 as of June 30, 2023, subject to the Internal Revenue Code Section 382/383, which places a limitation on the amount of taxable income that can be offset by net operating losses after a change in ownership.\nIn assessing the realization of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the period in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income and taxing strategies in making this assessment. In case the deferred tax assets will not be realized in future periods, the Company has provided a valuation allowance for the full amount of the deferred tax assets on June 30, 2023. The valuation allowance increased by approximately $27,700 as of June 30, 2023.\nThe expected tax expense (benefit) based on the U.S. federal statutory rate is reconciled with actual tax expense (benefit) as follows:\nSCHEDULE OF EFFECTIVE INCOME TAX RATE\nYear Ended\nJune 30, 2023 Year Ended\nJune 30, 2022\nStatutory Federal Income Tax Rate 21 % 21 %\nNon-deductible expenses (16 )% (5 )%\nChange in valuation allowance (5 )% (16 )%\nIncome tax provision $ - $ -\nThe Company has not identified any uncertain tax positions requiring a reserve as of June 30, 2023.\nNOTE 12 - SUBSEQUENT EVENTS\nLoan Agreement\nOn July 10, 2023, the Company entered into a loan agreement with Restore Franchise Group, LLC. Under the loan agreement the Company was advanced $30,000 in cash. The loan bears interest at 3% per annum, is due in one year and is unsecured. The managing member of Restore Franchise Group, LLC is Ryan Schadel, the sole director and officer of the Company. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nRyan Schadel, our Chief Executive Officer and Chief Financial Officer evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2023. The term disclosure controls and procedures, as defined in Rule 13a-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost benefit relationship of possible controls and procedures. Based on the evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were not effective as of June 30, 2023 because of material weaknesses in our internal control over financial reporting, described below in Managements Report on Internal Control Over Financial Reporting. Notwithstanding the identified material weaknesses, management believes the financial statements included in this Annual Report on Form 10-K fairly represent in all material respects our financial condition, results of operations and cash flows at and for the periods presented in accordance with U.S. GAAP.\nManagements Report on Internal Control Over Financial Reporting\nMr. Schadel, as our Chief Executive Officer and Chief Financial Officer, is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rule 13a-15(f) under the Exchange Act. An evaluation of the effectiveness of the Companys internal control over financial reporting was performed as of June 30, 2023. The evaluation was based on the framework in 2013 Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nBased on our evaluation under the criteria set forth in 2013 Internal Control - Integrated Framework, our Chief Executive Officer and Chief Financial Officer concluded that, as of June 30, 2023, our internal control over financial reporting was not effective because of the identification of material weaknesses described as follows:\n● We did not have controls designed to validate the completeness and accuracy of underlying data used in the determination of accounting transactions. As a result, errors were identified in the underlying data used to support accounting transactions. Accordingly, we believe we have a material weakness because there is a reasonable possibility that a material misstatement to the interim or annual financial statements would not be prevented or detected on a timely basis.\n● We do not have written documentation of our internal control policies and procedures. Written documentation of key internal controls over financial reporting is a requirement of Section 404 of the Sarbanes-Oxley Act which is applicable to us. Management evaluated the impact of our failure to have written documentation of our internal controls and procedures on our assessment of our disclosure controls and procedures and has concluded that the control deficiency that resulted represented a material weakness.\n● We do not have sufficient segregation of duties within accounting functions, which is a basic internal control. Due to our size and nature, segregation of all conflicting duties may not always be possible and may not be economically feasible. However, to the extent possible, the initiation of transactions, the custody of assets and the recording of transactions should be performed by separate individuals. Management evaluated the impact of our failure to have segregation of duties on our assessment of our disclosure controls and procedures and has concluded that the control deficiency that resulted represented a material weakness.\n● We have an inadequate number of personnel with requisite expertise in the key functional areas of finance and accounting.\n● We do not have a functioning audit committee or outside directors on our board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures.\nRemediation Plan for Material Weaknesses in Internal Control over Financial Reporting\nManagement of the Company is committed to improving its internal controls and subject to sufficient financial resources being available will (i) continue to use third party specialists to address shortfalls in staffing and to assist the Company with accounting and finance responsibilities; (ii) increase the frequency of independent reconciliations of significant accounts which will mitigate the lack of segregation of duties until there is sufficient personnel; and, (iii) may consider appointing outside directors and audit committee members in the future.\nManagement has discussed the material weaknesses noted above with our independent registered public accounting firm. Due to the nature of these material weaknesses, it is reasonably possible that misstatements that could be material to the annual or interim financial statements could occur that would not be prevented or detected during our financial close and reporting process.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only managements report in this annual report.\nChanges in Internal Controls Over Financial Reporting\nThere have been no changes in our internal controls over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) or in other factors that materially affected or are reasonably likely to materially affect our internal controls and procedures over financial reporting during the fourth quarter of the fiscal year ended June 30, 2023. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nInformation Regarding Our Board of Directors\nPursuant to our bylaws, the number of directors is fixed and may be increased or decreased from time to time by resolution of our Board of Directors (the Board). The Company currently has one individual serving on the Board. The Company will seek to fill vacancies on the Board as it executes on its business plan and is able to fund the cost of errors and omissions insurance coverage for the Board.\nInformation with respect to our current directors is shown below.\nName\nAge\nDirector Since\nPosition(s) Held\nRyan Schadel\nChief Executive Officer, Chief Financial Officer and Director\nSet forth below is a brief description of the background and business experience of our executive officers and directors for the past five years.\nRyan Schadel. Mr. Schadel has served as our Chief Executive Officer, Chief Financial Officer and a member of our board of directors since acquiring voting control on September 2, 2021. Prior to this, Mr. Schadel served as a CEO of Labor Smart, Inc., a blue collar staffing company, from May 2011 to February 2021.\nFamily Relationships\nNone\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n● been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n● had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n● been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n● been found by a court of competent jurisdiction in a civil action or by the Securities and Exchange Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n● been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n● been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nExcept as set forth in our discussion below in Certain Relationships and Related Transactions, none of our directors or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the Commission.\nCorporate Governance\nBoard Committees and Charters\nAudit Committee\nWe do not currently have a separately constituted audit committee. We will consider forming an Audit Committee in fiscal 2023 and if appropriate will commence a search for new qualified board members, one of whom will meet the definition of an audit committee financial expert. The board of directors will also consider adopting a written audit committee charter.\nCompensation Committee\nWe do not currently have a separately constituted compensation committee. Our board of directors has not yet determined whether to create a compensation committee.\nNominating Committee\nWe do not currently have a separately constituted nominating committee. Our board of directors has not yet determined whether to create a nominating committee.\nCode of Business Conduct\nWe have not yet adopted a Code of Business Conduct, which would apply to our chief executive officer and chief financial officer, or to all directors and employees. Our board of directors plans to adopt a Code of Business Conduct as soon as practicable.\nBoard Diversity\nWhile we do not have a formal policy on diversity, our board of directors considers diversity to include the skill set, background, reputation, type and length of business experience of our board of directors members, as well as, a particular nominees contributions to that mix. Our board of directors believes that diversity brings a variety of ideas, judgments, and considerations that can benefit our shareholders and us.\nStockholder Communications\nWe do not have a formal policy regarding communications with our board of directors, or for the consideration of director candidates recommended by shareholders. To date, no shareholders have made any such recommendations. ITEM 11. EXECUTIVE COMPENSATION\nThere was no executive compensation for the fiscal years ended June 30, 2023 and 2022, respectively.\nOutstanding Equity Awards At Fiscal Year-End\nAs of June 30, 2023 and 2022, respectively, there were no outstanding equity awards. At this time, we have no plans to adopt any equity award program, though that could change in the future.\nDirector Compensation\nFor the years ended June 30, 2023, and 2022, there was no director compensation. At this time we have no plans to compensate our directors, though that could change in the future.\nExecutive Employment Agreements and Change-in-Control Arrangements\nWe have not entered into employment agreements or change-in-control arrangements with any of our executive officers. Each of our executive officers is an at-will employee, and their employment relationship with us may be terminated at any time.\nMr. Schadel has agreed to work with no remuneration until such time as the Company receives sufficient revenues necessary to provide management salaries. At this time, we cannot accurately estimate when sufficient revenues will occur to implement this compensation, or what the amount of the compensation will be.\nThere are no annuity, pension or retirement benefits proposed to be paid to officers, directors or employees in the event of retirement at normal retirement date pursuant to any presently existing plan provided or contributed to by the Company or any of its subsidiaries if any. ITEM 12. SECURITY OWNERSHIP OF BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table provides information regarding the beneficial ownership of our common stock as of September 30, 2023, which is also referred to herein as the Evaluation Date, by: (i) each person or group who is known by us to beneficially own more than 5% of our common stock; (ii) each of our current directors; (iii) each of our named executive officers as set forth in Item 11 of this Annual Report; and, (iv) all such directors and executive officers as a group. The table is based upon information supplied by our officers, directors and principal shareholders and a review of Schedules 13D and 13G, if any, filed with the SEC. Unless otherwise indicated in the footnotes to the table and subject to community property laws where applicable, we believe that each of the shareholders named in the table has sole voting and investment power with respect to the shares indicated as beneficially owned.\nApplicable percentages are based on 66,322,140 shares outstanding as of the Evaluation Date, adjusted as required by rules promulgated by the SEC. These rules generally attribute beneficial ownership of securities to persons who possess sole or shared voting power or investment power with respect to those securities. In addition, the rules include shares of our common stock issuable pursuant to the exercise of stock options or warrants that are either immediately exercisable or exercisable within 60 days of the Evaluation Date. These shares are deemed to be outstanding and beneficially owned by the person holding those options for the purpose of computing the percentage ownership of that person, but they are not treated as outstanding for the purpose of computing the percentage ownership of any other person.\nCommon Stock Series A Convertible Preferred Stock\nBeneficial Owner (1) Number of Shares Beneficially Owned Percentage of Class (2) Number of Shares Beneficially Owned (4) Percentage of Class (3)\nRyan Schadel, Chief Executive Officer, Chief Financial Officer, Sole Director 42,476,660 (4) 64.05 % - 0.00 %\nAll executive officers and directors as a group (1 person) 42,476,660 64.05 % - 0.00 %\nEddy Rodriguez 5,000,000 7.54 % - 0.00 %\nTimothy Hackbart - 0.00 % 9.10 %\nTom Zarro - 0.00 % 45.45 %\nDaniel Giancola - 0.00 % 45.45 %\nNotes:\n(1) Unless otherwise noted, the address of the reporting person is c/o Metavesco, Inc., 410 Peachtree Pkwy, Suite 4245, Cumming, GA 30041\n(2) Based on 66,322,140 shares of common stock outstanding as of September 30, 2023 and shares of common stock that the reporting person has the right to acquire within 60 days from the date thereof.\n(3) Based on 22 shares of Series A Convertible Preferred Stock outstanding as of September 30, 2023.\n(4) Each share of our Series A Convertible Preferred Stock converts into 100,000 shares of our common stock. Series A Convertible Preferred Stock are non-voting. Holders of Series Preferred Stock holdings in shares of common stock of the Company may not exceed 9.99%. This limitation may be waived by the Holder with 61 days prior notice. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nCertain Relationships and Related Transactions\nRoran Obligations\nOn September 19, 2017, the Company entered into a Convertible Loan Agreement with Roran (the Loan Agreement). Pursuant to the Loan Agreement, Roran agreed to loan the Company an amount not to exceed a total of $150,000 in principal over 18 months. On June 17, 2019, the Company amended the Loan Agreement increasing the loan amount to $200,000 and extending the maturity date to September 19, 2019. Each advance under the Loan Agreement will be documented under a Convertible Promissory Note issued by the Company in favor of Roran (the Note). The Note bears interest at the rate of 12% per annum. Roran has the right to convert all or any portion of the Note into shares of the Companys common stock at a conversion price equal to 60% of the share price. The Company recorded a BCF due to the conversion option of $116,800, which has been fully amortized as of September 30, 2019. The debt discount has been amortized as interest expense through September 30, 2019. On December 13, 2019, the Company amended its Loan Agreement Note with Roran as follows: (i) the total amount to be loaned was increased to $250,000, and (ii) the maturity date was extended to June 19, 2020. Although the maturity date has passed, Roran has agreed to extend the loan and advance additional funds until further negotiations have been concluded. On June 8, 2020, Roran converted $124,500 principal amount of its promissory note with the Company and $25,500 of accrued and unpaid interest thereon, totaling $150,000, into 41,666,660 shares of Company Common Stock at the stated conversion price per share of $0.0036. The remaining balance due on the promissory note, as of the conversion date, was $104,838 in principal and $19,988 in interest. As a result of the advances made pursuant to the Loan Agreement, the Company has incurred total obligations of $149,838 as of June 30, 2021 (net of debt discounts and exclusive of accrued interest).\nDuring the year ended June 30, 2023, Roran made non-interest bearing, unsecured, short-term cash advances to the Company totaling $18,367 for the purpose of paying all accounts payable before the closing date of the SPA.\nOn September 2, 2021, the Company entered into a Stock Purchase Agreement (the SPA) by and between (i) the Company (ii) Ryan Schadel (Buyer) and (iii) Roran Capital LLC (Roran). Roran agreed to sell to the Buyer 42,476,660 shares of common stock of the Company held by Roran for a total purchase price of $385,000. In conjunction with the SPA, Roran agreed to forgive all amounts due to Roran by the Company totaling $207,644, which is comprised of convertible note payable - related party, accrued interest payable - related party and advances from related party. In accordance with ASC 470-50-40-2, the resulting forgiveness of convertible note payable, accrued interest and advances - related party of $207,644 is recorded as an increase in additional paid-in capital within the consolidated statements of shareholders equity (deficit), as the debt forgiven is in essence a capital transaction.\nDebts forgiven by Roran on\nSeptember 2, 2021\nConvertible note payable - related party $ 149,838\nInterest on convertible note payable - related party 39,439\nAdvance from related party 18,367\nForgiveness of convertible note payable, accrued interest and advances - related party $ 207,644\nDemand Promissory Note - Related Parties\nOn October 18, 2021, the Company issued a Promissory Note in the principal amount of $100,000 (the Promissory Note) for cash to Ryan Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 0.01% per annum. Any unpaid principal amount and any accrued interest was due on October 18, 2022. On August 29, 2022, the Company entered into an Amendment to Promissory Note, dated August 29, 2022, with the Holder. Pursuant to the terms of the note amendment, the maturity date of the Promissory Note was extended to October 23, 2023, and the interest rate of the Promissory Note was increased to 5% as of and following August 29, 2022. As consideration for extension of the maturity date, the Company agreed to issue to Mr. Schadel 150,000 shares of the Companys common stock with a fair value of $9,000. These shares were payable and reported as shares to be issued as of the date of this Report. The note amendment resulted in a change in the cash flows of less than 10%. Therefore, the Promissory Note is not considered to be substantially different in accordance with ASC 470-50-10-10 and applied the modification accounting model in accordance with ASC-50-40-17 (b). During the years ended June 30, 2023 and 2022, $6,614 and $0, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $2,386, and $0, respectively, to be amortized through October 2023 and accrued interest payable of $2,080 and $0, respectively.\nOn June 29, 2022, the Company issued a Promissory Note in the principal amount of $40,000 (the Promissory Note) for cash to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 0.01% per annum. Any unpaid principal amount and any accrued interest is due on June 29, 2023. Mr. Schadel may demand payment of all or any portion of the outstanding principal and interest at any time. During the year ended June 30, 2023, digital assets with a fair value of $7,502 was transferred to the Promissory Note holder to repay principal. The Promissory Note is unsecured and there is no prepayment penalty. At June 30, 2023 and 2022, there was accrued interest payable of $1 and $0, respectively.\nOn August 12, 2022, the Company issued a Promissory Note in the principal amount of $50,000 (the Promissory Note) for cash to Laborsmart Inc. (Laborsmart). Laborsmart is owned by Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Promissory Note bears interest at the rate of 5.00% per annum. Any unpaid principal amount and any accrued interest is due on August 12, 2023. Laborsmart may demand payment of all or any portion of the outstanding principal and interest at any time. The Promissory Note is unsecured and there is no prepayment penalty. In event the Promissory Note is not paid when due, any outstanding principal and interest will accrue interest of 12% per annum. During the year ended June 30, 2023, the Company repaid $20,000 in cash for principal. At June 30, 2023 and 2022, there was accrued interest payable of $1,936 and $0, respectively.\nConvertible Promissory Notes - Related Party\nOn March 4, 2022, the Company issued a Convertible Promissory Note in the principal amount of $40,874 (the Convertible Promissory Note), for value received being comprised of one bitcoin, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.5% per annum. Any unpaid principal amount and any accrued interest is due on March 4, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.125 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $40,874 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $8,170 and $2,641, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $30,062 and $38,233, respectively, to be amortized through March 2027 and accrued interest payable of $659 and $0, respectively.\nOn March 10, 2022, the Company issued a Convertible Promissory Note in the principal amount of $59,986 (the Convertible Promissory Note), for value received being comprised of 22.86012412 Ether, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on March 10, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.142 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $59,986 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $11,991 and $3,679 respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $44,316 and $56,307, respectively, to be amortized through March 2027 and accrued interest payable of $967 and $0, respectively.\nOn May 6, 2022, the Company issued a Convertible Promissory Note in the principal amount of $100,000 (the Convertible Promissory Note), for cash, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on May 6, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.145 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $100,000 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $19,989 and 3,012, respectively, discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $76,999 and $96,988, respectively, to be amortized through May 2027 and accrued interest payable of $1,612 and $0, respectively.\nOn May 9, 2022, the Company issued a Convertible Promissory Note in the principal amount of $100,000 (the Convertible Promissory Note), for cash, to Mr. Schadel, the Companys Chief Executive Officer, sole director and majority stockholder. The Convertible Promissory Note bears interest at the rate of 3.25% per annum. Any unpaid principal amount and any accrued interest is due on May 9, 2027. The Convertible Promissory Note is unsecured and there is no prepayment penalty. At the option of Mr. Schadel, the Convertible Promissory Note is convertible into shares of the Companys common stock at a conversion price of $0.05 per share. The closing price of the Companys common stock was $0.1415 per share on the date the Convertible Promissory Note was issued. As a result of the conversion price being lower than the market price of the Companys common stock on the date of issuance, the Company recognized a beneficial conversion feature of $100,0000 upon issuance. The Company recorded the beneficial conversion feature as a discount (up to the face amount of the applicable note) to be amortized over the life of the related note. During the years ended June 30, 2023 and 2022, $19,989 and $2,848, respectively, of discount amortization is included in interest expense. At June 30, 2023 and 2022, there was an unamortized discount balance of $77,165 and $97,152, respectively, to be amortized through May 2027 and accrued interest payable of $1,611 and $0, respectively.\nRestore Franchise Group Loan\nOn July 10, 2023, the Company entered into a loan agreement with Restore Franchise Group, LLC. Under the loan agreement the Company was advanced $30,000 in cash. The loan bears interest at 3% per annum, is due in one year and is unsecured. The managing member of Restore Franchise Group, LLC is Ryan Schadel, the sole director and officer of the Company.\nDirector Independence\nWe are not currently subject to listing requirements of any national securities exchange or inter-dealer quotation system which has requirements that a majority of the board of directors be independent and, as a result, we are not at this time required to have our Board of Directors comprised of a majority of independent directors. ITEM 14 PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table provides information regarding the fees billed to us by Hudgens CPA, PLLC and Haskell & White LLP in the years ended June 30, 2023, and 2022. All fees described below were approved by the Board:\nFor the years ended June 30,\nAudit Fees (1) $ 41,400 $ 28,400\nAudit Related Fees (2) - -\nTax Fees (3) - -\nAll Other Fees (4) - -\nTotal Fees: $ 41,400 $ 28,400\n(1) Audit Fees include fees for services rendered for the audit of our consolidated financial statements, included in our Annual Report on Form 10-K. On April 13, 2022, Haskell & White LLP resigned as the Companys independent registered public accounting firm. On April 29, 2022, the Board of Directors of the Company appointed Hudgens CPA, PLLC as the Companys new independent registered public accounting firm. Audit Fees attributable to Hudgens CPA, PLLC and Haskell & White LLP in 2023 is $41,400 and $9,000, respectively and in 2022 is $4,250 and $24,150, respectively.\n(2) Audit Related Fess consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our consolidated financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the SEC and other accounting consulting.\n(3) Tax Fees consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\n(4) All Other Fees consists of fees for other miscellaneous items.\nPre-Approval Policies and Procedures\nThe policy of our Board is to pre-approve all audit and permissible non-audit services provided by our independent auditors. These services may include audit services, audit-related services, tax services, and other services. Pre-approval is generally provided for up to one year and any pre-approval is detailed as to the particular service or category of services. The independent auditor and management are required to periodically report to the Board regarding the extent of services provided by the independent auditor in accordance with this pre-approval. Any proposed services not included within the list of pre-approved services or any proposed services that will cause the Company to exceed the pre-approved aggregate amount requires specific pre-approval by the Board.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) (1) The Companys consolidated financial statements and related notes thereto are listed and included in this Annual Report (Item 8).\n(2) Schedules are omitted because they are not applicable or the required information is shown in the consolidated financial statements or notes thereto.\n(3) The exhibits listed in the attached Exhibit Index are filed as part of this Annual Report pursuant to Item 601 of Regulation S-K.\nITEM 16. FORM 10-K SUMMARY\nNone.\nEXHIBIT INDEX\nExhibit Number\nDescription\n3.1\nAmended and Restated Articles of Incorporation (incorporated by reference to Exhibit 3.1 to the registrants Current Report on Form 8-K filed with the Commission on December 21, 2021).\n3.2\nCertificate of Designations for the Series A Preferred Stock, filed with the Nevada Secretary of State on March 11, 2022 (incorporated by reference to Exhibit 3.1 to the registrants Current Report on Form 8-K filed with the Commission on March 15, 2022).\n3.3\nCertificate of Amendment to the registrants Amended and Restated Articles of Incorporation (incorporated by reference to Exhibit 3.1 to the registrants Current Report on Form 8-K filed with the Commission on May 24, 2022).\n3.4\nAmendment to Articles of Incorporation if the registrant, dated September 11, 2023. (incorporated by reference to Exhibit 3.1 to the registrants Current Report on Form 8-K filed with the Commission on September 12, 2023).\n3.5\nAmended and Restated Bylaws (incorporated by reference to Exhibit 3.2 to the registrants Current Report on Form 8-K filed with the Commission on December 21, 2021).\n10.1\nSecurities Purchase Agreement, dated as of September 2, 2021, by and between the Company, Ryan Schadel, and Roran Capital LLC (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on September 9, 2021).\n10.2\nDebt Forgiveness Agreement and Cancellation of Note dated September 2, 2021 by and between the Company and Roran Capital LLC (incorporated by reference to Exhibit 10.2 to the registrants Current Report on Form 8-K filed with the Commission on September 9, 2021)\n10.3\nPromissory Note, dated October 18, 2021, issued by the registrant to Ryan Schadel (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on October 21, 2021).\n10.4\nConvertible Promissory Note, dated March 4, 2022, issued by the registrant in favor of Ryan Schadel (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on March 7, 2022).\n10.5\nConvertible Promissory Note, dated March 10, 2022, issued by the registrant in favor of Ryan Schadel (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on March 11, 2022).\n10.6\nSecurities Purchase Agreement by and among Waterside Capital Corporation and Buyer #1 dated as of March 16, 2022 (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.7\nCommon Stock Purchase Warrant #1 issued to Buyer #1 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.30 per share (incorporated by reference to Exhibit 10.2 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.8\nCommon Stock Purchase Warrant #2 issued to Buyer #1 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.50 per share (incorporated by reference to Exhibit 10.3 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.9\nCommon Stock Purchase Warrant #3 issued to Buyer #1 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.75 per share (incorporated by reference to Exhibit 10.4 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.10\nSecurities Purchase Agreement by and among Waterside Capital Corporation and Buyer #2 dated as of March 16, 2022 (incorporated by reference to Exhibit 10.5 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.11\nCommon Stock Purchase Warrant #1 issued to Buyer #2 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.30 per share (incorporated by reference to Exhibit 10.6 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.12\nCommon Stock Purchase Warrant #2 issued to Buyer #2 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.50 per share (incorporated by reference to Exhibit 10.7 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.13\nCommon Stock Purchase Warrant #3 issued to Buyer #2 on March 16, 2022 for 1,000,000 shares of Common Stock of Waterside Capital Corporation (incorporated by reference to Exhibit 10.8 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.14\nSecurities Purchase Agreement by and among Waterside Capital Corporation and Buyer #3 dated as of March 16, 2022 (incorporated by reference to Exhibit 10.9 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.15\nCommon Stock Purchase Warrant #1 issued to Buyer #3 on March 16, 2022 for 200,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.30 per share (incorporated by reference to Exhibit 10.10 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.16\nCommon Stock Purchase Warrant #2 issued to Buyer #3 on March 16, 2022 for 200,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.50 per share (incorporated by reference to Exhibit 10.11 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.17\nCommon Stock Purchase Warrant #3 issued to Buyer #3 on March 16, 2022 for 200,000 shares of Common Stock of Waterside Capital Corporation, at an exercise price of $1.75 per share (incorporated by reference to Exhibit 10.12 to the registrants Current Report on Form 8-K filed with the Commission on March 22, 2022).\n10.18\nConvertible Promissory Note, dated May 6, 2022, issued by the registrant in favor of Ryan Schadel (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on May 10, 2022).\n10.19\nConvertible Promissory Note, dated May 9, 2022, issued by the registrant in favor of Ryan Schadel (incorporated by reference to Exhibit 10.2 to the registrants Current Report on Form 8-K filed with the Commission on May 10, 2022).\n10.20\nNote Purchase Agreement, dated May 10, 2022, by and between the registrant and Timothy Hackbart (incorporated by reference to Exhibit 10.3 to the registrants Current Report on Form 8-K filed with the Commission on May 10, 2022).\n10.21\nConvertible Promissory Note, dated May 10, 2022, issued by the registrant in favor of Timothy Hackbart (incorporated by reference to Exhibit 10.4 to the registrants Current Report on Form 8-K filed with the Commission on May 10, 2022).\n10.22\nDemand Promissory Note, dated June 29, 2022, issued by the registrant in favor of Ryan Schadel (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on July 1, 2022).\n10.23\nNote Purchase Agreement, dated as of August 12, 2022, by and between Metavesco, Inc. and Laborsmart, Inc. (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on August 18, 2022).\n10.24\nDemand Promissory Note issued on August 12, 2022 by Metavesco, Inc. in favor of Laborsmart, Inc. (incorporated by reference to Exhibit 10.2 to the registrants Current Report on Form 8-K filed with the Commission on August 18, 2022).\n10.25\nSecurities Purchase Agreement, dated as of August 12, 2022, by and between Metavesco, Inc. and Tom Zarro (incorporated by reference to Exhibit 10.3 to the registrants Current Report on Form 8-K filed with the Commission on August 18, 2022).\n10.26\nDemand Promissory Note issued on August 12, 2022 by Metavesco, Inc. in favor of Tom Zarro (incorporated by reference to Exhibit 10.4 to the registrants Current Report on Form 8-K filed with the Commission on August 18, 2022).\n10.27\nCommon Stock Purchase Warrant issued on August 12, 2022 by Metavesco, Inc. to Tom Zarro (incorporated by reference to Exhibit 10.5 to the registrants Current Report on Form 8-K filed with the Commission on August 18, 2022).\n10.28\nAmendment to Demand Promissory Note, dated as of August 29, 2022, issued by the registrant to Ryan Schadel (incorporated by reference to Exhibit 10.5 to the registrants Current Report on Form 8-K filed with the Commission on September 2, 2022).\n10.29\nLimited Liability Company Interest Purchase Agreement effective as of June 13, 2023 by and between Eddy Rodriguez and Metavesco, Inc. (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on June 20, 2023).\n10.30\nEmployment Agreement dated June 13, 2023, effective as of June 13, 2023 by and between Eddy Rodriguez and Metavesco, Inc. (incorporated by reference to Exhibit 10.2 to the registrants Current Report on Form 8-K filed with the Commission on June 20, 2023).\n10.31\nEmployment Agreement Amendment dated June 15, effective as of June 13, 2023 by and between Eddy Rodriguez and Metavesco, Inc. (incorporated by reference to Exhibit 10.3 to the registrants Current Report on Form 8-K filed with the Commission on June 20, 2023).\n10.32\nLoan Agreement, dated as of July 10, 2023, by and between Metavesco, Inc. and Restore Franchise Group, LLC (incorporated by reference to Exhibit 10.1 to the registrants Current Report on Form 8-K filed with the Commission on July 12, 2023).\n31.1\nCertification of the Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*.\n31.2\nCertification of the Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*.\n32.1\nCertification of the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes Oxley Act of 2002*.\n99.1\nFinal order Approving and Confirming The Receivers Final Report, Terminating The Receivership And Discharging The Receiver, as filed in the United States District Court for The Eastern District of Virginia Norfolk Division on 06-28-2017, incorporated by reference to Exhibit 99.1 to the Registrants Form 10-K as filed with the Securities and Exchange Commissions on April 12, 2018.\n101.INS\nInline XBRL Instance Document*\n101.SCH\nInline XBRL Taxonomy Extension Schema Document*\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document*\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document*\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document*\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document*\nCover Page Interactive Data File (embedded within the Inline XBRL document)*\n*\nFiled herewith.\n**\nIncorporated by reference from the Companys Current Report on Form 8-K filed with the SEC on June 21, 2019.\nSIGNATURES\nIn accordance with the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: October 13, 2023 METAVESCO, INC.\nBy: /s/ Ryan Schadel\nName: RYAN SCHADEL\nTitle: Chief Executive Officer and Chief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report is signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNAME\nTITLE\nDATE\n/s/ Ryan Schadel\nChief Executive Officer, Chief Financial Officer and Sole Director\nOctober 13, 2023\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)"
}