{
    "cik": "928465",
    "company": "AMCON DISTRIBUTING CO",
    "filing_type": "10-K",
    "filing_date": "2023-11-08",
    "period_of_report": "2023-09-30",
    "sic": "5141",
    "state_of_inc": "DE",
    "state_location": "NE",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/928465/0001558370-23-018285-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/928465/000155837023018285/dit-20230930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/928465/0001558370-23-018285.txt",
    "filename": "928465_10K_2023_0001558370-23-018285.htm",
    "content": "ITEM 1. BUSINESS\nCOMPANY OVERVIEW\nAMCON Distributing Company was incorporated in Delaware in 1986 and our common stock is listed on NYSE American under the symbol DIT. The Company operates two business segments:\n● Our wholesale distribution segment (Wholesale Segment) distributes consumer products and provides a full range of programs and services to our customers that are focused on helping them manage their business and increase their profitability. We serve customers in 31 states and primarily operate in the Central, Rocky Mountain, Mid-South and Mid-Atlantic regions of the United States.\n● Our retail health food segment (Retail Segment) operates 17 health food retail stores located throughout the Midwest and Florida.\nWHOLESALE SEGMENT\nOur Wholesale Segment is one of the largest wholesale distributors in the United States serving approximately 7,000 retail outlets including convenience stores, grocery stores, liquor stores, drug stores, and tobacco shops. We currently distribute over 20,000 different consumer products, including cigarettes and tobacco products, candy and other confectionery products, beverages, groceries, paper products, health and beauty care products, frozen and refrigerated products and institutional foodservice products. Convenience stores represent our largest customer category. In December 2022, Convenience Store News ranked us as the sixth (6th) largest convenience store distributor in the United States based on annual sales.\nOur Wholesale Segment offers retailers the ability to take advantage of manufacturer- and Company-sponsored sales and marketing programs, merchandising and product category management services, and the use of information systems and data services that are focused on minimizing retailers investment in inventory, while seeking to maximize their sales and profits. In addition, our wholesale distributing capabilities provide valuable services to both manufacturers of consumer products and convenience retailers. Manufacturers benefit from our broad retail coverage, inventory management, efficiency in processing small orders, and frequency of deliveries. Convenience retailers benefit from our distribution capabilities by gaining access to a broad product line, inventory optimization and merchandising expertise, information systems, and accessing trade credit.\nOur Wholesale Segment operates nine distribution centers located in Illinois, Minnesota, Missouri, Nebraska, North Dakota, South Dakota, Tennessee and West Virginia. These distribution centers, combined with cross-dock facilities, include approximately 1.3 million square feet of permanent floor space. Our principal suppliers include Altria, RJ Reynolds, ITG Brands, Hershey, Kelloggs, Kraft Heinz, and Mars Wrigley. We also market private label lines of water, candy products, batteries, and other products. We do not maintain any long-term purchase contracts with our suppliers.\nOn February 3, 2023, we closed on our acquisition of Henrys Foods, Inc. (Henrys), purchasing substantially all of Henrys operating assets for approximately $54.9 million in cash. Henrys is a wholesale distributor to convenience stores and other retail formats operating in Minnesota, North Dakota, South Dakota, Iowa, and Wisconsin. The acquisition\ncomplemented our Wholesale Segment by expanding our footprint, increasing our product offerings in the foodservice space and bringing our customer-centric service approach to a broader customer base.\nRETAIL SEGMENT\nOur Retail Segment, through our Healthy Edge Retail Group subsidiary, is a specialty retailer of natural/organic groceries and dietary supplements which focuses on providing high quality products at affordable prices, with an exceptional level of customer service and nutritional consultation. All of the products carried in our stores must meet strict quality and ingredient guidelines, and include offerings such as gluten-free and antibiotic-free grocery and meat products, as well as products containing no artificial colors, flavors, preservatives, or partially hydrogenated oils. We design our retail sites in an efficient and flexible small-store format, which emphasizes a high energy and shopper-friendly environment.\nWe operate within the natural products retail industry, which is a subset of the United States grocery industry. This industry includes conventional, natural, gourmet and specialty food markets, mass and discount retailers, warehouse clubs, health food stores, dietary supplement retailers, drug stores, farmers markets, mail order and online retailers, and multi-level marketers.\nOur Retail Segment operates 17 retail health food stores as Chamberlins Natural Foods, Akins Natural Foods, and Earth Origins Market. These stores carry over 36,000 different national and regionally branded and private label products including high-quality natural, organic, and specialty foods consisting of produce, baked goods, frozen foods, nutritional supplements, personal care items, and general merchandise.\nCOMPETITIVE STRENGTHS\nWe believe that we benefit from a number of competitive strengths, including the following:\nIndustry Experience\nThe management teams for both of our business segments include substantial depth in the areas of finance, information technology, business development, retail store support, logistics, sales, and marketing. This experience is beneficial for the management of vendor and customer relationships as well as overall operational execution.\nFlexible Distribution Capabilities and Customer Service Programs\nWholesale distributors typically provide convenience store retailers access to a broad product line, the ability to place small quantity orders, inventory management, and access to trade credit. As a large, full-service wholesale distributor, we offer retailers a wide array of manufacturer- and Company-sponsored sales and marketing programs, merchandising and product category management services, and the use of information systems that are focused on minimizing retailers investment in inventory, while seeking to maximize their sales and profit.\nThe wholesale distribution industry is highly fragmented and historically has consisted of a small number of large, full service wholesale distributors serving multiple geographic regions and a large number of small, privately-owned businesses. Relative to smaller competitors, large distributors such as our Company benefit from several competitive advantages including: increased purchasing power, the ability to service large chain accounts, economies of scale in sales and operations, and the resources to invest in information technology and other productivity-enhancing technologies.\nBroad Product Selection\nOur retail health foods business prides itself in carrying a broad and superior-quality selection of organic and natural food products and vitamin supplements. The breadth of our product offerings, combined with highly trained and knowledgeable in-store associates, has created a loyal customer following where our stores are sought out destinations, providing a personalized shopping experience.\nBUSINESS STRATEGY\nOur business strategy focuses on short, medium, and long-term objectives designed to create shareholder value. Our strategic objectives are:\n● Maximizing liquidity and generating cash flow from operations in the short term.\n● Developing new customer-focused technology applications, expanding our foodservice platform, and investing in our infrastructure in the medium term.\n● Growing both organically and through acquisitions, and expanding our geographic footprint in the long term.\nTo execute this strategy, our Company has rigorous operational processes in place designed to control costs, manage credit risk, monitor inventory levels, and maintain maximum liquidity. The success of our strategy, however, is ultimately dependent on our ability to provide superior service, develop leading edge technologies, and maintain an exceptional array of product offerings.\nPRINCIPAL PRODUCTS\nThe sales of cigarettes represented approximately 62% and 66% of our consolidated revenue in fiscal 2023 and fiscal 2022, respectively. Sales of candy, beverages, foodservice, groceries, health food products, paper products, health and beauty care products, and tobacco products represented approximately 38% and 34% of our consolidated revenue in fiscal 2023 and fiscal 2022, respectively.\nINFORMATION ON SEGMENTS\nInformation about our segments is presented in Note 13 to the Consolidated Financial Statements included in this Annual Report.\nCOMPETITION-Wholesale Segment\nOur Wholesale Segment has a significant presence in the regions in which we operate. There are, however, a number of both national and regional wholesale distributors operating in the same geographical regions as our Company, resulting in a highly competitive marketplace. Our principal competitors are national wholesalers such as McLane Co., Inc. (Temple, Texas) and Performance Food Group (Richmond, Virginia), as well as regional wholesalers such as H.T. Hackney Company (Knoxville, Tennessee) and Imperial Super Regional Distributors (Elmwood, Louisiana) along with a host of smaller grocery and tobacco wholesalers. We also face competition from Amazon™ which pursues a vertical, multi-channel sales strategy targeting both retail consumers and business level customers.\nCompetition within the wholesale distribution industry is primarily based on the range and quality of the services provided, pricing, variety of products offered, and the reliability of deliveries. Our larger competitors principally compete on pricing and breadth of product offerings, while our smaller competitors focus on customer service and their delivery arrangements.\nWe believe our business model positions us to compete with a wide range of competitors including national, regional, and local wholesalers. As the sixth (6th) largest convenience store distributor in the United States based on annual sales (according to Convenience Store News), our wholesale distribution business has sufficient economies of scale to offer competitive pricing as compared to national wholesalers. Additionally, we believe our flexible distribution and support model allows us to provide a high level of service and customized merchandising solutions.\nCOMPETITION-Retail Segment\nNatural food and supplement retailing is an intensely competitive business. We face competition from a variety of sales channels including local, regional, and national retailers, specialty supermarkets, membership clubs, farmers markets, other natural foods stores, and internet and/or digital direct-to-consumer retailers, each of which competes with us on the basis of product selection, quality, customer service, and price.\nThe natural food retail industry is highly fragmented. According to The Natural Foods Merchandiser (NFM), there are approximately 9,800 natural food retail stores operating independently or as part of small retail chains and approximately 21,000 stores when national chains are included. These competitors include companies such as Whole Foods Market, Sprouts Farmers Market, Natural Grocers, General Nutrition Centers and Vitamin Shoppe. We also face competition from AmazonTM and other online competitors which continue to pursue vertical, multi-channel sales strategies targeting both retail consumers and business level customers. We also compete with specialty supermarkets, other independent natural foods store chains, small specialty stores, and restaurants. In recent years, conventional supermarkets and mass market outlets such as Kroger, Albertsons, Walmart, Publix, Aldi, Trader Joes and Costco have significantly increased their offerings of organic and natural products adding another layer of competition.\nSEASONALITY\nSales in the wholesale distribution industry are somewhat seasonal and tend to be higher in warm weather months during which our convenience store customers experience increased customer traffic. The warm weather months generally fall within the Companys third and fourth fiscal quarters. Our retail health food business does not generally experience significant seasonal fluctuations in its business.\nGOVERNMENT REGULATION\nAMCON is subject to regulation by federal, state and local governmental agencies, including but not limited to the U.S. Department of Agriculture (USDA), the U.S. Food and Drug Administration (FDA), the Occupational Safety and Health Administration (OSHA), the Bureau of Alcohol Tobacco and Firearms (ATF) and the U.S. Department of Transportation (DOT). These regulatory agencies generally impose standards for product quality and sanitation, workplace safety, and security and distribution policies.\nThe Company operates in 31 states and is subject to state regulations related to the distribution and sale of cigarettes and tobacco products, generally in the form of licensing and bonding requirements. Additionally, both state and federal regulatory agencies have the ability to impose excise taxes on cigarette and tobacco products. In recent years, a number of states have increased the excise taxes levied on cigarettes and tobacco products. We expect this trend to continue as legislators look for alternatives to fund budget shortfalls and as a mechanism to discourage tobacco product use.\nENVIRONMENTAL MATTERS\nAll of AMCONs facilities and operations are subject to state and federal environmental regulations. The Company believes it is in compliance with all such regulations and is not aware of any violations that could have a material adverse effect on its financial condition or results of operations. Further, the Company has not been notified by any governmental authority of any potential liability or other claim in connection with any of its properties. The costs and effect on the Company to comply with state and federal environmental regulations were not significant during either fiscal 2023 or fiscal 2022.\nEMPLOYEES\nAt September 2023, the Company had 1,276 full-time and 200 part-time employees, which together serve in the following areas:\nManagerial\nAdministrative\nDelivery\nSales & Marketing\nWarehouse\nTotal Employees\n1,476\nApproximately thirty of our wholesale delivery employees in our Quincy, Illinois distribution center are represented by the International Association of Machinists and Aerospace Workers (IAMAW). A new labor agreement has been ratified by the IAMAW through November 2026. We expect this agreement to be executed during the Companys first quarter of fiscal 2024.\nCORPORATE AND AVAILABLE INFORMATION\nThe Companys principal executive offices are located at 7405 Irvington Road, Omaha, Nebraska 68122. The telephone number at that address is 402-331-3727 and our website address is www.amcon.com. We provide free access to the various reports we file with the United States Securities and Exchange Commission (SEC) through our website. These reports include, but are not limited to, our Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q. Please note that any internet addresses provided in this report are for information purposes only and are not intended to be hyperlinks. Accordingly, no information found and/or provided at such internet addresses is intended or deemed to be incorporated by reference herein. The SEC also maintains a website at www.sec.gov which contains reports, proxies and other company information. ITEM 1A. RISK FACTORS\nIN GENERAL\nYou should carefully consider the risks described below before making an investment decision concerning our securities.\nIf any of the following risks actually materialize, our business, financial condition or results of operations could be materially adversely affected. In that case, the trading price of our common stock could decline substantially. This Annual Report also contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of a number of factors, including the risks described below and elsewhere in this Annual Report. See Forward-Looking Statements under Item 7 of this report for a discussion of forward-looking statements.\nRISK FACTORS RELATED TO THE WHOLESALE BUSINESS\n● Regulation of Cigarette, Tobacco and Tobacco-Related Products by the FDA May Negatively Impact Our Operations.\nIn 2009, the Family Smoking Prevention and Tobacco Control Act was signed into law, which granted the FDA the authority to regulate the production, distribution, and marketing of tobacco products in the United States. Specifically, the legislation established an FDA office to regulate changes to nicotine yields, chemicals, flavors, ingredients, and the labeling used to produce and market tobacco products. The FDA office is financed through user fees paid by tobacco companies, which is passed on to wholesale distributors and end consumers in the form of higher costs.\nTo date, most of the regulatory and compliance burden related to this legislation has fallen upon product manufacturers. However, if the FDA were to impose new regulations impacting wholesale distributors that we are not able to comply\nwith, we could face remedial actions such as fines, suspension of product distribution rights, and/or termination of operations. Further, if the FDA were to issue product bans or product restrictions on cigarettes, tobacco or other nicotine delivery devices, our future revenue stream could materially decrease. If any of these items were to occur, our results from operations, cash flow, business, and overall financial condition could be negatively impacted.\n● The Regulation of Vaping Products May Negatively Impact Our Results of Operations.\nThe regulation of vaping product categories by federal, state, and local governmental agencies, as well as potential litigation against product manufacturers and/or entities which distribute or sell such products, may negatively impact our sales, costs, results of operations, and cash flows should the current regulatory environment persist or expand, or if related litigation should arise.\n● Our Sales Volume Is Largely Dependent upon the Distribution of Cigarette Products, Which is a Declining Sales Category.\nThe distribution of cigarettes represents a significant portion of our business. During fiscal 2023, approximately 62% of our consolidated revenues came from the distribution of cigarettes, which generated approximately 19% of our consolidated gross profit. Due to manufacturer price increases, restrictions on advertising and promotions, regulation, higher excise and other taxes, health concerns, smoking bans, and other factors, the demand for cigarettes may continue to decline. If this occurs, our results from operations, cash flow, business, and overall financial condition could be negatively impacted.\n● Cigarettes and Other Tobacco Products Are Subject to Substantial Excise Taxes and If These Taxes Are Increased, Our Sales of Cigarettes and Other Tobacco Products Could Decline.\nCigarette and tobacco products (including vaping products) are subject to substantial excise taxes and future legislation could significantly increase such taxes. Significant increases in cigarette and tobacco-related taxes and fees have been imposed by city, state, and federal governments in recent years. Further, the evolving regulatory responsibilities of the FDA are being funded by fees imposed on tobacco companies. These fees have been passed on to wholesale distributors and end consumers in the form of higher prices for cigarette and tobacco products.\nIncreases in excise taxes and other tobacco-related taxes and fees imposed by the FDA and other governmental authorities may reduce the long-term demand for cigarette and tobacco products and/or result in a sales shift from higher margin premium cigarette and tobacco products to lower margin deep-discount brands, while at the same time increasing the Companys accounts receivable risk and inventory carrying costs. If any of these events were to occur, our results from operations, cash flow, liquidity position, and overall financial condition could be negatively impacted.\n● Divestiture and Consolidation Trends Within the Convenience Store Industry May Negatively Impact Our Operations.\nDivestitures and consolidations within the convenience store industry reflect trends that may result in customer attrition if the acquiring entity is served by another wholesale distributor and we are unable to retain the business. If we were to lose a substantial volume of business because of these trends, our results from operations, cash flow, business, and overall financial condition could be negatively impacted.\n● Volatility in Fuel Prices Could Reduce Profit Margins and May Have an Adverse Effect on Our Business.\nIncreases or decreases in fuel prices impact our profit margins. Inflation can also impact fuel prices. If we are not able to meaningfully pass on these costs to customers, it could adversely impact our business, results of operations, cash flow, and financial condition.\n● The Wholesale Distribution of Convenience Store Products Is Significantly Affected by Pricing Decisions and Promotional Programs Offered by Manufacturers and State Taxing Authorities.\nWe are subject to changes in pricing strategies utilized by manufacturers of the products we distribute. We also receive payments from these manufacturers including allowances, discounts, volume rebates, and other merchandising incentives in connection with various incentive programs. In addition, we receive discounts from states in connection with the purchase of excise stamps for cigarettes. If the pricing strategies of the manufacturers change or the manufacturers or states change or discontinue these promotional programs or we are unable to maintain the volume of our sales, our results of operations, business, cash flow, and financial condition could be negatively affected. There are no assurances that the manufacturers or states will maintain these promotional programs.\n● Competition Within The Wholesale Distribution Industry May Have an Adverse Effect on Our Business.\nThe wholesale distribution industry is highly competitive. There are many distribution companies operating in the same geographical regions as our Company. Our Companys principal competitors are national and regional wholesalers, along with a host of smaller grocery and tobacco wholesalers. We also face competition from Whole Foods Market and/or its parent company Amazon™, which pose a threat to the supply chains of food and grocery retailers as well as convenience stores served by wholesale distribution companies as they continue to pursue a vertical, multi-channel sales strategy whereby both retail consumers and business level customers are targeted. Most of these competitors generally offer a wide range of products at prices comparable to those offered by our Company. Some of our competitors have substantial financial resources and long-standing customer relationships. This competition may reduce our margins and/or cause a loss in market share, adversely impacting our results of operations, cash flow, and financial condition.\n● We Occasionally Purchase Cigarettes From Manufacturers Not Covered by The Tobacco Industrys Master Settlement Agreement (MSA), Which May Expose Us to Certain Potential Liabilities and Financial Risks for Which We Are Not Indemnified.\nIn 1994, the Mississippi attorney general brought an action against various tobacco industry members on behalf of the state to recover state funds paid for health-care costs related to tobacco use. Subsequently, most other states sued the major U.S. cigarette manufacturers based on similar theories. The cigarette manufacturer defendants settled the first four of these cases with Mississippi, Florida, Texas and Minnesota by separate agreements. These states are referred to as non-MSA states. In November 1998, the major U.S. tobacco product manufacturers entered into the MSA with the remaining 46 states, the District of Columbia and certain U.S. territories. The MSA and the other state settlement agreements settled health-care cost recovery actions and monetary claims relating to future conduct arising out of the use of, or exposure to, tobacco products, imposed a stream of future payment obligations on major U.S. cigarette manufacturers and placed significant restrictions on the ability to market and sell cigarettes. The payments required under the MSA resulted in the products sold by the participating manufacturers being priced at higher levels than the products sold by non-MSA manufacturers.\nIn order to limit our potential tobacco-related liabilities, we try to limit our purchases of cigarettes from non-MSA manufacturers for sale in MSA states. The benefits of liability limitations and indemnities we are entitled to under the MSA do not apply to sales of cigarettes manufactured by non-MSA manufacturers. From time-to-time, however, we find it necessary to purchase a limited amount of cigarettes from non-MSA manufacturers. For example, during a transition period while integrating distribution operations from an acquisition we may need to purchase and distribute cigarettes manufactured by non-MSA manufacturers to satisfy the demands of customers of the acquired business. With respect to sales of such non-MSA cigarettes, we could be subject to litigation that could expose us to liabilities for which we would not be indemnified.\n● If the Tobacco Industrys Master Settlement Agreement Is Invalidated, or Tobacco Manufacturers Cannot Meet Their Obligations to Indemnify Us, We Could Be Subject to Substantial Litigation Liability.\nIn connection with the MSA, we are indemnified by many of the tobacco product manufacturers from whom we purchase cigarettes and other tobacco products for liabilities arising from the sale of the tobacco products that they supply to us. However, if litigation challenging the validity of the MSA were to be successful and all or part of the MSA is invalidated, we could be subject to substantial litigation due to the sales of cigarettes and other tobacco products, and we may not be\nindemnified for such costs by the tobacco product manufacturers in the future. In addition, even if we continue to be indemnified by cigarette manufacturers that are parties to the MSA, future litigation awards against such cigarette manufacturers could be so large as to eliminate the ability of the manufacturers to satisfy their indemnification obligations. Our results of operations, business, cash flow, and overall financial condition could be negatively impacted due to increased litigation costs and potential adverse rulings against us.\n● We Face Competition From Sales of Deep-Discount Brands and Other Low Priced Sales of Cigarettes.\nIncreased selling prices for cigarettes and higher cigarette taxes have resulted in the growth of deep-discount cigarette brands, which may be sold by our competitors or other retailers. Deep-discount cigarette brands are brands generally manufactured by companies that are not original participants to the MSA, and accordingly do not have cost structures burdened by the MSA. Since the MSA was signed, the category of deep-discount brands manufactured by smaller manufacturers or supplied by importers has grown substantially. If this growth continues, our business, results of operations, cash flows, and overall financial condition would be negatively impacted.\nRISK FACTORS RELATED TO THE RETAIL BUSINESS\n● Increased Competition in the Retail Health Food Industry May Have an Adverse Effect on Our Business.\nIn our retail health food business, we compete with a wide range of well-financed regional and national competitors such as Whole Foods Markets, Trader Joes, Sprouts Farmers Market, Natural Grocers, Fresh Thyme Farmers Market, General Nutrition Centers, Vitamin Shoppe, and other online competitors such as Amazon™ who all have embarked on aggressive expansion strategies. Additionally, we compete with specialty supermarkets, other independent natural foods store chains, small specialty stores, and restaurants. Conventional supermarkets and mass market outlets such as Kroger, Albertsons, Walmart, and Costco have also significantly increased their offerings of organic and natural products providing another layer of competition. Finally, if online shopping, direct-to-consumer, and home delivery models continue to grow in popularity thereby further disrupting traditional sales channels, it may present a significant direct risk to brick and mortar retailers like the Company. We also face competition from Whole Foods Market and/or its parent company Amazon™, which pose a threat to the supply chains of the grocery and natural foods business as they continue to pursue a vertical, multi-channel sales strategy targeting both retail consumers and business level customers. Most of these competitors may have greater financial and marketing resources than the Company and may be able to devote greater resources to sourcing, promoting, and selling their products. In response to heightened competition, the Company is implementing a repositioning strategy for its retail business. This repositioning strategy calls for a wide range of initiatives including the possible addition of one or more of our new retail store prototypes per year into the foreseeable future. The opening of new retail stores inherently brings additional risk to the business. Further, if our repositioning strategy in response to this increase in competition is not successful, it may have a material adverse effect on our results of operations, business, cash flow, and financial condition, and could potentially result in the impairment of assets within this business segment.\n● Changes in the Availability of Quality Natural and Organic Products Could Impact Our Business.\nThere is no assurance that quality natural and organic products including dietary supplements, fresh and processed foods and vitamins will be available to meet our stores future needs. If conventional supermarkets increase their natural and organic product offerings or if new laws require the reformulation of certain products to meet tougher standards, the supply of these products may be constrained. Any significant disruption in the supply of quality natural and organic products could have a material adverse impact on our overall sales and product costs.\n● Perishable Food Product Losses Could Materially Impact Our Results.\nOur retail stores carry many perishable products which may result in significant product inventory losses in the event of extended power outages, natural disasters, or other catastrophic occurrences.\n● A Reduction in Traffic to Anchor Stores in the Shopping Areas in Close Proximity to Our Stores Could Significantly Reduce Our Sales and Leave Us With Unsold Inventory, Which Could Have a Material Adverse Effect on Our Business, Financial Condition and Results of Operations.\nMany of our stores are located in close proximity to shopping areas that also accommodate other well-known anchor stores. Sales at our stores are derived, in part, from the volume of traffic generated by the other anchor stores in the shopping areas where our stores are located. Customer traffic may be adversely affected by regional economic downturns, a general downturn in the local area where our store is located, long-term nearby road construction projects, the closing of nearby anchor stores or other nearby stores or the decline of the shopping environment in a particular shopping area. Any of these events could reduce our sales and leave us with excess inventory, which could have a material adverse impact on our business, financial condition, and results of operations. In response to such events, we may be required to increase markdowns or initiate marketing promotions to reduce excess inventory, which would further decrease our gross profits and net income.\n● If We Are Unable to Successfully Identify Market Trends and React to Changing Consumer Preferences in a Timely Manner, Our Sales May Decrease.\nWe believe our success depends, in substantial part, on our ability to:\n● anticipate, identify and react to natural and organic grocery and dietary supplement trends and changing consumer preferences in a timely manner;\n● translate market trends into appropriate, saleable product and service offerings in our stores before our competitors; and\n● develop and maintain vendor relationships that provide us access to the newest merchandise on reasonable terms.\nIf we are unable to anticipate and satisfy consumer merchandise preferences in the regions where we operate, our sales may decrease, and we may be forced to increase markdowns of slow-moving merchandise, either of which could negatively impact our business, results of operations, cash flow, and financial condition.\n● If We or Our Third-Party Suppliers Fail to Comply With Regulatory Requirements, or are Unable to Provide Products that Meet Our Specifications, Our Business and Our Reputation Could be Negatively Impacted.\nIf we or our third-party suppliers, including suppliers of our private label products, fail to comply with applicable regulatory requirements or to meet our specifications for quality, we could be required to take costly corrective action and our reputation could be negatively impacted. We do not own or operate any manufacturing facilities, and therefore depend upon independent third-party vendors to produce our private label branded products, such as vitamins, minerals, dietary supplements, body care products, food products and bottled water. Third-party suppliers of our private label products may not maintain adequate controls with respect to product specifications and quality. Such suppliers may be unable to produce products on a timely basis or in a manner consistent with regulatory requirements. Additionally, there are no assurances that we would be successful in finding new third-party suppliers that meet our quality guidelines if needed. If any of these events were to occur, our results from operations, cash flow, liquidity position, and overall financial condition could be negatively impacted.\nRISK FACTORS RELATED TO ALL OF OUR BUSINESSES\n● Significant or Prolonged Periods of Higher Interest Rate Environments May Have an Adverse Effect on Our Profitability.\nInterest rates have a direct impact on our business based on the amount of variable debt the Company utilizes in its operations. Prolonged periods of high interest rates may have a negative impact on the Companys results of operations, balance sheet, and cash flows.\n● We May Be Impacted by Acts of Civil Unrest, or Violence.\nOur business operations could be negatively impacted by acts of civil unrest, or violence beyond our control. Such acts could threaten our supply chain, may result in property damage and/or insurance claims to the facilities of the Company or our customers, impact the safety of our workforce or the workforces of our customers, and may also have indirect impacts on customer demand for the products we sell, or our ability to collect on accounts receivable or finance our operations.\n● A Major Epidemic or Pandemic or other Widespread Public Health Issue Could Adversely Affect Our Results of Operations and Financial Condition.\nThe emergence and spread of a major epidemic or pandemic (such as COVID-19) or other widespread public health issue could affect our employees, suppliers and/or customers and cause disruption in our operations including, but not limited to, travel restrictions, temporary closing of one or more of our distribution warehouses or retail stores, labor shortages, supply chain interruptions, business shutdowns, or regional quarantines. These disruptions could negatively affect our ability to service our customers, could contribute to adverse economic conditions including decreases in demand for the products we distribute, resulting in lower sales and profitability, or could present increased credit risk to the Company from customer credit defaults resulting from an economic downturn. In addition to the potential operational risks described above, disruptions caused by a widespread public health issue could present increased reputational risk to the Company or result in legal claims or costly response measures.\n● We May Be Subject to Risks Associated with Equity Investments or the Acquisition of Assets or New Businesses.\nFrom time to time, one or both of the Companys business segments may acquire assets from other businesses, all or a portion of another business, or make an equity investment in another business through the purchase of equity or other means. The purchase of assets or of all or part of a business or an equity investment in another business can bring significant risks to the Company in a number of areas including purchase price, amount of equity investment, business valuation and recording risks, customer retention risks, risks associated with the assumption of liabilities or obligations, integration risks, technology risks, risks associated with the addition of new employees such as health care costs, and a wide range of other risks and considerations. While the Company strives to minimize the risks associated with its acquisition or equity investment activities, issues may arise which could have a material negative impact on the Companys results of operations, balance sheet, and cash flows.\n● We May Be Subject to Risks Associated with Trade Tariffs.\nThe Company purchases products from a wide range of vendors in both of its businesses. Some of our vendors may import certain products as part of their manufacturing processes and could be impacted by higher costs resulting from trade tariffs. Further, the impact of higher costs at the retail level may negatively impact consumer disposable income and demand. In the event that our product purchase costs from our vendors increase and we cannot pass on those price increases or if the retail level demand for the products we sell decreases, the Companys results of operations, balance sheet, and cash flows could be negatively impacted.\n● Employee Healthcare Benefits Represent a Significant Expense for Our Company and May Negatively Affect Our Profitability.\nHealthcare represents a significant expense item for our Company and there is a general upward trend in healthcare costs nationwide. While we strive to control these costs through modifications to insurance coverage, including co-pays and deductibles, there can be no assurance that we will be as successful in controlling such costs in the future. Continued increases in healthcare costs, as well as changes in laws, regulations, and assumptions used to calculate health and benefit expenses, may adversely affect our business, financial position and results of operations.\n● We May Be Subject to Product Liability Claims That May Have an Adverse Effect on Our Business.\nWe may face exposure to product liability claims if the use of products sold by us is alleged to cause injury or illness. However, product liability insurance may not continue to be available at a reasonable cost, or, if available, may not be adequate to cover all of our liabilities. We generally seek contractual indemnification and insurance coverage from parties supplying the products we sell, but this indemnification or insurance coverage is limited, as a practical matter, to the creditworthiness of the indemnifying party and the insurance limits of any insurance provided by suppliers. If we do not have adequate insurance or if contractual indemnification is not available or if the counterparty cannot fulfill its indemnification obligation, product liability relating to allegedly defective products could have a material adverse impact on our results of operations, cash flow, business, and overall financial condition.\n● We May Be Subject to Risks Associated with Insurance Plans Claims.\nThe Company uses a combination of insurance and self-insurance plans to provide for the potential liabilities for workers compensation, general liability, property insurance, director and officers liability insurance, vehicle liability, and employee health care benefits. Liabilities associated with these risks are estimated by the Company, in part, by considering historical claims experience, demographic factors, severity factors, and other assumptions. Our results could be materially impacted by claims and other expenses related to such insurance plans if future occurrences and claims differ from these assumptions and historical trends.\n● A Deterioration in Economic Conditions May Negatively Impact Sales in Both Our Business Segments.\nOur results of operations and financial condition are particularly sensitive to changes in the overall economy, including the level of consumer discretionary spending. Consumer discretionary spending may be negatively impacted by inflation, rising interest rates, recessions or other general economic uncertainties or downturns. Changes in discretionary spending patterns may decrease demand from our convenience store customers and/or impact the demand for natural food products in our retail health food stores as customers purchase less expensive product alternatives.\nAdditionally, many of our Wholesale Segment customers are thinly capitalized and their access to credit in the current business environment may be impacted by changes in economic conditions, systemic pressures in the banking system, including disruptions in the credit markets, rising interest rates or other factors, which may affect their ability to operate as a going concern, presenting additional credit risk for the Company. A period of economic downturn or economic deterioration could result in lower sales and profitability as well as customer credit defaults.\n● Periods of Significant or Prolonged Inflation or Deflation Affect Our Product Costs and Profitability.\nVolatile product costs have a direct impact on our business. Prolonged periods of product cost inflation may have a negative impact on our profit margins and earnings to the extent that we are unable to pass on all or a portion of such product cost increases to our customers, which may have a negative impact on our business and our profitability. In addition, product cost inflation may negatively impact consumer spending decisions, which could adversely impact our sales. Conversely, our business may be adversely impacted by periods of prolonged product cost deflation because we make a significant portion of our sales at prices that are based on the cost of products we sell plus a percentage markup. As a result, our profit levels may be negatively impacted during periods of product cost deflation, even though our gross profit percentage may remain relatively constant.\n● We Rely Heavily on Information Technology Systems to Operate Our Business. Any Disruptions to These Technology Systems or if These Systems were Made Unavailable for Use, May Have a Material Adverse Effect on Our Business.\nWe rely extensively on our information technology systems and those of third parties to run all aspects of our business. We have had and may have disruptions to our information technology systems due to a number of factors including but not limited to electricity outages, equipment failure, telecommunications failures, security breaches, cyber-attacks, computer viruses, malware or other methods and causes. Although we make efforts to maintain the security, integrity and redundancy of our systems and have implemented various measures to manage the risk of system disruptions or failures, there can be no assurance that our efforts and measures will be effective. If any of our information technology systems or those of third parties on which we rely are damaged or made unavailable to us, it could have a material negative impact on our operations and profits.\n● Adverse Publicity About the Company or Lack of Confidence in The Products We Carry May Have an Adverse Effect on Our Reputation and Reduce Earnings.\nMaintaining a good reputation and public confidence in the products we distribute is critical to our business. Anything that damages that reputation or the publics confidence in the products we carry, whether or not justified, including adverse publicity about the quality, safety or integrity of our products, could quickly and adversely affect our revenues and profits. In addition, such adverse publicity may result in product liability claims, a loss of reputation, and product recalls which could have a material adverse effect on our sales and operations.\n● Impairment Charges for Goodwill or Other Intangible Assets May Have an Adverse Effect on Our Financial Condition and Results of Operations.\nWe annually test goodwill and intangible assets with indefinite useful lives to determine if impairment has occurred. Additionally, interim reviews must be performed whenever events or changes in circumstances indicate that impairment may have occurred. If the testing performed indicates that impairment has occurred, we are required to record a non-cash impairment charge for the difference between the carrying value of the goodwill or other intangible assets and the implied fair value of the goodwill or other intangible assets in the period the determination is made.\nThe testing of goodwill and other intangible assets for impairment requires management to make significant estimates about our future performance and cash flows, as well as other assumptions. These estimates can be affected by numerous factors, including potential changes in economic, industry or market conditions, changes in business operations, changes in competition or changes in our stock price and market capitalization. Changes in these factors, or changes in actual performance compared with estimates of our future performance, may affect the fair value of goodwill or other intangible assets, which may result in impairment charges. Additionally, we may not be able to accurately predict the amount and timing of any impairment of assets. Should the value of goodwill or other intangible assets become impaired, our financial condition and results of operations may be adversely affected.\n● Capital Needed for Expansion May Not Be Available.\nThe acquisition of other distributors or existing retail stores, the development and opening of new retail stores and distribution facilities, and the expansion of existing distribution facilities requires significant amounts of capital. In the past, our growth has been funded primarily through proceeds from bank debt, private placements of equity and debt and internally generated cash flow. These and other sources of capital may not be available to us on satisfactory terms, or at all, in the future, particularly in light of current economic conditions, including systemic pressures in the banking system, disruptions in the credit markets and rising interest rates, which could impair our ability to further expand our business.\n● Covenants in Our Revolving Credit Facilities May Restrict Our Ability to React to Changes Within Our Business or Industry.\nOur revolving credit facilities impose certain restrictions on us that could increase our vulnerability to general adverse economic and industry conditions by limiting our flexibility in planning for and reacting to changes in our business and industry. Specifically, these restrictions limit our ability, among other things, to incur additional indebtedness, make\ndistributions, pay dividends, issue stock of subsidiaries, make investments, repurchase stock, create liens, enter into transactions with affiliates, merge or consolidate, or transfer and sell our assets.\n● Failure to Meet Restrictive Covenants in Our Revolving Credit Facilities Could Result in Acceleration of the Facilities and We May not be Able to Find Alternative Financing.\nUnder our credit facilities, we are required to maintain a minimum debt service ratio if our excess availability falls below 10% of the maximum loan limit as defined in our revolving credit agreements. Our ability to comply with this covenant may be affected by factors beyond our control. If we breach, or if our lender contends that we have breached this covenant or any other restrictions, it could result in an event of default under our revolving credit facilities, which would permit our lenders to declare all amounts outstanding thereunder to be immediately due and payable, and our lenders under our revolving credit facilities could terminate their commitments to make further extensions of credit under our revolving credit facilities and foreclose on collateral securing those loans. In such an event, there can be no assurances that we would be able to obtain waivers for any such breach or default, refinance such indebtedness or obtain alternative financing on satisfactory terms or at all.\n● We May Not Be Able to Obtain Capital or Borrow Funds to Provide Us with Sufficient Liquidity and Capital Resources Necessary to Meet Our Future Financial Obligations.\nWe expect that our principal sources of funds will be cash generated from our operations and, if necessary, borrowings under our revolving credit facilities. However, the current and future conditions in the credit markets, including systemic pressures in the banking system, disruptions in the credit markets and rising interest rates may impact the availability of capital resources required to meet our future financial obligations, or to provide funds for our working capital, capital expenditures and other needs for the foreseeable future. We may require additional equity or debt financing to meet our working capital requirements or to fund our capital expenditures. We may not be able to obtain financing on terms satisfactory to us, or at all.\n● We Depend on Relatively Few Suppliers for a Large Portion of Our Products, and Any Interruptions in the Supply of the Products We Sell May Have an Adverse Effect on Our Results of Operations and Financial Condition.\nWe do not have any significant long-term contracts with suppliers in our wholesale business committing them to provide products to us. Although our purchasing volume can provide leverage when dealing with suppliers, suppliers may not provide the products we sell in the quantities we request or on favorable terms. Because we do not control the actual production of the products we sell, we are also subject to delays caused by interruption in production based on conditions beyond our control. These conditions include but are not limited to labor disputes (strikes), labor shortages, supply chain and transportation disruptions, inclement weather, drought, natural disasters, epidemics, pandemics or other widespread public health issues, or other catastrophic events and the adverse effects of climate change. Our inability to obtain adequate supplies of the products we sell as a result of any of the foregoing factors or otherwise, could cause us to fail to meet our obligations to our customers.\n● We Would Lose Business if Cigarette or Other Manufacturers That We Use Decide to Engage in Direct Distribution of Their Products.\nIn the past, some large manufacturers have decided to engage in direct distribution of their products and eliminate distributors such as the Company. If other manufacturers make similar product distribution decisions in the future, our revenues and profits could be adversely affected and there can be no assurance that we will be able to take action to compensate for such losses.\n● We Depend on Our Senior Management and Key Personnel.\nWe depend on the continued services and performance of our senior management and other key personnel. While we have employment agreements with certain key personnel, the loss of service from any of our executive officers or key employees could harm our business.\n● We Operate in a Competitive Labor Market and Some of Our Employees Are Covered by Collective Bargaining Agreements.\nWe compete with other businesses in each of our markets with respect to attracting and retaining qualified employees, particularly in the area of truck drivers and warehouse workers. A shortage of qualified employees could require us to enhance our wage and benefits packages in order to compete effectively in the hiring and retention of qualified employees or to hire more expensive temporary employees.\nIn addition, at September 2023, approximately thirty of our delivery drivers in our Wholesale Segment are covered by a collective bargaining agreement with a labor organization, which expires in November 2023. A new labor agreement has been ratified by the IAMAW through November 2026. We expect this agreement to be executed during the Companys first quarter of fiscal 2024.\n● We Are Subject to Significant Governmental Regulation and If We Are Unable to Comply with Regulations That Affect Our Business or If There Are Substantial Changes in These Regulations, Our Business Could Be Adversely Affected.\nAs a distributor and retailer of food products, we are subject to regulation by the FDA. Our operations are also subject to regulation by the USDA, OSHA, ATF, DOT and other federal, state and local agencies. Each of these regulatory authorities has broad administrative powers with respect to our operations. If we fail to adequately comply with government regulations or regulations become more stringent, we could experience increased inspections, regulatory authorities could take remedial action including imposing fines or shutting down our operations or we could be subject to increased audit and compliance costs. If any of these events were to occur, our results of operations, business, cash flow, and financial condition would be adversely affected.\nWe cannot predict the impact that future laws, regulations, interpretations or applications, the effect of additional government regulations or administrative orders, when and if promulgated, or disparate federal, state and local regulatory schemes would have on our business in the future. They could, however, require the reformulation of certain products to meet new standards, the recall or discontinuance of certain products not able to be reformulated, additional record keeping, expanded documentation of the properties of certain products, expanded or different labeling and/or scientific substantiation. While we do not manufacture any products, any of the aforementioned items could disrupt the supply levels of inventory that we sell. Any or all of such requirements could have an adverse effect on our results of operations, business, cash flow, and financial condition.\nRISK FACTORS RELATED TO OUR COMMON STOCK\n● The Company Has Few Shareholders of Record And, If this Number Remains below 300, as was true as of September 30, 2023, the Company Will No Longer Be Obligated to Report under the Securities Exchange Act of 1934 and in Such Case We May Be Delisted from NYSE American, Reducing the Ability of Investors to Trade in Our Common Stock.\nIf the number of owners of record (including direct participants in the Depository Trust Company) of our common stock remains below 300, as was true as of September 30, 2023, our obligation to file reports under the Securities Exchange Act of 1934 could be suspended. If we take advantage of this right we will likely reduce administrative costs of complying with public company rules, but periodic and current information updates about the Company would not be available to investors. In addition, the common stock of the Company would be removed from listing on NYSE American. This would likely impact investors ability to trade in our common stock.\n● We Have Various Mechanisms in Place to Discourage Takeover Attempts, Which May Reduce or Eliminate Our Stockholders Ability to Sell Their Shares for a Premium in a Change of Control Transaction.\nVarious provisions of our bylaws and of corporate law may discourage, delay or prevent a change in control or takeover attempt of the Company by a third party that is opposed by our management and Board of Directors. These anti-takeover provisions could substantially impede the ability of public stockholders to benefit from a change of control or change in our management and Board of Directors. These provisions include:\n● supermajority voting requirements to amend certain provisions in our certificate of incorporation;\n● non-cumulative voting for directors;\n● control by our Board of Directors of the size of our Board of Directors;\n● limitations on the ability of stockholders to call special meetings of stockholders; and\n● advance notice requirements for nominations of candidates for election to our Board of Directors or for proposing matters that can be acted upon by our stockholders at stockholder meetings. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.\nITEM 1C. CYBERSECURITY\nNot applicable. ITEM 2. PROPERTIES\nThe location and approximate square footage of the Companys nine distribution centers and 17 retail stores at September 2023 are set forth below:\nLocation\nSquare Feet\nDistribution-IL, MN, MO, ND, NE, SD, TN & WV\n1,316,000\nRetail-AR, FL, & OK\n173,100\nTotal Square Footage\n1,489,100\nThe Company leases certain distribution facilities, retail stores, offices, and certain equipment under operating leases. As further described in Note 7 to the Consolidated Financial Statements, certain of our distribution facilities in Quincy, Illinois, Springfield, Missouri, Bismarck, North Dakota, and Rapid City, South Dakota are owned by the Company and are included as collateral under AMCONs credit facility (the AMCON Facility). Our distribution center in Alexandria, Minnesota is owned by the Company and is included as collateral under Henrys Foods, Inc.s credit facility (the Henrys Facility). Team Sledd, LLCs principal office and warehouse in West Virginia are collateral against two separate notes payable and Team Sledds credit facility (the Team Sledd Facility). Management believes that its existing facilities are adequate for the Companys current level of operations, however, larger facilities and additional cross-dock facilities and retail stores may be required if the Company experiences growth in certain market areas. ITEM 3. LEGAL PROCEEDINGS\nNone. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nEXECUTIVE OFFICERS OF THE REGISTRANT\nExecutive officers of our Company are appointed by the Board of Directors and serve at the discretion of the Board. The following table sets forth certain information with respect to all executive officers of our Company.\nName\nAge\nPosition\nChristopher H. Atayan\nChairman of the Board, Chief Executive Officer, Director\nAndrew C. Plummer\nPresident, Chief Operating Officer, Director\nCharles J. Schmaderer\nVice President, Chief Financial Officer, Secretary\nCHRISTOPHER H. ATAYAN has served in various senior executive positions with the Company since 2006, including his service as Chairman of the Board since 2008 and Chief Executive Officer since 2006, and has been a director of the Company since 2004. Mr. Atayan served as Senior Managing Director of Slusser Associates, Inc., a private equity and investment banking firm, from 1988 to 2020, and had been engaged in private equity and investment banking since 1982. He also serves on the Board of Eastek Holdings, LLC, a contract manufacturing company.\nANDREW C. PLUMMER has served as our President and Chief Operating Officer since October 2018, as our Chief Financial Officer from January 2007 to October 2020, and as our Secretary from January 2007 to October 2018. From 2004 to 2007, Mr. Plummer served our company in various roles including Acting Chief Financial Officer, Corporate Controller, and Manager of SEC Compliance. Prior to joining our company in 2004, Mr. Plummer practiced public accounting, primarily with the accounting firm Deloitte and Touche, LLP (now Deloitte).\nCHARLES J. SCHMADERER has served as the Companys Chief Financial Officer since October 2020, as Vice President since April 2018, as Secretary since October 2018 and as Corporate Controller from April 2018 to October 2020. From 2006 to 2018, Mr. Schmaderer served the Company in various roles including as the Vice President of Financial Reporting and Assistant Secretary, and as the Director of Financial and SEC Reporting. Prior to joining AMCON in 2006, Mr. Schmaderer held financial management roles with Hewlett Packard (HP) and before that practiced public accounting, primarily with the accounting firm Grant Thornton, LLP. Mr. Schmaderer also holds a Master of Business Administration (MBA) from the University of Nebraska-Omaha.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET FOR COMMON STOCK\nThe Companys common stock trades on NYSE American under the trading symbol DIT. As of November 6, 2023, the closing price of our common stock on NYSE American was $192.00 and there were 630,362 common shares outstanding. As of that date, the Company had approximately 896 persons holding common shares beneficially of which approximately 130 are shareholders of record (including direct participants in the Depository Trust Company).\nDIVIDEND POLICY\nOn a quarterly basis, the Companys Board of Directors evaluates the potential declaration of dividend payments on the Companys common stock. Our dividend policy is intended to return capital to shareholders when it is most appropriate. The AMCON Facility described in Note 7 of Part II, Item 8 provides that the Company may not pay dividends on its common shares in excess of $5.0 million on an annual basis. There is no limit on dividend payments provided that certain excess availability measurements have been maintained for the 30-day period immediately prior to the payment of any such dividends or distributions, and immediately after giving effect to any such dividend or distribution payments, the Company has a fixed charge coverage ratio of at least 1.0 to 1.0 as defined in the AMCON Facility agreement.\nOur Board of Directors could decide to alter our dividend policy or not pay quarterly dividends at any time in the future. Such an action by the Board of Directors could result from, among other reasons, changes in the marketplace, changes in\nour performance or capital needs, changes in federal income tax laws, disruptions in the capital markets, or other events affecting our business, liquidity or financial position. The Company paid cash dividends of approximately $3.5 million and $3.4 million, or $5.72 per common share, during fiscal 2023 and fiscal 2022, respectively.\nDuring the fiscal years ended September 30, 2023 and September 30, 2022, the Company did not sell any unregistered securities. The Company issued unregistered securities to certain members of the Companys management team in relation to the vesting of restricted stock units as described in Note 12 of Part II, Item 8. These issuances were exempt from registration under Section 4(a)(2) of the Securities Act of 1933.\nREPURCHASE OF COMPANY SHARES\nThe Company repurchased a total of 2,363 shares of its common stock during fiscal 2023 for cash totaling approximately $0.4 million. The Company did not repurchase any shares of its common stock during fiscal 2022. All repurchased shares were recorded in treasury stock at cost. At September 2023, 72,637 shares of the Companys common shares remained authorized for repurchase in either the open market or privately negotiated transactions, as previously approved by the Companys Board of Directors. In October 2023, the Board of Directors renewed the repurchase authorization for up to 75,000 shares of the Companys common stock.\nDuring the fourth quarter of fiscal 2023, the Company repurchased shares of its common stock for cash totaling approximately $0.4 million. The following table summarizes these repurchases made by or on behalf of the Company or certain affiliated purchasers of shares of our common stock for the quarterly period ended September 30, 2023:\nPeriod\n(a) Total Number of Shares (or Units) Purchased\n(b) Average Price Paid per Share (or Unit)\n(c) Total Number of Shares (or Units) Purchased as Part of Publicly Announced Plans or Programs\n(d) Maximum Number (or Approximate Dollar Value) of Shares (or Units) that May Yet Be Purchased Under the Plans or Programs*\nJuly 1 - 31, 2023\n2,363\n$\n171.34\n2,363\n72,637\nAugust 1 - 31, 2023\n-\n-\n-\n72,637\nSeptember 1 - 30, 2023\n-\n-\n-\n72,637\nTotal\n2,363\n$\n-\n2,363\n72,637\n*\nIn October 2023 and subsequent to the end of fiscal 2023, the Board of Directors authorized purchases of up to 75,000 shares of our Companys common stock in open market or negotiated transactions. Management was given discretion to determine the number and pricing of the shares to be purchased, as well as the timing of any such purchases.\nEQUITY COMPENSATION PLAN INFORMATION\nWe refer you to Item 12 of this report for the information required by Item 201(d) of SEC Regulation S-K. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nThe following discussion should be read in conjunction with the Consolidated Financial Statements and Notes to the Consolidated Financial Statements under Item 8 and other information in this report, including Critical Accounting Estimates and Cautionary Information included at the end of this Item 7. The following discussion and analysis includes the results of operations for the twelve month periods ended September 2023 and September 2022. For more information regarding our business segments, see Item 1 Business of this Annual Report.\nBusiness Update\nDuring fiscal year 2023, the Company acquired Henrys Foods, Inc. (Henrys) an Alexandria, Minnesota-based convenience distributor. The acquisition of Henrys expanded our geographic footprint and has provided access to an industry-leading foodservice distribution platform.\nMacroeconomic factors including ongoing disruptions to supply chains continue to impact product and equipment availability for our businesses. Combined with a persistently high inflationary operating environment, these factors have resulted in cost pressures across both of our business segments as product, labor, fuel, interest and other costs have all increased markedly while at the same time pressuring consumer demand trends.\nFinally, we continue to monitor proposals from governmental and regulatory bodies, including the United States Food and Drug Administration (FDA), which are evaluating the possible prohibition and/or limitations on the sale of certain cigarette, tobacco and vaping products, including menthol. If such regulations were to be implemented, they would have a negative impact on the Companys financial results.\nResults of Operations\nThe following table sets forth an analysis of various components of the Companys Statement of Operations as a percentage of sales for fiscal years 2023 and 2022:\nFiscal Years\nSales\n100.0\n%\n100.0\n%\nCost of sales\n93.3\n93.6\nGross profit\n6.7\n6.4\nSelling, general and administrative expenses\n5.4\n5.1\nDepreciation and amortization\n0.3\n0.2\nOperating income\n1.0\n1.1\nInterest expense\n0.3\n0.1\nChange in fair value of mandatorily redeemable non-controlling interest\n0.1\n0.1\nOther (income), net\n(0.1)\n(0.1)\nIncome from operations before income taxes\n0.7\n1.0\nIncome tax expense\n0.2\n0.3\nEquity method investment earnings, net of tax\n-\n0.1\nNet income available to common shareholders\n0.5\n%\n0.8\n%\nThe following table presents selected statement of operations data for fiscal years 2023 and 2022:\n($ in millions)\nIncr (Decr) (2)\nCONSOLIDATED:\nSales(1)\n$\n2,540.0\n$\n2,010.8\n$\n529.2\nCost of sales\n2,369.2\n1,883.1\n486.1\nGross profit\n170.8\n127.7\n43.1\nGross profit percentage\n6.7\n%\n6.4\n%\nOperating expense\n$\n144.9\n$\n105.1\n$\n39.8\nOperating income\n26.0\n22.6\n3.4\nInterest expense\n8.5\n2.2\n6.3\nChange in fair value of mandatorily redeemable non-controlling interest\n1.3\n1.5\n(0.2)\nIncome tax expense\n5.7\n6.5\n(0.8)\nEquity method investment earnings, net of tax\n-\n1.7\n(1.7)\nNet income available to common shareholders\n11.6\n16.7\n(5.1)\nBUSINESS SEGMENTS:\nWholesale\nSales\n$\n2,496.9\n$\n1,964.6\n$\n532.3\nGross profit\n155.3\n110.8\n44.5\nGross profit percentage\n6.2\n%\n5.6\n%\nRetail\nSales\n$\n43.1\n$\n46.2\n$\n(3.1)\nGross profit\n15.5\n16.9\n(1.4)\nGross profit percentage\n36.0\n%\n36.6\n%\n(1) Sales are reported net of costs associated with incentives provided to retailers. These incentives totaled $40.4 million and $34.4 million in fiscal 2023 and fiscal 2022, respectively.\n(2) Calculated based on rounded numbers as presented in the table.\nSALES\nChanges in sales are primarily driven by:\n(i) changes to selling prices, which are largely controlled by our product suppliers, and excise taxes imposed on cigarettes and tobacco products by various states;\n(ii) changes in the volume and mix of products sold to our customers, either due to a change in purchasing patterns resulting from consumer preferences or the fluctuation in the comparable number of business days in our reporting period; and\n(iii) acquisitions\nSALES-Fiscal 2023 vs. Fiscal 2022\nSales in our Wholesale Segment increased $532.3 million during fiscal 2023 as compared to fiscal 2022. Significant items impacting sales during fiscal 2023 included a $362.4 million increase in comparative sales related to the acquisition of a controlling interest in Team Sledd, LLC (Team Sledd) during Q3 2022, a $220.6 million increase in sales related to the acquisition of Henrys Foods, Inc. (Henrys\") during Q2 2023, a $97.3 million increase in sales related to price increases implemented by cigarette manufacturers, and a $27.8 million increase in sales related to higher sales volumes in our tobacco, confectionary, foodservice, and other categories (Other Products), partially offset by a $175.8 million decrease in sales related to the volume and mix of cigarette cartons sold.\nSales in our Retail Segment decreased $3.1 million in fiscal 2023 as compared to fiscal 2022. Significant items impacting sales during fiscal 2023 included a $4.1 million decrease in sales volume related to store closures across the comparative periods, partially offset by a $1.0 million increase in sales related to higher sales volumes in our existing stores.\nGROSS PROFIT-Fiscal 2023 vs. Fiscal 2022\nOur gross profit does not include fulfillment costs and costs related to the distribution network which are included in selling, general and administrative costs, and may not be comparable to those of other entities. Some entities may classify such costs as a component of cost of sales. Cost of sales, a component used in determining gross profit, for the Wholesale and Retail Segments includes the cost of products purchased from manufacturers, less incentives we receive which are netted against such costs.\nGross profit in our Wholesale Segment increased $44.5 million during fiscal 2023 as compared to fiscal 2022. Significant items impacting gross profit during fiscal 2023 included a $25.4 million increase in gross profit related to the acquisition of Henrys in Q2 2023, a $20.8 million increase in comparative gross profit related to the acquisition of a controlling interest in Team Sledd during Q3 2022, a $1.0 million increase in gross profit related to higher sales volumes and promotions in our Other Products category, partially offset by a $1.9 million decrease in the net impact of cigarette manufacturer promotions and the volume and mix of cigarette cartons sold and a $0.8 million decrease in gross profit due to the timing and related benefits of cigarette manufacturer price increases between the comparative periods. Gross profit in our Retail Segment decreased $1.4 million in fiscal 2023 as compared to fiscal 2022. This change was primarily related to a $1.2 million decrease related to store closures across the comparative periods and $0.2 million decrease related to lower gross margins in our existing stores resulting from variations in volume and product mix between the comparative periods.\nOPERATING EXPENSE-Fiscal 2023 vs. Fiscal 2022\nOperating expense includes selling, general and administrative expenses and depreciation and amortization. Selling, general, and administrative expenses primarily consist of costs related to our sales, warehouse, delivery and administrative departments, including purchasing and receiving costs, warehousing costs and costs of picking and loading customer orders. Our most significant expenses relate to costs associated with employees, facility and equipment leases, transportation, fuel, and insurance.\nOur fiscal 2023 consolidated operating expenses increased $39.8 million as compared to fiscal 2022. Significant items impacting operating expenses during fiscal 2023 included a $20.3 million increase in operating expenses related to the acquisition of Henrys during Q2 2023, a $16.0 million increase in operating expenses related to the acquisition of a controlling interest in Team Sledd during Q3 2022, a $2.4 million increase in other Wholesale Segment operating expenses including employee compensation and benefit costs, and a $2.0 million increase in insurance costs, partially offset by a $0.7 million decrease in fuel costs, a $0.1 million decrease in our customer bad debt expense and a $0.1 million decrease in our Retail Segment operating expenses.\nINTEREST EXPENSE - Fiscal 2023 vs. Fiscal 2022\nInterest expense increased $6.3 million during fiscal 2023 as compared to fiscal 2022, primarily related to higher interest rates and higher outstanding debt balances in the current year period related to the acquisition of a controlling interest in Team Sledd in Q3 2022 and the acquisition of Henrys in Q2 2023.\nOTHER INCOME - Fiscal 2023 vs. Fiscal 2022\nThe change in other income between the comparative periods was primarily related to a non-cash accounting gain of approximately $2.4 million in fiscal 2022 related to the consolidation of Team Sledd, partially offset by an insurance recovery in fiscal 2023.\nINCOME TAX EXPENSE - Fiscal 2023 vs. Fiscal 2022\nThe change in the fiscal 2023 income tax rate as compared to fiscal 2022 was primarily related to non-deductible compensation expense in relation to the amount of income from operations before income tax expense and higher effective state income tax rates between the comparative periods.\nLiquidity and Capital Resources\nThe Companys variability in cash flows from operating activities is dependent on the timing of inventory purchases and seasonal fluctuations. For example, periodically we have inventory buy-in opportunities which offer more favorable pricing terms. As a result, we may have to hold inventory for a period longer than the payment terms. This generates a cash outflow from operating activities that we expect to reverse in later periods. Additionally, during our peak time of operations in the warm weather months, we generally carry higher amounts of inventory to ensure high fill rates and customer satisfaction.\nThe Company primarily finances its operations through three credit facility agreements (a) a facility that is an obligation of AMCON Distributing Company (the AMCON Facility), (b) a facility that is an obligation of Team Sledd (the Team Sledd Facility ) and (c) a facility that is the obligation of Henrys (the Henrys Facility), and collectively together (the Facilities) and long-term debt agreements with banks. The Team Sledd Facility and The Henrys Facility are non- recourse to AMCON Distributing Company, are not guaranteed by AMCON Distributing Company and have no cross default provisions applicable to AMCON Distributing Company. In Q3 2023, the Company amended the Team Sledd Facility, increasing its aggregate borrowing capacity from $70.0 million to $80.0 million, extending the maturity date to March 2028, and adding certain real estate property as eligible borrowing collateral under the agreement.\nAt September 2023, the Facilities have a total combined borrowing capacity of $300.0 million, which includes provisions for up to $30.0 million in credit advances for certain inventory purchases, which are limited by accounts receivable and inventory qualifications, and the value of certain real estate collateral. The Henrys Facility matures in February 2026, the AMCON Facility matures in June 2027, and the Team Sledd Facility matures in March 2028, each without a penalty for prepayment. Obligations under the Facilities are collateralized by substantially all of the Companys respective equipment, intangibles, inventories, accounts receivable, and certain real estate. The Facilities each feature an unused commitment fee and springing financial covenants. Borrowings under the Facilities bear interest at either the banks prime rate or the Secured Overnight Financing Rate (SOFR), plus any applicable spreads.\nThe amount available for use from the Facilities at any given time is subject to a number of factors, including eligible accounts receivable and inventory balances that fluctuate day-to-day, as well as the value of certain real estate collateral. Based on the collateral and loan limits as defined in the Facility agreements, the credit limit of the combined Facilities at September 2023 was $239.1 million, of which $140.4 million was outstanding, leaving $98.7 million available.\nThe average interest rate of the Facilities was 7.03% at September 2023. During fiscal 2023, the peak borrowings under the Facilities was $159.7 million, and the average borrowings and average availability under the Facilities was $124.3 million and $86.4 million, respectively.\nCross Default and Co-Terminus Provisions\nTeam Sledds three notes payable and the Team Sledd Facility contain cross default provisions. The Henrys note payable and the Henrys Facility contain cross default provisions. There were no such cross defaults for either Team Sledd or Henrys at September 2023. Additionally, the Team Sledd Facility and the Henrys Facility are non-recourse to AMCON Distributing Company, are not guaranteed by AMCON Distributing Company and have no cross default provisions applicable to AMCON Distributing Company. The Company and its subsidiaries, including Team Sledd and Henrys, were in compliance with all of the financial covenants under the Facilities at September 2023.\nDividend Payments\nThe Company paid cash dividends of $3.5 million and $3.4 million, or $5.72 per common share, during fiscal 2023 and fiscal 2022, respectively.\nOther\nThe Company has issued a letter of credit for $0.5 million to its workers compensation insurance carrier as part of its self-insured loss control program.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements.\nLiquidity Risk\nThe Companys liquidity position is significantly influenced by its ability to maintain sufficient levels of working capital. For our Company and our industry in general, customer credit risk and ongoing access to bank credit heavily influence liquidity positions.\nThe Company does not currently hedge its exposure to interest rate risk or fuel costs. Accordingly, significant price movements in these areas can and do impact the Companys profitability.\nWhile the Company believes its liquidity position going forward will be adequate to sustain operations in both the short- and long-term, a precipitous change in the operating environment could materially impact the Companys future revenue streams as well as its ability to collect on customer accounts receivable or secure bank credit.\nOTHER MATTERS-Critical Accounting Estimates\nGENERAL\nThe Consolidated Financial Statements of the Company are prepared in accordance with U.S. generally accepted accounting principles, which require the Company to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, net revenue and expenses, and the disclosure of contingent assets and liabilities. The Company bases its estimates on historical experience and on various other assumptions that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and\nliabilities that are not readily apparent from other sources. The Company believes that the accounting estimates employed and the resulting balances are reasonable; however, actual results may differ from these estimates under different assumptions or conditions.\nThe Company believes the following critical accounting policies reflect the significant estimates and assumptions used in the preparation of the Consolidated Financial Statements. Our critical accounting estimates are set forth below.\nALLOWANCE FOR DOUBTFUL ACCOUNTS\nNATURE OF ESTIMATES REQUIRED. The allowance for doubtful accounts represents our estimate of uncollectible accounts receivable at the balance sheet date. We monitor our credit exposure on a daily basis and regularly assess the adequacy of our allowance for doubtful accounts. Because credit losses can vary significantly over time, estimating the required allowance requires a number of assumptions that are uncertain.\nASSUMPTIONS AND APPROACH USED. We estimate our required allowance for doubtful accounts using the following key assumptions:\n● Historical collections-Represented as the amount of historical uncollectible accounts as a percent of total accounts receivable.\n● Specific credit exposure on certain accounts-Identified based on managements review of the accounts receivable portfolio and taking into account the financial wherewithal of particular customers that management deems to have a higher risk of collection.\n● Market conditions-We consider a broad range of industry trends and macro-economic issues which may impact the creditworthiness of our customers.\nINVENTORIES\nNATURE OF ESTIMATES REQUIRED. In our businesses, we carry large quantities and dollar amounts of inventory. Inventories primarily consist of finished products purchased in bulk quantities to be sold to our customers. Given the large quantities and broad range of products we carry, there is a risk that inventory may become impaired because it has become unsaleable or unrefundable, slow moving, obsolete, or because it has been discontinued. The use of estimates is required in determining either the net realizable value (for our wholesale business) or the lower of cost or market (LCM) under the retail method (for our retail business) of this inventory.\nASSUMPTIONS AND APPROACH USED. We estimate our inventory obsolescence reserve at each balance sheet date based on the following criteria:\n● Slow moving products-Items identified as slow moving are evaluated on a case-by-case basis for impairment.\n● Obsolete/discontinued inventory-Products identified that are near or beyond their expiration dates. We may also discontinue carrying certain product lines for our customers. As a result, we estimate either the net realizable value or the LCM of this inventory as if it were to be liquidated.\n● Estimated net realizable value-For our wholesale business, the net realizable value of the inventory is estimated using managements evaluation of the congestion in the distribution channels and experience with brokers and inventory liquidators to determine the net realizable value of the inventory.\nDEPRECIATION, AMORTIZATION AND IMPAIRMENT OF LONG-LIVED ASSETS, INCLUDING GOODWILL AND LEASED RIGHT-OF-USE ASSETS\nLong-lived assets consist primarily of property and equipment, leased right-of-use (ROU) assets, intangible assets, and goodwill acquired in business combinations. Property and equipment, ROU assets and amortizable identified intangible assets are assigned useful lives ranging from one to 40 years. Indefinite-lived intangible assets and goodwill are not amortized. Impairment of the Companys long-lived assets is assessed during the Companys fourth fiscal quarter using both qualitative and quantitative analysis, or whenever events or circumstances change that indicate the carrying value of such long-lived assets may not be recoverable.\nNATURE OF ESTIMATES REQUIRED. Management has to estimate the useful lives of the Companys long-lived assets. In regard to the Companys impairment analysis, the most significant assumptions include managements estimate of the annual growth rate used to project future sales and expenses.\nASSUMPTIONS AND APPROACH USED. For property and equipment, depreciable lives are based on our accounting policy which is intended to mirror the expected useful life of the asset. In determining the estimated useful life of ROU assets and amortizable intangible assets such as customer lists, we rely on our historical experience in addition to estimates of how long certain assets will generate cash flows. If impairment indicators arise, we then evaluate the potential impairment of property and equipment, ROU assets and amortizable identifiable intangible assets using an undiscounted future cash flow approach.\nWhen evaluating the potential impairment of non-amortizable indefinite-lived assets and goodwill, the Company first assesses a range of qualitative factors, including but not limited to, macroeconomic conditions, industry conditions, the competitive environment, changes in the market for the Companys products and services, market prices, regulatory and political developments, entity specific factors such as strategy and changes in key personnel, and the overall financial performance for each of the Companys reporting units. If after completing this assessment, the Company determines that it is more likely than not that the fair value of a reporting unit is less than its carrying value, a quantitative evaluation is performed using the income approach (discounted cash flow method).\nA discounted cash flow methodology requires the estimation of a wide range of factors including but not limited to: (i) forecasting future earnings and cash flows (ii) determining the discount rate applicable to the earnings stream being discounted, and (iii) computing a terminal value at some point in the future. These estimations require significant judgment and include making assumptions such as sales growth rates including the addition of new retail stores, future store profitability, planned capital expenditures, our ability to control costs, the successful implementation of initiatives designed to enhance sales and improve inventory management, gross profit estimates, macroeconomic conditions, industry conditions, the competitive environment, changes in the market for the Companys products and services, regulatory and political developments, entity specific factors such as strategy and changes in key personnel, working capital requirements, weighted average cost of capital, and current and anticipated operating conditions. The use of different assumptions or estimates for future cash flows could produce different results.\nGoodwill recorded on the Companys consolidated balance sheet represents amounts allocated to its wholesale reporting unit which totaled $5.8 million and $5.3 million at September 2023 and September 2022, respectively. The Company determined that the estimated fair value of its wholesale reporting unit exceeded its carrying value at both September 2023 and September 2022.\nINSURANCE\nThe Companys insurance for workers compensation, general liability and employee-related health care benefits are provided through high-deductible or self-insured programs. As a result, the Company accrues for its workers compensation liability based upon claim reserves established with the assistance of a third-party administrator, which are then trended and developed. The reserves are evaluated at the end of each reporting period. Due to the uncertainty involved with the realization of claims incurred but unreported, management is required to make estimates of these claims.\nASSUMPTIONS AND APPROACH USED. In order to estimate our reserve for incurred but unreported claims we consider the following key factors:\nEmployee Health Insurance Claims\n● Historical claims experience-We review loss runs for each month to calculate the average monthly claims experience.\n● Lag period for reporting claims-Based on our analysis, our experience is such that we have a minimum of a one-month lag period in which claims are reported.\nWorkers Compensation Insurance Claims\n● Historical claims experience-We review prior years loss runs to estimate the average annual expected claims and review monthly loss runs to compare our estimates to actual claims.\n● Lag period for reporting claims-We review claims trends and use standard insurance industry loss models to develop reserves on reported claims in order to estimate the amount of incurred but unreported claims.\nINCOME TAXES\nThe Company accounts for its income taxes by recording taxes payable or refundable for the current year and deferred tax assets and liabilities for the future tax consequences of events that have been recognized in our financial statements or tax returns. These expected future tax consequences are measured based on provisions of tax law as currently enacted; the effects of future changes in tax laws are not anticipated. Future tax law changes, such as a change in the corporate tax rate, could have a material impact on our financial condition or results of operations.\nOn a periodic basis, we assess the likelihood that our deferred tax assets will be recovered from future taxable income and establish a related valuation allowance as appropriate. In performing our evaluation, we consider all available evidence, both positive and negative, to determine whether, based on the weight of the evidence, a valuation allowance is needed. Evidence used includes information about our current financial position and our results of operations for the current and preceding years, as well as all currently available information about future years, including our anticipated future performance, the reversal of deferred tax liabilities and tax planning strategies. When appropriate, we record a valuation allowance against deferred tax assets to offset future tax benefits that may not be realized.\nASSUMPTIONS AND APPROACH USED. In determining whether a valuation allowance is appropriate, we consider whether it is more likely than not that all or some portion of our deferred tax assets will not be realized, based in part upon managements judgments regarding future events.\nIn making that estimate we consider the following key factors:\n● our current financial position;\n● historical financial information;\n● future reversals of existing taxable temporary differences;\n● future taxable income exclusive of reversing temporary differences and carryforwards;\n● taxable income in prior carryback years; and\n● tax planning strategies.\nREVENUE RECOGNITION\nWe recognize revenue in both our Wholesale Segment and our Retail Segment when the performance obligation is satisfied, which is the point at which control of the promised goods or services are transferred to our customers, in an amount that reflects the consideration we expect to be entitled to receive in exchange for those goods and services. For the majority of our customer arrangements, control transfers to customers at a point-in-time when goods have been delivered, as that is generally when legal title, physical possession and risks and rewards of goods and services transfers to the customer. Sales are shown net of returns, discounts, and sales incentives to customers.\nNATURE OF ESTIMATES REQUIRED. We estimate and reserve for anticipated sales discounts. We also estimate and provide a reserve for anticipated sales incentives to customers when earned under established program requirements.\nASSUMPTIONS AND APPROACH USED. We estimate the sales reserves using the following criteria:\n● Sales discounts-We use historical experience to estimate the amount of accounts receivable that will not be collected due to customers taking advantage of authorized term discounts.\n● Volume sales incentives-We use historical experience in combination with quarterly reviews of customers sales progress in order to estimate the amount of volume incentives due to the customers on a periodic basis.\nOur estimates and assumptions for each of the aforementioned critical accounting estimates have not changed materially during the periods presented, nor are we aware of any reasons that they would be reasonably likely to change in the future.\nBUSINESS COMBINATIONS\nAssets acquired and liabilities assumed as part of a business acquisition are generally recorded at their fair value at the date of acquisition. Determining fair value of identifiable assets acquired, particularly intangibles, and liabilities assumed also requires management to make estimates, which are based on all available information and in some cases assumptions with respect to the timing and amount of future revenues and expenses associated with an asset.\nNATURE OF ESTIMATES REQUIRED. We allocate the purchase price of acquired companies to the tangible assets acquired, liabilities assumed, and intangible assets acquired, based on their estimated fair values. The excess of the purchase price over these fair values is recorded as goodwill. Such valuations require management to make significant estimates and assumptions, especially with respect to intangible assets.\nASSUMPTIONS AND APPROACH USED. Critical estimates in valuing certain intangible assets include but are not limited to the projected growth factors, future expected cash flows, discount rates, potential competitive and regulatory environment developments, and changes in the market for the Companys products and services. Managements estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable and, as a result, actual results may differ from estimates. Additionally, estimates associated with the accounting for acquisitions may change as new information becomes available regarding the assets acquired and liabilities assumed.\nMANDATORILY REDEEMABLE NON-CONTROLLING INTEREST\nMandatorily redeemable non-controlling interest represents the non-controlling interest in the Companys strategic investment in Team Sledd, LLC.\nNATURE OF ESTIMATES REQUIRED. We record the mandatorily redeemable non-controlling interest at fair value. This valuation requires management to make significant estimates and assumptions, especially with respect to the timing of future redemptions and discount rates.\nASSUMPTIONS AND APPROACH USED. Critical estimates in valuing the mandatorily redeemable non-controlling interest include but are not limited to the projected growth factors, future expected cash flows, discount rates, potential competitive and regulatory environment developments, and changes in the market for the Companys products and\nservices. Managements estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable and, as a result, actual results may differ from estimates.\nACCOUNTING PRONOUNCEMENTS\nRecent Accounting Pronouncements\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which introduces a forward-looking approach, based on expected losses, to estimate credit losses on certain types of financial instruments, including trade receivables. The estimate of expected credit losses will require entities to incorporate considerations of historical information, current information and reasonable and supportable forecasts. This ASU also expands the disclosure requirements to enable users of financial statements to understand the entitys assumptions, models and methods for estimating expected credit losses. This guidance is effective for fiscal years beginning after December 15, 2022 (fiscal 2024 for the Company) with early adoption permitted. The Company does not expect the adoption of ASU 2016-13 to have a material effect on its consolidated financial statements.\nFORWARD-LOOKING STATEMENTS\nThis Annual Report on Form 10-K, including Managements Discussion and Analysis of Financial Condition and Results of Operations and other sections, contains forward-looking statements that are subject to risks and uncertainties and which reflect managements current beliefs and estimates of future economic circumstances, industry conditions, Company performance and financial results. Forward-looking statements include information concerning the possible or assumed future results of operations of the Company and those statements preceded by, followed by or that include the words future, position, anticipate(s), expect(s), believe(s), see, plan, further improve, outlook, should or similar expressions. For these statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. Forward-looking statements are not guarantees of future performance or results. They involve risks, uncertainties and assumptions.\nIt should be understood that the following important factors, in addition to those discussed elsewhere in this document, could affect the future results of the Company and could cause those results to differ materially from those expressed in our forward-looking statements:\n● risks associated with higher interest rates or prolonged periods of higher interest rates and the related impact on demand, customer credit risk, profitability, and cash flows for both the Company and our customer base, particularly as it relates to variable interest rate borrowings, as well as the risk that such borrowings may not be renewed in the future on favorable terms or at all,\n● risks associated with any systemic pressures in the banking system, particularly as they relate to customer credit risk and any resulting impact on our cash flow and our ability to collect on our receivables,\n● risks associated with an inflationary operating environment, particularly as it relates to wages, fuel, interest, commodity prices, and customer credit risk which impact our operating cost structure and could impact food ingredient costs and demand for many of the products we sell,\n● regulations, potential bans and/or litigation related to the manufacturing, distribution, and sale of certain cigarette, tobacco, and vaping products imposed by the FDA, state or local governmental agencies, or other parties, including proposed forthcoming regulations around the manufacture and distribution of certain menthol and flavored tobacco products,\n● risks associated with the threat or occurrence of epidemics or pandemics (such as COVID-19 or its variants) or other public health issues, including the continued health of our employees and management, the reduced demand for our goods and services or increased credit risk from customer credit defaults resulting from an economic downturn,\n● risks associated with the imposition of governmental orders restricting our operations and the operations of our suppliers and customers, in particular, disruptions to our supply chain or our ability to procure products or fulfill orders due to labor shortages in our warehouse operations,\n● risks associated with the Companys business model which experienced both higher sales volumes and labor costs, during the COVID-19 pandemic, and the risk of sales returning to pre-pandemic levels without the Company being able to offset increases in its cost structure,\n● risks associated with the acquisition of assets, new businesses or equity investments by either of our business segments including, but not limited to, risks associated with consummating such transactions on expected terms or timing, purchase price and business valuation and recording risks, and risks related to the assumption of certain liabilities or obligations,\n● risks associated with the integration of new businesses or equity investments by either of our business segments including, but not limited to, risks associated with vendor and customer retention, technology integration, and the potential loss of any key management personnel or employees,\n● increasing competition and market conditions in our wholesale and retail health food businesses and any associated impact on the carrying value and any potential impairment of assets (including intangible assets) within those businesses,\n● risk that our repositioning strategy for our retail business will not be successful,\n● risks associated with opening new retail stores,\n● if online shopping formats such as Amazon™ continue to grow in popularity and further disrupt traditional sales channels, it may present a significant direct risk to our brick and mortar retail business and potentially to our wholesale distribution business,\n● the potential impact that ongoing, decreasing, or changing trade tariffs and trade policies may have on our product costs or on consumer disposable income and demand,\n● increasing product and operational costs resulting from ongoing supply chain disruptions, an intensely competitive labor market with a limited pool of qualified workers, and higher incremental costs associated with the handling and transportation of certain product categories such as foodservice,\n● increases in state and federal excise taxes on cigarette and tobacco products and the potential impact on demand, particularly as it relates to current legislation under consideration which could significantly increase such taxes,\n● risks associated with disruptions to our technology systems or those of third parties upon which we rely, including security breaches, cyber and ransomware attacks, malware, or other methods by which such information systems could or may have been compromised or impacted,\n● increases in inventory carrying costs and customer credit risks,\n● changes in pricing strategies and/or promotional/incentive programs offered by cigarette and tobacco manufacturers,\n● changing demand for the Companys products, particularly cigarette, tobacco and vaping products,\n● risks that product manufacturers may begin selling directly to convenience stores and bypass wholesale distributors,\n● changes in laws and regulations and ongoing compliance related to health care and associated insurance,\n● increasing health care costs for both the Company and consumers and its potential impact on discretionary consumer spending,\n● decreased availability of capital resources,\n● domestic regulatory and legislative risks,\n● poor weather conditions, and the adverse effects of climate change,\n● consolidation trends within the convenience store, wholesale distribution, and retail health food industries,\n● risks associated with labor disputes (strikes), natural disasters, domestic/political unrest and incidents of violence, or any restrictions, regulations, or security measures implemented by governmental bodies in response to these items, and\n● other risks over which the Company has little or no control, and any other factors not identified herein.\nChanges in these factors could result in significantly different results. Consequently, future results may differ from managements expectations. Moreover, past financial performance should not be considered a reliable indicator of future performance. Any forward-looking statement contained herein is made as of the date of this document. Except as required by law, the Company undertakes no obligation to publicly update or correct any of these forward-looking statements in the future to reflect changed assumptions, the occurrence of material events or changes in future operating results, financial conditions or business over time. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nIndex to 2023 and 2022 Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID# 49)\nConsolidated Balance Sheets as of September 2023 and September 2022\nConsolidated Statements of Operations for the Fiscal Years Ended September 2023 and September 2022\nConsolidated Statements of Shareholders Equity for the Fiscal Years Ended September 2023 and September 2022\nConsolidated Statements of Cash Flows for the Fiscal Years Ended September 2023 and September 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of AMCON Distributing Company\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of AMCON Distributing Company and Subsidiaries (the Company) as of September 30, 2023 and 2022, the related consolidated statements of operations, shareholders equity and cash flows for the years then ended, and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nAcquisition of Henrys Foods, Inc.\nAs described in Note 2 to the financial statements, in February 2023, the Company acquired substantially all of the operating assets of Henrys Foods, Inc. (Henrys) for cash consideration of approximately $54.9 million. The transaction was accounted for in accordance with Accounting Standards Codification (ASC) 805 - Business Combinations and the Company measured the acquisition-date fair value of Henrys using a discounted cash flow methodology. The model requires management to make significant assumptions, which include estimates of sales growth, gross profit, and the discount rate. Management also made significant judgments regarding the estimates of fair value of the acquired property and equipment.\nWe identified the determination of the fair value of identifiable intangible assets and property and equipment acquired in the Henrys acquisition as a critical audit matter because of the significant assumptions used by the Company in\ndetermining fair value, including estimates of sales growth, gross profit, the discount rate, and the fair value of the property and equipment. Auditing managements assumptions of sales growth, gross profit estimates, the discount rate, and fair value of acquired property and equipment involves a high degree of auditor judgment.\nOur audit procedures related to the determination of the fair value of identifiable intangible assets and property and equipment acquired in the Henrys acquisition included the following, among others:\n● With the assistance of our fair value specialists, we evaluated the reasonableness of the valuation methodology and discount rates utilized by management by testing the relevance and reliability of source information underlying the determination of the discount rate and testing the mathematical accuracy of the calculation.\n● We tested the reasonableness of managements forecasts of future sales growth and gross profit projections by comparing the forecasts to historical results and available market data.\n● With the assistance of our fair value specialists, we evaluated the reasonableness of the valuation methodology and evaluated the fair values assigned to acquired property and equipment by:\no Testing the relevance and reliability of source information underlying the determination of fair value and comparing to available market data\no Comparing managements estimates to independent estimates\n/s/ RSM US LLP\nWe have served as the Companys auditor since 2006.\nOmaha, Nebraska\nNovember 8, 2023\nAMCON Distributing Company and Subsidiaries\nCONSOLIDATED BALANCE SHEETS\nSeptember\nSeptember\nASSETS\nCurrent assets:\nCash\n$\n790,931\n$\n431,576\nAccounts receivable, less allowance for doubtful accounts of $2.4 million at September 2023 and $2.5 million at September 2022\n70,878,420\n62,367,888\nInventories, net\n158,582,816\n134,654,637\nIncome taxes receivable\n1,854,484\n819,595\nPrepaid expenses and other current assets\n13,564,056\n12,702,084\nTotal current assets\n245,670,707\n210,975,780\nProperty and equipment, net\n80,607,451\n48,085,520\nOperating lease right-of-use assets, net\n23,173,287\n19,941,009\nGoodwill\n5,778,325\n5,277,950\nOther intangible assets, net\n5,284,935\n2,093,113\nOther assets\n2,914,495\n2,751,155\nTotal assets\n$\n363,429,200\n$\n289,124,527\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable\n$\n43,099,326\n$\n39,962,363\nAccrued expenses\n14,922,279\n14,446,210\nAccrued wages, salaries and bonuses\n8,886,529\n7,811,207\nCurrent operating lease liabilities\n6,063,048\n6,454,473\nCurrent maturities of long-term debt\n1,955,065\n1,595,309\nCurrent mandatorily redeemable non-controlling interest\n1,703,604\n1,712,095\nTotal current liabilities\n76,629,851\n71,981,657\nCredit facilities\n140,437,989\n91,262,438\nDeferred income tax liability, net\n4,917,960\n2,328,588\nLong-term operating lease liabilities\n17,408,758\n13,787,721\nLong-term debt, less current maturities\n11,675,439\n7,384,260\nMandatorily redeemable non-controlling interest, less current portion\n7,787,227\n9,446,460\nOther long-term liabilities\n402,882\n103,968\nShareholders equity:\nPreferred stock, $.01 par value, 1,000,000 shares authorized\n-\n-\nCommon stock, $.01 par value, 3,000,000 shares authorized, 608,689 shares outstanding at September 2023 and 584,789 shares outstanding at September 2022\n9,431\n9,168\nAdditional paid-in capital\n30,585,388\n26,903,201\nRetained earnings\n104,846,438\n96,784,353\nTreasury stock at cost\n(31,272,163)\n(30,867,287)\nTotal shareholders equity\n104,169,094\n92,829,435\nTotal liabilities and shareholders equity\n$\n363,429,200\n$\n289,124,527\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMCON Distributing Company and Subsidiaries\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFiscal Years Ended September\nSales (including excise taxes of $564.6 million and $467.1 million, respectively)\n$\n2,539,994,999\n$\n2,010,798,385\nCost of sales\n2,369,150,102\n1,883,078,819\nGross profit\n170,844,897\n127,719,566\nSelling, general and administrative expenses\n137,301,668\n101,474,359\nDepreciation and amortization\n7,576,646\n3,643,840\n144,878,314\n105,118,199\nOperating income\n25,966,583\n22,601,367\nOther expense (income):\nInterest expense\n8,550,431\n2,249,552\nChange in fair value of mandatorily redeemable non-controlling interest\n1,307,599\n1,476,986\nOther (income), net\n(1,193,840)\n(2,600,675)\n8,664,190\n1,125,863\nIncome from operations before income taxes\n17,302,393\n21,475,504\nIncome tax expense\n5,706,000\n6,473,380\nEquity method investment earnings, net of tax\n-\n1,670,133\nNet income available to common shareholders\n$\n11,596,393\n$\n16,672,257\nBasic earnings per share available to common shareholders\n$\n19.85\n$\n29.37\nDiluted earnings per share available to common shareholders\n$\n19.46\n$\n28.59\nBasic weighted average shares outstanding\n584,148\n567,697\nDiluted weighted average shares outstanding\n595,850\n583,062\nDividends paid per common share\n$\n5.72\n$\n5.72\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMCON Distributing Company and Subsidiaries\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nAdditional\nCommon Stock\nTreasury Stock\nPaid-in\nRetained\nShares\nAmount\nShares\nAmount\nCapital\nEarnings\nTotal\nBalance, October 1, 2021\n883,589\n$\n8,834\n(332,220)\n$\n(30,867,287)\n$\n24,918,781\n$\n83,552,298\n$\n77,612,626\nDividends on common stock, $5.72 per share\n-\n-\n-\n-\n-\n(3,440,202)\n(3,440,202)\nCompensation expense and issuance of stock in connection with equity-based awards\n33,420\n-\n-\n1,984,420\n-\n1,984,754\nNet income available to common shareholders\n-\n-\n-\n-\n-\n16,672,257\n16,672,257\nBalance, September 30, 2022\n917,009\n$\n9,168\n(332,220)\n$\n(30,867,287)\n$\n26,903,201\n$\n96,784,353\n$\n92,829,435\nDividends on common stock, $5.72 per share\n-\n-\n-\n-\n-\n(3,534,308)\n(3,534,308)\nCompensation expense and issuance of stock in connection with equity-based awards\n26,263\n-\n-\n3,682,187\n-\n3,682,450\nRepurchase of common stock\n-\n-\n(2,363)\n(404,876)\n-\n-\n(404,876)\nNet income available to common shareholders\n-\n-\n-\n-\n-\n11,596,393\n11,596,393\nBalance, September 30, 2023\n943,272\n$\n9,431\n(334,583)\n$\n(31,272,163)\n$\n30,585,388\n$\n104,846,438\n$\n104,169,094\nThe accompanying notes are an integral part of these consolidated financial statements.\nAMCON Distributing Company and Subsidiaries\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nSeptember\nSeptember\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income available to common shareholders\n$\n11,596,393\n$\n16,672,257\nAdjustments to reconcile net income available to common shareholders to net cash flows from (used in) operating activities:\nDepreciation\n7,161,468\n3,572,953\nAmortization\n415,178\n70,887\nEquity method investment earnings, net of tax\n-\n(1,670,133)\nGain on re-valuation of equity method investment to fair value\n-\n(2,387,411)\n(Gain) loss on sales of property and equipment\n(133,659)\n(140,139)\nEquity-based compensation\n2,717,370\n3,103,320\nDeferred income taxes\n2,589,372\n797,360\nProvision for losses on doubtful accounts\n(133,924)\n(32,420)\nInventory allowance\n(138,820)\n212,637\nChange in fair value of mandatorily redeemable non-controlling interest\n1,307,599\n1,476,986\nChanges in assets and liabilities, net of effects of business acquisition:\nAccounts receivable\n(138,956)\n3,032,876\nInventories\n(7,728,394)\n3,240,946\nPrepaid and other current assets\n(679,229)\n(5,344,754)\nEquity method investment distributions\n-\n1,095,467\nOther assets\n(163,340)\n(730,391)\nAccounts payable\n2,213,085\n332,400\nAccrued expenses and accrued wages, salaries and bonuses\n1,574,050\n2,482,409\nOther long-term liabilities\n298,914\n(653,419)\nIncome taxes payable and receivable\n(1,034,889)\n(2,241,755)\nNet cash flows from (used in) operating activities\n19,722,218\n22,890,076\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of property and equipment\n(11,561,347)\n(14,691,799)\nProceeds from sales of property and equipment\n151,808\n152,000\nPrincipal payment received on note receivable\n-\n175,000\nCash acquired in business combination\n-\n7,958\nAcquisition of Henry's (See Note 2)\n(54,865,303)\n-\nNet cash flows from (used in) investing activities\n(66,274,842)\n(14,356,841)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nBorrowings under revolving credit facilities\n2,512,309,723\n2,042,679,688\nRepayments under revolving credit facilities\n(2,463,134,172)\n(2,041,106,459)\nProceeds from borrowings on long-term debt\n7,000,000\n-\nPrincipal payments on long-term debt\n(2,349,065)\n(4,909,548)\nProceeds from exercise of stock options\n-\n173,590\nRepurchase of common stock\n(404,876)\n-\nDividends on common stock\n(3,534,308)\n(3,440,202)\nSettlement and withholdings of equity-based awards\n-\n(1,280,749)\nRedemption and distributions to non-controlling interest\n(2,975,323)\n(737,570)\nNet cash flows from (used in) financing activities\n46,911,979\n(8,621,250)\nNet change in cash\n359,355\n(88,015)\nCash, beginning of period\n431,576\n519,591\nCash, end of period\n$\n790,931\n$\n431,576\nSupplemental disclosure of cash flow information:\nCash paid during the period for interest\n$\n8,311,375\n$\n2,210,828\nCash paid during the period for income taxes, net of refunds\n4,141,370\n7,915,225\nSupplemental disclosure of non-cash information:\nEquipment acquisitions classified in accounts payable\n$\n1,015,534\n$\n91,656\nEffect of business acquisition (See Note 2)\n-\n23,308,624\nIssuance of common stock in connection with the vesting and exercise of\nequity-based awards\n2,044,805\n2,280,783\nThe accompanying notes are an integral part of these consolidated financial statements.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES:\n(a) Company Operations:\nAMCON Distributing Company and Subsidiaries (AMCON or the Company) serves customers in 31 states and is primarily engaged in the wholesale distribution of consumer products in the Central, Rocky Mountain, Mid-South and Mid-Atlantic regions of the United States.\nAMCONs wholesale distribution business includes nine distribution centers that sell approximately 20,000 different consumer products, including cigarettes and tobacco products, candy and other confectionery, beverages, groceries, paper products, health and beauty care products, frozen and refrigerated products and institutional foodservice products. The Company distributes products primarily to retailers such as convenience stores, discount and general merchandise stores, grocery stores, drug stores, and gas stations. In addition, the Company services institutional customers, including restaurants and bars, schools, sports complexes, as well as other wholesalers.\nAMCON, through its Healthy Edge Inc. subsidiary, operates 17 retail health food stores as Chamberlins Natural Foods, Akins Natural Foods, and Earth Origins Market. These stores carry natural supplements, organic and natural groceries, health and beauty care products, and other food items.\nThe Companys operations are subject to a number of factors which are beyond the control of management, such as changes in manufacturers cigarette pricing, state excise tax increases, or the opening of competing retail stores in close proximity to the Companys retail stores. While the Company sells a diversified product line, it remains dependent upon the sale of cigarettes which accounted for approximately 62% and 66% of the Companys consolidated revenue during fiscal 2023 and fiscal 2022, respectively, and 19% and 18% of the Companys consolidated gross profit during fiscal 2023 and fiscal 2022, respectively.\n(b) Accounting Period:\nThe Companys fiscal year ends on September 30th, except for one non-wholly owned subsidiary whose fiscal year ends on the last Friday of September, and the fiscal years ended September 30, 2023 and September 30, 2022 have been included herein.\n(c) Principles of Consolidation and Basis of Presentation:\nThe Consolidated Financial Statements include the accounts of AMCON and its wholly-owned subsidiaries including Henrys Foods, Inc. (Henrys) since February 2023 and, since May 2022, its non-wholly-owned equity investment in Team Sledd, LLC (Team Sledd). All significant intercompany accounts and transactions have been eliminated.\n(d) Cash and Accounts Payable:\nAMCON utilizes a cash management system under which an overdraft is the normal book balance in the primary disbursing accounts. Overdrafts included in accounts payable at September 2023 and September 2022 totaled approximately $3.3 million and $1.6 million, respectively, and reflect checks drawn on the disbursing accounts that have been issued but have not yet cleared through the banking system. The Companys policy has been to fund these outstanding checks as they clear with borrowings under its revolving credit facilities (see Note 7). These outstanding checks (book overdrafts) are classified as cash flows from operating activities in the Consolidated Statements of Cash Flows.\n(e) Accounts Receivable:\nAccounts receivable consist primarily of amounts due to the Company from its normal business activities, including trade receivables from customers and other receivables primarily related to various rebate and promotional incentives with the Companys suppliers. An allowance for doubtful accounts is maintained to reflect the expected uncollectibility of accounts\nreceivable based on past collection history, evaluation of economic conditions as they may impact our customers, and specific risks identified in the portfolio. The Company determines the past due status of trade receivables based on our terms with each customer. Account balances are charged off against the allowance for doubtful accounts when collection efforts have been exhausted and the account receivable is deemed worthless. Any subsequent recoveries of charged off account balances are recorded as income in the period received. As of September 2023 and September 2022, receivables from transactions with customers, less allowance for doubtful accounts were $69.4 million and $60.3 million, respectively.\n(f) Inventories:\nAt September 2023 and September 2022, inventories in our Wholesale Segment consisted of finished goods and are stated at the lower of cost or net realizable value, utilizing FIFO and average cost methods. Inventories in our Retail Segment consisted of finished goods and are stated at the lower of cost or market using the retail method. The wholesale distribution and retail health food segment inventories consist of finished products purchased in bulk quantities to be redistributed to the Companys customers or sold at retail. Finished goods included total reserves of approximately $1.2 million and $1.1 million at September 2023 and September 2022, respectively. These reserves include the Companys obsolescence allowance, which reflects estimated unsaleable or non-refundable inventory based upon an evaluation of slow moving and discontinued products.\n(g) Prepaid Expenses and Other Current Assets:\nA summary of prepaid expenses and other current assets is as follows (in millions):\nSeptember 2023\nSeptember 2022\nPrepaid expenses\n$\n4.3\n$\n3.1\nPrepaid inventory\n9.3\n9.6\n$\n13.6\n$\n12.7\nPrepaid inventory represents inventory in-transit that has been paid for but not received.\n(h) Property and Equipment:\nProperty and equipment are stated at cost less accumulated depreciation or amortization. Major renewals and improvements are capitalized and charged to expense over their useful lives through depreciation or amortization charges. Repairs and maintenance are charged to expense in the period incurred. The straight-line method of depreciation is used to depreciate assets over the estimated useful lives as follows:\nYears\nLand improvements\n-\nBuildings and improvements\n-\nWarehouse equipment\n-\nFurniture, fixtures and leasehold improvements\n-\nVehicles\n-\nCosts and accumulated depreciation applicable to assets retired or sold are eliminated from the accounts, and the resulting gains or losses are reported as a component of operating income.\nThe Company reviews property and equipment for indicators of impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Cash flows expected to be generated by the asset group are estimated over the assets useful life of the primary asset and based on updated projections on an undiscounted basis. If the evaluation indicates that the carrying value of the asset group may not be recoverable, the potential impairment is determined based on the amount by which the carrying value of the asset group exceeds the fair value of the asset group. During fiscal 2022, the Company recorded an impairment of fixed assets in an amount less than $0.1 million as a result of Hurricane Ian. There was no impairment of any property and equipment during fiscal 2023.\n(i) Leases:\nLease liabilities are equal to the present value of the remaining fixed lease payments. Right-of-use (ROU) assets are determined based on the amount of the lease liability, plus initial direct costs incurred less lease incentives. The Company determines its incremental borrowing rates based on information available at the lease commencement date in calculating the present value of its lease payments. The Company does not recognize assets or liabilities for leases with an initial term of twelve months or less and these short-term lease payments are recognized in the consolidated statements of operations on a straight-line basis over the lease term. The Company elected the practical expedient to account for non-lease components as part of the lease for all asset classes. The Company reviews its ROU lease assets for indicators of impairment in the same manner as its other property and equipment as described above in (h) Property and Equipment.\n(j) Goodwill and Intangible Assets:\nGoodwill consists of the excess purchase price paid in certain business combinations over the fair value of assets acquired and generally represents synergies and economies of scale generated through reductions in selling, general, and administrative expenses. Intangible assets consist of trademarks, tradenames, and customer relationships acquired as part of acquisitions in addition to certain non-competition agreements. Goodwill and the trademarks and tradenames for our Retail Segment are considered to have indefinite lives.\nGoodwill and intangible assets having indefinite useful lives are not amortized into the results of operations, but instead are reviewed annually or more frequently if events or changes in circumstances indicate that the assets might be impaired, to assess whether their fair value exceeds their carrying value. The Company performs its annual goodwill and intangible asset impairment assessment during the fourth fiscal quarter of each year.\nWhen evaluating the potential impairment of non-amortizable indefinite lived assets and goodwill, the Company first assesses a range of qualitative factors, including but not limited to, macroeconomic conditions, industry conditions, the competitive environment, changes in the market for the Companys products and services, market prices, regulatory and political developments, entity specific factors such as strategy and changes in key personnel, and the overall financial performance for each of the Companys reporting units. If after completing this assessment, the Company determines that it is more likely than not that the fair value of a reporting unit is less than its carrying value, a quantitative evaluation is performed using the income approach (discounted cash flow method).\nA discounted cash flow methodology requires the estimation of a wide range of factors including but not limited to: (i) forecasting future earnings and cash flows, (ii) determining the discount rate applicable to the earnings stream being discounted, and (iii) computing a terminal value at some point in the future. These estimations require significant judgment and include making assumptions such as sales growth rates including the addition of new retail stores, future store profitability, planned capital expenditures, our ability to control costs, the successful implementation of initiatives designed to enhance sales and improve inventory management, gross profit estimates, macroeconomic conditions, industry conditions, the competitive environment, changes in the market for the Companys products and services, regulatory and political developments, entity specific factors such as strategy and changes in key personnel, working capital requirements, weighted average cost of capital, and current and anticipated operating conditions. The use of different assumptions or estimates for future cash flows could produce different results.\nFor goodwill impairment testing, the Company utilizes the guidance in Accounting Standards Codification (ASC) 350 - Intangibles - Goodwill and Other whereby a reporting units carrying value is compared to its fair value and impairment charges are recognized for an amount by which a reporting units carrying amount exceeds its fair value.\nThe Companys identifiable intangible assets with finite lives are amortized over their estimated useful lives and are assessed for impairment whenever events or circumstances change which may indicate that the carrying amount of the assets may not be recoverable. Identifiable intangible assets which are subject to amortization are evaluated for impairment using a process similar to that used in evaluating the elements of property and equipment. If impaired, the related assets are written down to their estimated fair value.\n(k) Equity Method Investment:\nThe Company uses the equity method to account for its investment in an investee if the investment provides the ability to exercise significant influence, but not control, over operating and financial policies of the investee. The Companys proportionate share of the net income or loss (net of income taxes) of the investee is included in consolidated net earnings.\nJudgment regarding the level of influence over its equity method investment includes considering key factors such as the Companys ownership interest, representation on the board of directors, participation in policy-making decisions and material intercompany transactions. The Company evaluates its equity method investment for impairment whenever events or changes in circumstances indicate that the carrying amount of the investment might not be recoverable. Factors considered by the Company when reviewing its equity method investment for impairment include the length of time (duration) and the extent (severity) to which the fair value of the equity method investment has been less than cost, the investees financial condition and future prospects, and the intent and ability to hold the investment for a period of time sufficient to allow for anticipated recovery. An impairment that is other-than-temporary is recognized in the period identified. See Note 2 Acquisitions for further information relating to the Companys equity method investment.\n(l) Revenue Recognition:\nThe Company recognizes revenues when the performance obligation is satisfied, which is the point where control of the promised goods or services is transferred to its customers, in an amount that reflects the consideration the Company expects to be entitled to receive in exchange for those goods or services. For the majority of the Companys customer arrangements, control transfers to customers at a point-in-time when goods have been delivered, as that is generally when legal title, physical possession and risks and rewards of goods/services transfers to the customer. The timing of satisfaction of the performance obligation is not subject to significant judgment due to the simultaneous nature of the Companys customer arrangements (same day creation and fulfillment). After the completion of its performance obligations, the Company has an unconditional right of payment from customers with varying collection and payment terms based on region, credit risk, and other situational factors. Customer receivables are included on the consolidated balance sheets less an allowance for doubtful accounts. The Company has elected the practical expedient permitting it to disregard financing components which may be deemed to be part of its transaction price as its customary payments terms are less than one year. See Note 13 Business Segments for the disaggregation of net sales for each of our business segments.\n(m) Insurance:\nThe Companys workers compensation, general liability, and employee-related health care benefits are provided through high-deductible or self-insurance programs. As a result, the Company accrues for its workers compensation and general liability based upon a claim reserve analysis. The Company has issued a letter of credit in the amount of $0.5 million to its workers compensation insurance carrier as part of its loss control program. The reserve for incurred, but not reported, employee health care benefits is calculated using the Companys historical claims experience rate, plus specific reserves for large claims. The reserves associated with the exposure to these liabilities are reviewed by management for adequacy at the end of each reporting period.\n(n) Income Taxes:\nThe Company uses the asset and liability method to calculate deferred income taxes. Deferred tax assets and liabilities are recognized on temporary differences between financial statement and tax bases of assets and liabilities using enacted tax rates. The effect of tax rate changes on deferred tax assets and liabilities is recognized in income during the period that includes the enactment date. Deferred tax assets are reduced by a valuation allowance when we do not consider it more likely than not that some portion or all of the deferred tax assets will be realized.\n(o) Share-Based Compensation:\nThe Company recognizes expense for its share-based compensation based on the fair value of the awards that are granted. The fair value of stock options are estimated at the date of grant using the Black-Scholes option pricing model. Option pricing methods require the input of highly subjective assumptions, including the expected stock price volatility. The fair value of restricted stock units and restricted stock awards is based on the period ending closing price of the Companys\ncommon stock. Measured compensation cost is recognized ratably over the vesting period of the related share-based compensation award and is reflected in our Consolidated Statement of Operations under Selling, general and administrative expenses.\n(p) Customer Sales Incentives:\nThe Company provides consideration to customers, such as sales allowances or discounts on a regular basis. In accordance with ASC 606, the Company estimates customer sales incentives due as sales are made and records them as a reduction of net sales.\n(q) Excise Taxes:\nUnder ASC 606, the Company is primarily responsible for excise taxes levied on cigarette and other tobacco products and presents excise taxes as a component of revenue.\n(r) Contract Costs:\nUnder ASC 606, the Company expenses as incurred any incremental costs to obtain and fulfill customer contracts as the related amortization period would be one year or less.\n(s) Per-share Results:\nBasic earnings or loss per share data are based on the weighted-average number of common shares outstanding during each period. Diluted earnings or loss per share data are based on the weighted-average number of common shares outstanding and the effect of all dilutive potential common shares including stock options, restricted stock units and restricted stock awards.\n(t) Use of Estimates:\nThe preparation of the consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\n(u) Fair Value Measurements:\nThe Companys financial assets and liabilities are recognized or disclosed at fair value in the financial statements on a recurring basis. The carrying amount of trade accounts receivable, other receivables, accounts payable and other accrued liabilities approximates fair value because of the short maturity of these financial instruments. The carrying amount of the Companys variable and fixed rate debt also approximates fair value.\n(v) Mandatorily Redeemable Non-Controlling Interest:\nMandatorily redeemable non-controlling interest (MRNCI) recorded on the Companys consolidated balance sheets represent the fair value of the non-controlling interest in the Companys strategic investment in Team Sledd. The Company has elected to present the MRNCI liability at fair value under ASC 825 - Financial Instruments (ASC 825) as it believes this best represents the potential future liability and cash flows. The Company calculates the estimated fair value of the MRNCI based on a discounted cash flow valuation technique using the best information available at the reporting date, and records changes in the fair value of the MRNCI as a component of other expense (income) in the Consolidated Statements of Operations. The Company estimates the probability and timing of future redemptions and earnings of Team Sledd based on managements knowledge and assumptions of certain events as of each reporting date, including the timing of any future redemptions and an appropriate discount rate. The MRNCI is classified as Level 3 because of the Companys reliance on unobservable assumptions.\n(w) Business Combinations:\nThe acquisition method of accounting for business combinations under ASC 805 - Business Combinations (ASC 805) requires management to use significant estimates and assumptions, including fair value estimates, as of the business combination date and to refine those estimates as necessary during the measurement period (defined as the period, not to exceed one year, in which the Company is allowed to adjust the provisional amounts recognized for a business combination).\n(x) Accounting Pronouncements:\nRecent Accounting Pronouncements\nIn June 2016, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2016-13, Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which introduces a forward-looking approach, based on expected losses, to estimate credit losses on certain types of financial instruments, including trade receivables. The estimate of expected credit losses will require entities to incorporate considerations of historical information, current information and reasonable and supportable forecasts. This ASU also expands the disclosure requirements to enable users of financial statements to understand the entitys assumptions, models and methods for estimating expected credit losses. This guidance is effective for fiscal years beginning after December 15, 2022 (fiscal 2024 for the Company) with early adoption permitted. The Company does not expect the adoption of ASU 2016-13 to have a material effect on its consolidated financial statements.\n2. ACQUISITIONS\nHenrys Foods, Inc.\nOn February 3, 2023, the Company, through its wholly owned subsidiary, LOL Foods, Inc., paid approximately $54.9 million in cash to acquire substantially all of the operating assets of Henrys, a wholesale distributor to convenience stores and other retail formats operating in Minnesota, North Dakota, South Dakota, Iowa, and Wisconsin. In connection with the transaction, the Company also assumed certain operating liabilities totaling approximately $1.2 million, including approximately $0.2 million of operating leases. The transaction was funded with borrowings from the Companys existing bank group. Costs to effectuate the acquisition were not significant and were expensed as incurred. Strategically, the acquisition expands the Companys footprint in the North Central portion of the United States and enhances the product and service offerings available to its customer base.\nThe Company paid cash consideration for the net acquired assets and their related values as of the acquisition date, measured in accordance with FASB ASC 805. In valuing identifiable intangible assets, the Company has estimated the fair value using the discounted cash flows methodology with the assistance of an independent valuation advisor. Inputs and projections used to measure the fair value as of the acquisition date included, but were not limited to, sales growth, gross profit estimates, royalty and customer retention rates, economic and industry conditions, working capital requirements and various other operational considerations. Henrys is being reported as a component of the Companys Wholesale Segment.\nThe following purchase price allocation reflects the amounts of identifiable assets and liabilities assumed:\nAccounts receivable\n$\n8,237,652\nInventories\n16,060,965\nPrepaid and other assets\n400,964\nProperty and equipment\n27,216,323\nOther intangible assets\n3,607,000\nLiabilities assumed\n(1,157,976)\nTotal identifiable net assets\n$\n54,364,928\nTotal identifiable net assets\n$\n54,364,928\nGoodwill\n500,375\nConsideration transferred\n$\n54,865,303\nAccounts receivable were recorded at their fair value representing the amount we expect to collect, which also approximated the gross contractual values of such receivables at the acquisition date. Goodwill totaling approximately $0.5 million arose from the acquisition and primarily represents synergies and economies of scale generated through reductions in selling, general, and administrative expenses. This goodwill has been assigned to the Companys Wholesale Segment and is expected to be deductible for tax purposes.\nOther intangible assets acquired consisted of the following:\nAcquisition-Date\nUseful Life\nOther Intangible Asset\nFair Value\n(Years)\nCustomer list\n$\n2,010,000\nNon-competition agreement\n95,000\nTrade name\n1,502,000\n$\n3,607,000\nThe following table sets forth the unaudited supplemental financial data for Henrys from the acquisition date through September 2023, which is included in the Companys consolidated results for fiscal 2023.\nRevenue\n$\n220,636,797\nNet income available to common shareholders\n$\n2,448,853\nTeam Sledd, LLC\nThe Company and Chas. M. Sledd Company (Sledd), a West Virginia wholesale distributor serving the convenience store industry, jointly own and operate Team Sledd, a limited liability company which owns and operates Sledds wholesale distribution business.\nPursuant to an operating agreement between the Company and Sledd, certain membership interests in Team Sledd may be redeemed over a period of years, with such redemptions being funded from the operations of Team Sledd. Any such redemptions would result in a corresponding increase in AMCONs ownership percentage in Team Sledd. In May 2022 (the Control Date), Team Sledd redeemed additional membership interests from certain members. Prior to May 2022, the Company had a minority interest in Team Sledd, which had been accounted for under the equity method. As a result of the May 2022 redemption, the Company became the majority owner of Team Sledd with a controlling interest of approximately 56%. The Company provided no additional consideration to acquire control of Team Sledd. The costs incurred to effectuate the acquisition were not significant and were expensed as incurred. The acquisition expands the Companys footprint and enhances our ability to service customers in the Mid-Atlantic region of the United States.\nThe transaction was accounted for in accordance with ASC 805 and the Company measured the fair value of its previously held equity interest and the related noncontrolling interest using the discounted cash flow methodology with the assistance of independent valuation consultants. The total fair value of Team Sledd was approximately $23.3 million, which resulted in a gain of approximately $2.4 million related to the fair value remeasurement of the Companys ownership interest in Team Sledd. The gain was recorded as a component of other income in the Companys Consolidated Statement of Operations for fiscal 2022. In connection with the transaction, the Company recorded a deferred tax liability of approximately $0.6 million which will be recognized in future periods when the associated taxes become due. Inputs used to measure the acquisition-date fair value of the Companys previously held equity interest and the related non-controlling interest in the entity included sales growth, gross profit estimates, economic and industry conditions, working capital requirements and the contractual requirements of the operating agreement. Team Sledd is being reported as a component of the Companys Wholesale Segment.\nThe following tables summarize the acquisition-date fair value of Team Sledd, the fair value of Team Sledds assets and liabilities at the Control Date, and the resulting goodwill.\nAcquisition-date fair value of non-controlling interest\n$\n10,419,139\nAcquisition-date fair value of previously held interest\n12,897,443\nFair value of Team Sledd at the Control Date\n$\n23,316,582\nAmounts of identifiable assets and liabilities at fair value:\nCash\n$\n7,958\nAccounts receivable\n29,524,181\nInventories\n42,896,135\nPrepaid and other current assets\n2,533,205\nProperty and equipment\n21,002,604\nOperating lease right-of use assets\n1,501,996\nOther intangible assets\n1,664,000\nOther assets\n1,685,945\nLiabilities assumed\n(78,340,442)\nTotal identifiable net assets\n$\n22,475,582\nGoodwill\n841,000\n$\n23,316,582\nAccounts receivable were recorded at their fair value representing the amount we expect to collect. Gross contractual amounts receivable were approximately $1.7 million more than their acquisition-date fair value.\nGoodwill totaling approximately $0.8 million arose from the acquisition and primarily represents synergies and economies of scale generated through reductions in selling, general, and administrative expenses. This goodwill has been assigned to the Companys Wholesale Segment and is deductible for tax purposes.\nOther intangible assets acquired consisted of the following:\nAcquisition-Date\nUseful Life\nOther Intangible Asset\nFair Value\n(Years)\nCustomer list\n$\n1,442,000\nNon-competition agreement\n222,000\n$\n1,664,000\nTeam Sledds summarized financial data prior to the Control Date for the period ended September 2022 was as follows:\nFor the year ended September 2022\nSales\n$\n393,606,372\nGross profit\n21,759,753\nNet income before income taxes\n4,498,190\nNet income attributable to AMCON, net of tax\n1,670,133\nThe following table sets forth the unaudited supplemental financial data for Team Sledd from the Control Date through September 2022, which is included in the Companys consolidated results for fiscal 2022.\nRevenue\n$\n298,410,724\nNet income available to common shareholders\n$\n3,220,702\nThe following table presents unaudited supplemental pro forma information assuming the Company acquired Henrys on October 1, 2021, in addition to holding a 64% interest in Team Sledd on October 1, 2021. These pro forma amounts do not purport to be indicative of the actual results that would have been obtained had the acquisitions occurred at that time.\nFor the year ended September 2023\nFor the year ended September 2022\nRevenue\n$\n2,643,786,694\n$\n2,733,975,410\nNet income available to common shareholders\n$\n11,764,886\n$\n22,109,103\n3. EARNINGS PER SHARE:\nBasic earnings per share available to common shareholders is calculated by dividing net income by the weighted average number of common shares outstanding for each period. Diluted earnings per share available to common shareholders is calculated by dividing income from operations by the sum of the weighted average number of common shares outstanding and the weighted average dilutive equity awards.\nFor Fiscal Years\nBasic\nBasic\nWeighted average number of common shares outstanding\n584,148\n567,697\nNet income available to common shareholders\n$\n11,596,393\n$\n16,672,257\nNet earnings per share available to common shareholders\n$\n19.85\n$\n29.37\nFor Fiscal Years\nDiluted\nDiluted\nWeighted average number of common shares outstanding\n584,148\n567,697\nWeighted average of net additional shares outstanding assuming dilutive options exercised and proceeds used to purchase treasury stock (1)\n11,702\n15,365\nWeighted average number of shares outstanding\n595,850\n583,062\nNet income available to common shareholders\n$\n11,596,393\n$\n16,672,257\nNet earnings per share available to common shareholders\n$\n19.46\n$\n28.59\n(1) Diluted earnings per share calculation includes all equity-based awards deemed to be dilutive.\n4. PROPERTY AND EQUIPMENT, NET:\nProperty and equipment at September 2023 and September 2022 consisted of the following:\nLand and improvements\n$\n4,292,142\n$\n2,747,857\nBuildings and improvements\n43,963,416\n30,515,259\nWarehouse equipment\n23,894,049\n17,488,059\nFurniture, fixtures and leasehold improvements\n16,869,932\n14,190,976\nVehicles\n12,962,265\n4,531,831\nConstruction in progress\n18,798,343\n12,216,453\n120,780,147\n81,690,435\nLess accumulated depreciation:\n(40,172,696)\n(33,604,915)\nProperty and equipment, net\n$\n80,607,451\n$\n48,085,520\nDuring fiscal 2023 and fiscal 2022, respectively, the Company capitalized approximately $0.8 million and $0.1 million of interest on funds borrowed to finance certain capital expenditures. Capitalized interest is recorded as part of an assets cost and will be depreciated over the assets useful life.\n5. LEASES:\nThe Companys Wholesale Segment leases certain warehouse facilities, office space, vehicles and office equipment. The Companys Retail Segment leases store space in various shopping center complexes and certain office space. Certain of the warehouse and retail store leases include one or more options to renew or terminate the applicable lease agreement, with the exercise of such options at the Companys discretion. The Companys leases do not contain any significant residual value guarantees nor do they impose any significant restrictions or covenants other than those customarily found in similar types of leases.\nThe operating ROU lease assets and liabilities recorded on the Companys consolidated balance sheets consist of fixed lease payments. Leases with an initial term of twelve months or less are not recorded on the consolidated balance sheets and are expensed on a straight-line basis over the lease term. Additionally, certain leases contain variable payments such as vehicle leases with per-mile charges or retail leases with an additional rent payment based on store performance. These variable payments are expensed as incurred. The Company combines lease components and non-lease components for all asset classes for purposes of recognizing lease assets and liabilities. The Company determines its incremental borrowing rates based on information available at the lease commencement date in calculating the present value of lease payments. The Company reviews its ROU lease assets for indicators of impairment in the same manner as its other property and equipment as described in Note 1.\nLeases consist of the following:\nAssets\nClassification\nSeptember 2023\nSeptember 2022\nOperating\nOperating lease right-of-use assets\n$\n23,173,287\n$\n19,941,009\nLiabilities\nCurrent:\nOperating\nOperating lease liabilities\n$\n6,063,048\n$\n6,454,473\nNon-current:\nOperating\nLong-term operating lease liabilities\n17,408,758\n13,787,721\nTotal lease liabilities\n$\n23,471,806\n$\n20,242,194\nThe components of lease costs were as follows:\nFiscal Year 2023\nFiscal Year 2022\nOperating lease cost\n$\n7,673,309\n$\n6,690,239\nShort-term lease cost\n500,372\n238,106\nVariable lease cost\n467,164\n430,033\nNet lease cost\n$\n8,640,845\n$\n7,358,378\nMaturities of lease liabilities as of September 2023 were as follows:\nOperating Leases\n$\n7,067,221\n5,905,993\n4,666,784\n3,189,966\n2,095,335\n2029 and thereafter\n3,828,522\nTotal lease payments\n26,753,821\nLess: interest\n(3,282,015)\nPresent value of lease liabilities\n$\n23,471,806\nWeighted-average remaining lease term and weighted-average discount rate information regarding the Companys leases were as follows:\nLease Term\nSeptember 2023\nSeptember 2022\nWeighted-average remaining lease term (years):\nOperating\n5.2\n4.0\nDiscount Rate\nWeighted-average discount rate:\nOperating\n4.97\n%\n4.09\n%\nOther information regarding the Companys leases were as follows:\nFiscal Year 2023\nFiscal Year 2022\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows used by operating leases\n$\n7,642,556\n$\n6,704,890\nLease liabilities arising from obtaining new ROU assets:\nOperating leases\n$\n5,541,096\n$\n5,854,111\n6. GOODWILL AND OTHER INTANGIBLE ASSETS:\nGoodwill at September 2023 and September 2022 was as follows:\nSeptember\nSeptember\nBalance, beginning of period\n$\n5,277,950\n$\n4,436,950\nAcquisitions (See Note 2)\n500,375\n841,000\nBalance, end of period\n$\n5,778,325\n$\n5,277,950\nOther intangible assets at September 2023 and September 2022 consisted of the following:\nSeptember\nSeptember\nCustomer lists (Wholesale Segment) (less accumulated amortization of $0.2 million at September 2023 and less than $0.1 million at September 2022)\n$\n3,226,480\n$\n1,401,945\nNon-competition agreements (Wholesale Segment) (less accumulated amortization of $0.1 million at September 2023 and less than $0.1 million at September 2022)\n199,503\n191,168\nTradename (Wholesale Segment) (less accumulated amortization of $0.1 million at September 2023)\n1,358,952\n-\nTrademarks and tradenames (Retail Segment)\n500,000\n500,000\n$\n5,284,935\n$\n2,093,113\nGoodwill, trademarks and tradenames are considered to have indefinite useful lives and therefore no amortization has been taken on these assets. Goodwill recorded on the Companys consolidated balance sheets represents amounts allocated to its wholesale reporting unit which totaled approximately $5.8 million and $5.3 million at September 2023 and September 2022, respectively. The Company determined that the estimated fair value of its wholesale reporting unit exceeded its carrying value at both September 2023 and September 2022.\nAt September 2023, identifiable intangible assets considered to have finite lives were represented by customer lists which are being amortized over 15 years, a non-competition agreement which is being amortized over three years, a non-competition agreement which is being amortized over five years, and a tradename in our Wholesale Segment that is being amortized over seven years. These intangible assets are evaluated for accelerated attrition or amortization adjustments if warranted. Amortization expense related to these assets was $0.4 million and $0.1 million during fiscal 2023 and fiscal 2022, respectively.\nEstimated future amortization expense related to identifiable intangible assets with finite lives was as follows at September 2023:\nSeptember\nFiscal 2024\n$\n537,701\nFiscal 2025\n506,869\nFiscal 2026\n463,703\nFiscal 2027\n463,703\nFiscal 2028\n451,043\nFiscal 2029 and thereafter\n2,361,916\n$\n4,784,935\n7. DEBT:\nThe Company primarily finances its operations through three credit facility agreements (a) a facility that is an obligation of AMCON Distributing Company (the AMCON Facility), (b) a facility that is an obligation of Team Sledd (the Team Sledd Facility ) and (c) a facility that is an obligation of Henrys (the Henrys Facility), and collectively together (the Facilities) and long-term debt agreements with banks. The Team Sledd Facility and the Henrys Facility are non- recourse to AMCON Distributing Company, are not guaranteed by AMCON Distributing Company and have no cross default provisions applicable to AMCON Distributing Company. In Q3 2023, the Company amended the Team Sledd Facility, increasing its aggregate borrowing capacity from $70.0 million to $80.0 million, extending the maturity date to March 2028, and adding certain real estate property as eligible borrowing collateral under the agreement.\nAt September 2023, the Facilities had a total combined borrowing capacity of $300.0 million, including provisions for up to $30.0 million in credit advances for certain inventory purchases, which are limited by accounts receivable and inventory qualifications, and the value of certain real estate collateral. The Henrys Facility matures in February 2026, the AMCON Facility matures in June 2027 and the Team Sledd Facility matures in March 2028, each without a penalty for prepayment. Obligations under the Facilities are collateralized by substantially all of the Companys respective equipment, intangibles, inventories, accounts receivable, and certain real estate. The Facilities each feature an unused commitment fee and\nspringing financial covenants. Borrowings under the Facilities bear interest at either the banks prime rate or the Secured Overnight Financing Rate (SOFR), plus any applicable spreads.\nThe amount available for use from the Facilities at any given time is subject to a number of factors, including eligible accounts receivable and inventory balances that fluctuate day-to-day, as well as the value of certain real estate collateral. Based on the collateral and loan limits as defined in the Facility agreements, the credit limit of the combined Facilities at September 2023 was $239.1 million, of which $140.4 million was outstanding, leaving $98.7 million available.\nThe average interest rate of the Facilities was 7.03% at September 2023. During fiscal 2023, the peak borrowings under the Facilities was $159.7 million, and the average borrowings and average availability under the Facilities was $124.3 million and $86.4 million, respectively.\nLONG-TERM DEBT\nIn addition to the Facilities, the Company also had the following long-term obligations at September 2023 and September 2022.\nUnsecured note payable, interest payable at a fixed rate of 4.50% with quarterly installments of principal and interest of $49,114 through June 2023 with remaining principal due September 2023\n-\n968,589\nNote payable, interest payable at a fixed rate of 4.10% with monthly installments of principal and interest of $53,361 through June 2033 with remaining principal due July 2033, collateralized by Team Sledd's principal office and warehouse\n5,174,188\n5,572,766\nNote payable, interest payable at a fixed rate of 3.25% with monthly installments of principal and interest of $17,016 through August 2034 with remaining principal due September 2034, collateralized by Team Sledd's principal office and warehouse\n1,891,638\n2,052,327\nNote payable with monthly installments of principal and interest of $7,934 through February 2025 with remaining principal due March 2025, and an effective variable rate of 7.58% at September 2023, collateralized by certain of Team Sledd's equipment\n288,237\n385,887\nNote payable, interest payable at a fixed rate of 6.04% with monthly installments of principal and interest of $135,469 through February 2028, collateralized by certain of Henry's equipment\n6,276,441\n-\n13,630,504\n8,979,569\nLess current maturities\n(1,955,065)\n(1,595,309)\n$\n11,675,439\n$\n7,384,260\nThe aggregate minimum principal maturities of the long-term debt for each of the next five fiscal years are as follows:\nFiscal Year Ending\n$\n1,955,065\n2,155,322\n2,070,599\n2,185,096\n1,345,134\n2029 and thereafter\n3,919,288\n$\n13,630,504\nMarket rate risk for fixed rate debt is estimated as the potential increase in fair value of debt obligations resulting from decreases in interest rates. Based on the borrowing rates currently available to the Company for bank loans with similar terms and average maturities, the fair value of the Companys long-term debt approximated its carrying value at September 2023.\nCross Default and Co-Terminus Provisions\nTeam Sledds three notes payable and the Team Sledd Facility contain cross default provisions. The Henrys note payable and the Henrys Facility contain cross default provisions. There were no such cross defaults for either Team Sledd or Henrys at September 2023. Additionally, the Team Sledd Facility and the Henrys Facility are non-recourse to AMCON Distributing Company, are not guaranteed by AMCON Distributing Company and have no cross default provisions applicable to AMCON Distributing Company. The Company and its subsidiaries, including Team Sledd and Henrys, were in compliance with all of the financial covenants under the respective Facilities at September 2023.\nOther\nThe Company has issued a letter of credit for $0.5 million to its workers compensation insurance carrier as part of its self-insured loss control program.\n8. INCOME TAXES:\nThe components of income tax expense from operations for fiscal 2023 and fiscal 2022 consisted of the following:\nCurrent: Federal\n$\n2,324,897\n$\n4,437,197\nCurrent: State\n791,731\n1,238,823\n3,116,628\n5,676,020\nDeferred: Federal\n2,199,672\n677,357\nDeferred: State\n389,700\n120,003\n2,589,372\n797,360\nIncome tax expense\n$\n5,706,000\n$\n6,473,380\nThe difference between the Companys income tax expense in the accompanying consolidated financial statements and the amount that would be calculated using the statutory income tax rate of 21% for both fiscal 2023 and fiscal 2022 on income from operations before income taxes is as follows:\nTax at statutory rate\n$\n3,633,503\n$\n4,509,855\nNondeductible business expenses\n1,313,864\n1,333,491\nState income taxes, net of federal tax benefit\n924,567\n1,072,735\nTax attributable to non-controlling interest\n(443,831)\n(298,305)\nOther\n277,897\n(144,396)\n$\n5,706,000\n$\n6,473,380\nTemporary differences between the financial statement carrying balances and tax basis of assets and liabilities giving rise to net deferred tax assets (liabilities) at September 2023 and September 2022 relates to the following:\nDeferred tax assets:\nAllowance for doubtful accounts\n$\n253,252\n$\n281,927\nAccrued expenses\n273,313\n1,090,219\nInventory\n533,723\n414,239\nOther\n618,256\n163,399\nInterest expense limitation\n753,451\n-\nNet operating loss carry forwards - state\n697,013\n697,013\nTotal gross deferred tax assets\n3,129,008\n2,646,797\nLess: Valuation allowance\n(697,013)\n(697,013)\nTotal net deferred tax assets\n2,431,995\n1,949,784\nDeferred tax liabilities:\nTrade discounts\n471,126\n418,660\nOperating lease, right-of-use assets\n97,468\n91,954\nProperty and equipment\n5,725,493\n2,337,447\nGoodwill\n921,799\n921,799\nOther\n-\n412,221\nIntangible assets\n134,069\n96,291\nTotal deferred tax liabilities\n7,349,955\n4,278,372\nTotal net deferred income tax liability\n$\n4,917,960\n$\n2,328,588\nThe Company had a valuation allowance of approximately $0.7 million at both September 2023 and September 2022, against certain state net operating losses, which more likely than not will not be utilized. The Company had no material unrecognized tax benefits, interest, or penalties during fiscal 2023 or fiscal 2022, and the Company does not anticipate any such items during the next twelve months. The Companys policy is to record interest and penalties directly related to income taxes as income tax expense in the Consolidated Statements of Operations. The Company files income tax returns in the U.S. and various states and the tax years 2020 and forward remain open under U.S. and state statutes.\n9. MANDATORILY REDEEMABLE NON-CONTROLLING INTEREST\nMRNCI recorded on the Companys consolidated balance sheets represents the fair value of the non-controlling interest in the Companys strategic investment in Team Sledd. During April 2023, Team Sledd redeemed certain membership interests from its non-controlling interest, which increased the Companys ownership interest to approximately 64% as of September 2023. The Company owned approximately 56% of Team Sledd as of September 2022. The Company has elected to present the MRNCI liability at fair value under ASC 825 as it believes this best represents the potential future liability and cash flows. As such, the MRNCI balance at September 2023 represents the fair value of the remaining future membership interest redemptions and other amounts due to noncontrolling interest holders through April 2026. At September 2023, the difference between the contractual amount due under the MRNCI and the fair value was approximately $0.7 million. The following table presents changes in the fair value of the MRNCI since September 2022:\nFair value of MRNCI as of September 2022\n$\n11,158,555\nRedemption of non-controlling interests\n(1,812,558)\nDistributions to non-controlling interest\n(1,162,765)\nChange in fair value\n1,307,599\nFair value of MRNCI as of September 2023\n$\n9,490,831\nLess current portion at fair value\n(1,703,604)\n$\n7,787,227\n10. PROFIT SHARING PLANS:\nThe Company sponsors two profit sharing plans (i.e., section 401(k) plans) covering substantially all employees. One plan (the AMCON Plan) covers the employees not employed by Team Sledd. The other plan (the Team Sledd Plan and together with the AMCON Plan, the Plans) covers the employees of Team Sledd. The Plans allow employees to make voluntary contributions up to 100% of their compensation, subject to Internal Revenue Service limits. Under the AMCON Plan, the Company matches 100% of the first 2% contributed and 50% of the next 4% contributed for a maximum match of 4% of employee compensation. Under the Team Sledd Plan, the Company matches 100% of employee contributions up to 5%. The Company made matching contributions (net of employee forfeitures) to the Plans of approximately $1.6 million in fiscal 2023 and $1.2 million in fiscal 2022.\n11. COMMITMENTS AND CONTINGENCIES:\nLiability Insurance\nThe Company carries property, general liability, vehicle liability, directors and officers liability and workers compensation insurance. Additionally, the Company carries an umbrella liability policy to provide excess coverage over the underlying limits of the aforementioned primary policies.\nThe Companys insurance programs for workers compensation, general liability, and employee related health care benefits are provided through high deductible or self-insured programs. Claims in excess of self-insurance levels are fully insured subject to policy limits. Accruals are based on historical claims experience, actual claims filed, and estimates of claims incurred but not reported.\nThe Companys liabilities for unpaid and incurred, but not reported claims, for workers compensation, general liability, and health insurance was $2.2 million at September 2023 and $1.9 million at September 2022. These amounts are included in accrued expenses in the accompanying Consolidated Balance Sheets. While the ultimate amount of claims incurred is dependent on future developments, in the Companys opinion, recorded reserves are adequate to cover the future payment of claims previously incurred. However, it is possible that recorded reserves may not be adequate to cover the future payment of claims.\nAdjustments, if any, to claims estimates previously recorded, resulting from actual claim payments, are reflected in operations in the periods in which such adjustments are known.\nA summary of the activity in the Companys self-insured liabilities reserve is set forth below (in millions):\nBeginning balance\n$\n1.9\n$\n1.5\nCharged to expense\n11.7\n8.3\nPayments\n(11.4)\n(7.9)\nEnding balance\n$\n2.2\n$\n1.9\n12. EQUITY-BASED INCENTIVE AWARDS:\nOmnibus Plans\nThe Company has three equity-based incentive plans, the 2014 Omnibus Incentive Plan, the 2018 Omnibus Incentive Plan, and the 2022 Omnibus Incentive Plan (collectively the Omnibus Plans), which provide for equity incentives to employees. Each Omnibus Plan was designed with the intent of encouraging employees to acquire a vested interest in the growth and performance of the Company. The Omnibus Plans together permit the issuance of up to 195,000 shares of the Companys common stock in the form of stock options, restricted stock awards, restricted stock units, performance share awards as well as awards such as stock appreciation rights, performance units, performance shares, bonus shares, and dividend share awards payable in the form of common stock or cash. The number of shares issuable under the Omnibus Plans is subject to customary adjustments in the event of stock splits, stock dividends, and certain other distributions on\nthe Companys common stock. At September 2023, awards with respect to a total of 125,998 shares, net of forfeitures, had been awarded pursuant to the Omnibus Plans and awards with respect to another 69,002 shares may be awarded under the Omnibus Plans.\nRestricted Stock Units\nAt September 2023, the Compensation Committee of the Board of Directors had authorized and approved the following restricted stock unit awards to members of the Companys management team pursuant to the provisions of the Companys Omnibus Plans:\nRestricted\nStock Units (1)\nDate of award:\nOctober 2020\nOriginal number of awards issued:\n20,500\nService period:\n36 months\nEstimated fair value of award at grant date:\n$\n1,415,000\nNon-vested awards outstanding at September 2023:\n6,834\nFair value of non-vested awards at September 2023 of approximately:\n$\n1,408,000\n(1)\n13,666 of the restricted stock units were vested as of September 2023. The remaining 6,834 restricted stock units will vest in October 2023.\nThere is no direct cost to the recipients of the restricted stock units, except for any applicable taxes. The recipients of the restricted stock units are entitled to the customary adjustments in the event of stock splits, stock dividends, and certain other distributions on the Companys common stock. All cash dividends and/or distributions payable to restricted stock recipients will be held in escrow until all the conditions of vesting have been met.\nThe restricted stock units provide that the recipients can elect, at their option, to receive either common stock in the Company, or a cash settlement based upon the closing price of the Companys shares, at the time of vesting. Based on these award provisions, the compensation expense recorded in the Companys Statement of Operations reflects the straight-line amortized fair value based on the liability method under ASC 718 - Compensation - Stock Compensation.\nIncome from operations before income taxes included compensation expense related to the amortization of the Companys restricted stock unit awards of approximately $1.1 million during fiscal 2023 and $2.3 million during fiscal 2022. These amounts were recorded as accrued expenses in the Companys Consolidated Balance Sheets at both September 2023 and September 2022. The tax benefit related to this compensation expense was approximately $0.3 million in fiscal 2023 and $0.6 million in fiscal 2022. The total intrinsic value of restricted stock units vested during fiscal 2023 and fiscal 2022 was approximately $2.4 million and $3.5 million, respectively.\nAt September 2023, there was no unamortized compensation expense for these awards based on the grant date fair value.\nThe following summarizes restricted stock unit activity under the Omnibus Plans during fiscal 2023:\nNumber\nWeighted\nof\nAverage\nShares\nFair Value\nNonvested restricted stock units at September 2022\n18,519\n$\n210.00\nGranted\n-\n-\nVested\n(11,685)\n181.92\nExpired\n-\n-\nNonvested restricted stock units at September 2023\n6,834\n$\n206.00\nRestricted Stock Awards\nAt September 2023, the Compensation Committee of the Board of Directors had authorized and approved the following restricted stock awards to members of the Companys management team pursuant to the provisions of the Companys Omnibus Plans:\nRestricted\nStock Awards (1)\nRestricted\nStock Awards (2)\nDate of award:\nOctober 2021\nOctober 2022\nOriginal number of awards issued:\n15,100\n15,100\nService period:\n36 months\n36 months\nEstimated fair value of award at grant date:\n$\n2,089,000\n2,824,000\nNon-vested awards outstanding at September 2023:\n10,067\n15,100\nFair value of non-vested awards at September 2023 of approximately:\n$\n2,074,000\n3,111,000\n(1)\n5,033 of the restricted stock awards were vested as of September 2023. 5,033 restricted stock awards will vest in October 2023 and 5,034 will vest in October 2024.\n(2)\nThe 15,100 restricted stock awards will vest in equal amounts in October 2023, October 2024 and October 2025.\nThere is no direct cost to the recipients of the restricted stock awards, except for any applicable taxes. The restricted stock awards provide that the recipients receive common stock in the Company, subject to certain restrictions until such time as the awards vest. The recipients of the restricted stock awards are entitled to the customary adjustments in the event of stock splits, stock dividends, and certain other distributions on the Companys common stock. All cash dividends and/or distributions payable to restricted stock recipients will be held in escrow until all the conditions of vesting have been met. The compensation expense recorded in the Companys Statement of Operations reflects the straight-line amortized fair value.\nThe following summarizes restricted stock award activity under the Omnibus Plans during fiscal 2023:\nNumber\nWeighted\nof\nAverage\nShares\nFair Value\nNonvested restricted stock awards at September 2022\n15,100\n$\n210.00\nGranted\n15,100\n187.02\nVested\n(5,033)\n186.26\nExpired\n-\n-\nNonvested restricted stock awards at September 2023\n25,167\n$\n206.00\nIncome from operations before income taxes included compensation expense related to the amortization of the Companys restricted stock awards of approximately $1.6 million during fiscal 2023 and $0.7 million during fiscal 2022. The tax benefit related to this compensation expense was approximately $0.4 million in fiscal 2023 and $0.2 million in fiscal 2022. At September 2023, total unamortized compensation expense related to restricted stock awards was approximately $2.6 million. This unamortized compensation expense is expected to be amortized over approximately the next 16 months.\n13. BUSINESS SEGMENTS:\nThe Company has two reportable business segments: the wholesale distribution of consumer products which includes Team Sledd and Henrys (the Wholesale Segment), and the retail sale of health and natural food products (the Retail Segment). The aggregation of the Companys business operations into these business segments was based on a range of considerations including but not limited to the characteristics of each business, similarities in the nature and type of products sold, customer classes, methods used to sell the products and economic profiles. Included in the Other column are intercompany eliminations, equity method investment earnings, net of tax and assets held and charges incurred and income earned by our holding company. The segments are evaluated on revenues, gross margins, operating income (loss), and income (loss) from operations before taxes. Certain amounts in prior year periods have been reclassified to conform with the current presentation.\nWholesale\nRetail\nSegment\nSegment\nOther\nConsolidated\nFISCAL YEAR ENDED 2023:\nExternal revenue:\nCigarettes\n$\n1,586,303,595\n$\n-\n$\n-\n$\n1,586,303,595\nTobacco\n462,509,541\n-\n-\n462,509,541\nConfectionery\n162,614,409\n-\n-\n162,614,409\nHealth food\n-\n43,119,285\n-\n43,119,285\nFoodservice & other\n285,448,169\n-\n-\n285,448,169\nTotal external revenue\n2,496,875,714\n43,119,285\n-\n2,539,994,999\nDepreciation\n5,856,980\n1,304,488\n-\n7,161,468\nAmortization\n415,178\n-\n-\n415,178\nOperating income (loss)\n39,701,536\n(720,104)\n(13,014,849)\n25,966,583\nInterest expense\n-\n-\n8,550,431\n8,550,431\nIncome (loss) from operations before taxes\n38,653,470\n214,203\n(21,565,280)\n17,302,393\nTotal assets\n345,459,274\n16,985,699\n984,227\n363,429,200\nCapital expenditures\n11,413,999\n1,071,226\n-\n12,485,225\nWholesale\nRetail\nSegment\nSegment\nOther\nConsolidated\nFISCAL YEAR ENDED 2022:\nExternal revenue:\nCigarettes\n$\n1,328,196,494\n$\n-\n$\n-\n$\n1,328,196,494\nTobacco\n342,997,425\n-\n-\n342,997,425\nConfectionery\n117,227,090\n-\n-\n117,227,090\nHealth food\n-\n46,206,417\n-\n46,206,417\nFoodservice & other\n176,170,959\n-\n-\n176,170,959\nTotal external revenue\n1,964,591,968\n46,206,417\n-\n2,010,798,385\nDepreciation\n2,366,108\n1,206,845\n-\n3,572,953\nAmortization\n70,887\n-\n-\n70,887\nOperating income (loss)\n35,597,978\n526,509\n(13,523,120)\n22,601,367\nInterest expense\n-\n-\n2,249,552\n2,249,552\nIncome (loss) from operations before taxes\n34,225,516\n569,797\n(13,319,809)\n21,475,504\nEquity method investment earnings, net of tax\n-\n-\n1,670,133\n1,670,133\nTotal assets\n271,202,838\n17,208,581\n713,108\n289,124,527\nCapital expenditures\n13,327,713\n1,327,493\n-\n14,655,206\n14. TREASURY STOCK:\nThe Company repurchased a total of 2,363 shares of its common stock during fiscal 2023 for cash totaling approximately $0.4 million. The Company did not repurchase any shares of its common stock during fiscal 2022. All repurchased shares were recorded in treasury stock at cost.\n15. SUBSEQUENT EVENT:\nOn October 24, 2023, the Compensation Committee of the Companys Board of Directors awarded 15,100 shares of restricted stock to members of the Companys executive management team, which include a three-year graded vesting schedule. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in company reports filed or submitted under the Securities Exchange Act of 1934 (the Exchange Act) is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions (SEC) rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in company reports filed or submitted under the Exchange Act is accumulated and communicated to management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nAs required by Rules 13a-15(b) and 15d-15(b) under the Exchange Act, an evaluation of the effectiveness of our disclosure controls and procedures as of September 30, 2023 was made under the supervision and with the participation of our senior management, including our principal executive officer and principal financial officer. Based upon that evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this report.\nLimitations on Effectiveness of Controls\nOur management, including our Chief Executive Officer and Chief Financial Officer, do not expect that our disclosure controls and procedures will prevent all errors and fraud. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives. Further, the design of a control system must reflect the fact that there are resource constraints, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by managements override of the control.\nThe design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that: (1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions and the dispositions of our assets; (2) provide reasonable assurance that our transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with appropriate authorizations; and\n(3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, a system of internal control over financial reporting can provide only reasonable assurance and may not prevent or detect all misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Further, because of changes in conditions, effectiveness of internal control over financial reporting may vary over time.\nWe have completed our evaluation and testing of our internal control over financial reporting as required by Section 404 of Sarbanes-Oxley and Item 308(a) of Regulation S-K. Under the supervision and with the participation of our management, we assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, we used the criteria set forth in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO 2013). Based on its assessment, management has concluded that our internal control over financial reporting was effective as of September 30, 2023.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nOther than the ongoing implementation of internal controls over financial reporting related to the acquisition of Henrys Foods, Inc., (Henrys) there were no changes in our internal control over financial reporting that occurred during the fiscal quarter ended September 30, 2023, that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nOn February 3, 2023, the Company completed its acquisition of Henrys. The Company is in the process of evaluating the existing controls and procedures of Henrys and integrating Henrys into the internal control over financial reporting processes of the Company. In accordance with SEC Staff guidance permitting a company to exclude an acquired business from managements assessment of the effectiveness of internal control over financial reporting for the year in which the acquisition is completed, the Company has excluded Henrys from the assessment of the effectiveness of internal control over financial reporting as of September 30, 2023. Henrys accounted for $59.7 million of our consolidated total assets and $220.6 million of our consolidated sales as of and for the fiscal year ended September 30, 2023, respectively. The scope of managements assessment of the effectiveness of the design and operation of the Companys disclosure controls and procedures as of September 30, 2023 includes all of the Companys consolidated operations except for those disclosure controls and procedures of Henrys that are included in internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nExecutive Change in Control Severance Plan\nOn November 6, 2023, the Compensation Committee of the Company's Board of Directors adopted and approved the AMCON Distributing Company Executive Change in Control Severance Plan, effective as of November 6, 2023 (the Severance Plan). The Severance Plan is intended to be a top-hat welfare benefit plan under ERISA. The primary purpose of the Severance Plan is to provide financial protection to certain executives of the Company, including the Companys named executive officers, in the event of their qualifying termination of employment in connection with a change in control of the Company.\nThe Compensation Committee of the Board serves as the administrator (the Administrator) of the Severance Plan and selects those executive officers of the Company who will be eligible to participate in the Severance Plan (the Eligible Executives). The Severance Plan replaces and supersedes any prior severance-related agreements between the Company and any Eligible Executives, including that certain severance letter agreement between the Company and our Chief\nExecutive Officer, dated December 29, 2006. Any benefits received by an Eligible Executive pursuant to the Severance Plan will be in lieu of any general severance policy or other change in control severance plan maintained by the Company.\nEligible Executives are entitled to certain benefits under the Severance Plan if the Eligible Executive experiences a Qualifying CIC Termination as such term is defined under the Severance Plan. A Qualifying CIC Termination is generally defined to be (i) an involuntary termination of an Eligible Executive's Employment with the Company without \"Cause\" and other than as a result of the Eligible Executive's death or \"Disability\" or (ii) a voluntary termination of an Eligible Executive's employment by the Eligible Executive as a result of \"Good Reason,\" in each case, occurring during the term of the plan or for two years following a Change in Control or during the pendency of a Potential Change in Control (as each such capitalized term is defined under the Severance Plan).\nIf an Eligible Executive experiences a Qualifying CIC Termination, the Eligible Executive will, within the five-day period following the Eligible Executives termination date, be paid a cash severance payment in an amount equal to the sum of:\n● two times (in the case of our named executive officers, and one times or one-half times for other Eligible Executives) the Eligible Executives annual base salary as of the Eligible Executives termination date (or, in the event the Eligible Executive has terminated his or her employment with \"Good Reason\" attributable to a material diminution of his or her base salary, the base salary in effect immediately before such reduction)\n● two times (in the case of our named executive officers, and one times or one-half times for other Eligible Executives) the greater of (i) the amount of the bonus the Eligible Executive would have received under the Companys annual bonus plan for the year in which the Eligible Executives termination date occurred, if an at target level of performance was achieved for the plan year and the Eligible Executive had remained employed through the end of the plan year or (ii) the average actual bonus that the Eligible Executive received during the two immediately preceding full annual bonus period cycles;\n● the pro rata portion of the amount of the annual bonus the Eligible Executive would have received under the Companys annual bonus plan for the year in which the Eligible Executives termination date occurred, if an at target level of performance was achieved for the plan year and the Eligible Executive had remained employed through the end of the plan year; and\n● the aggregate COBRA continuation premium cost of 24 months of coverage under the Companys health, vision, and dental plans for the Eligible Executive and his or her dependents, if any, that were enrolled in such plans before the termination.\nIn addition, immediately before the Eligible Executive's termination date, all equity awards held by an Eligible Executive will vest, without regard to any vesting schedule, restriction or performance target, and automatically become fully exercisable, fully vested or fully payable, as the case may be.\nThe Severance Plan does not provide for a gross-up payment to the Eligible Executive in the event that the Eligible Executive is subject to an excise tax under Internal Revenue Code Section 4999(a). The Severance Plan contains provisions for adjustment to the timing of payments to minimize accelerated or additional tax pursuant to Internal Revenue Code Section 409A. Claims for benefits under the Severance Plan are governed by the Severance Plans claims procedure.\nThe Severance Plan became effective on November 6, 2023, and will continue in effect until terminated by the Administrator in accordance with the terms of the plan. The Administrator may amend the Severance Plan from time to time; provided that if such an amendment would materially and adversely affect the rights of certain Eligible Executives, the Company must obtain the Eligible Executives written consent to the amendment for certain specified periods of time. The Administrator also has the authority to construe and interpret the terms of the Severance Plan provided such interpretations are made in good faith and consistent with the terms and conditions of the plan.\nThe foregoing summary of the Severance Plan does not purport to be complete and is qualified in its entirety by reference to the full text of the Severance Plan, a copy of which is filed as an exhibit to this Annual Report on Form 10-K and is incorporated herein by reference.\nIndemnification Agreements\nOn November 6, 2023, the Company's Board of Directors approved a form of indemnification agreement (the Indemnification Agreement) to be entered into with each of the Company's directors and executive officers. The Board also authorized the Company to enter into Indemnification Agreements with future directors and executive officers of the Company that may be designated from time to time by the Board.\nThe Indemnification Agreement supplements and clarifies existing indemnification provisions of the Companys Restated Certificate of Incorporation and Amended and Restated By-laws and, in general, requires the Company, to the extent permitted under applicable law, to indemnify such persons against all expenses, judgments and fines incurred in connection with the defense or settlement of any actions brought against them by reason of the fact that they are or were directors, officers, employees or agents of the Company or any subsidiary of the Company or are or were serving at the request of the Company in certain capacities for any other enterprise. The Indemnification Agreement also establishes processes and procedures for indemnification claims, advancement of expenses and costs and other determinations with respect to indemnification.\nThe foregoing summary of the Indemnification Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the form of Indemnification Agreement, a copy of which is filed as an exhibit to this Annual Report on Form 10-K and is incorporated herein by reference.\nAmended and Restated Bylaws\nOn November 6, 2023, the Company's Board of Directors approved an amendment to Section 2 of Article V (Indemnification) of the Company's Amended and Restated By-laws to reduce the time periods in which an indemnitee may bring suit to enforce the indemnitee's rights under Article V in the event that the Company fails to pay a claim within the time periods specified thereunder.\nThe foregoing summary of the amendment to the Company's Amended and Restated By-laws does not purport to be complete and is qualified in its entirety by reference to the full text of the Company's Amended and Restated By-laws, as amended by the Board of Directors on November 6, 2023, a copy of which (marked to show changes from the prior version) is filed as an exhibit to this Annual Report on Form 10-K and is incorporated herein by reference.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe Registrants Proxy Statement to be used in connection with the January 2024 Annual Meeting of Shareholders (the Proxy Statement) will contain under the captions Item 1: Election of Directors-What is the structure of our board and how often are directors elected?, Item 1: Election of Directors-Who are this years nominees?, Item 1: Election of Directors-What is the business experience of the nominees and of our continuing board members and the basis for the conclusion that each such person should serve on our board?, Delinquent Section 16(a) Reports, Corporate Governance and Board Matters-Code of Ethics, and Corporate Governance and Board Matters-Committees of the Board-Audit Committee, certain information required by Item 10 of Form 10-K and such information is incorporated herein by this reference.\nThe information appearing under the caption Executive Officers of the Registrant in Part I of this report also is incorporated herein by reference. Our Board of Directors has adopted a code of ethical conduct that applies to our executive officers, including our principal executive officer and our principal financial officer. This code of ethical conduct is available without charge to any person who requests it by writing to our corporate secretary. It also is available on our internet website (www.amcon.com) by clicking on the Corporate Governance tab under Investor Relations. Any substantive amendment to, or waiver from, a provision of this code that applies to our principal executive officer or principal financial officer will be disclosed on our internet website and, if required by rules of the SEC or NYSE American, in the reports we file with the SEC. ITEM 11. EXECUTIVE COMPENSATION\nThe Registrants Proxy Statement will contain under the captions Executive Compensation and Related Matters and Corporate Governance and Board Matters-Director Compensation the information required by Item 11 of Form 10-K, and such information is incorporated herein by this reference. Rules of the Securities and Exchange Commission permit the Company to omit the disclosure contemplated by Item 407(e)(4) and (e)(5) relating to Compensation Committee Interlocks and Insider Participation and Compensation Committee Report, respectively, and this annual report does not include such disclosure. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe Registrants Proxy Statement will contain under the captions Ownership of Our Common Stock by Our Directors and Executive Officers and Other Principal Stockholders and Executive Compensation and Related Matters-Equity Compensation Plan Information the information required by Item 12 of Form 10-K and such information is incorporated herein by this reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe Registrants Proxy Statement will contain under the captions Certain Relationships and Related Party Transactions, Item 1: Election of Directors-What is the structure of our board and how often are directors elected? and Corporate Governance and Board Matters-Committees of the Board, the information required by Item 13 of Form 10-K and such information is incorporated herein by this reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe Registrants Proxy Statement will contain under the caption Independent Auditor Fees and Services, the information required by Item 14 of Form 10-K and such information is incorporated herein by this reference.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)\nFinancial Statements, Financial Statement Schedules, and Exhibits\n(1)\nFinancial Statements\nThe financial statements filed as part of this filing are listed on the index to Consolidated Financial Statements under Item 8.\n(2)\nFinancial Statement Schedules\nNot Applicable.\n(3)\nExhibits\n3.1.1\nRestated Certificate of Incorporation of AMCON Distributing Company (incorporated by reference to Exhibit 3.1 of AMCONs Annual Report on Form 10-K filed on November 9, 2020)\n3.1.2\nCertificate of Amendment of the Restated Certificate of Incorporation of AMCON Distributing Company (incorporated by reference to Exhibit 3.1 of AMCONs Current Report on Form 8-K filed on January 20, 2022)\n3.2\nAmended and Restated Bylaws of AMCON Distributing Company dated November 6, 2023\n4.1\nSpecimen Common Stock Certificate (incorporated by reference to Exhibit 4.1 of AMCONs Registration Statement on Form S-1 (Registration No. 33-82848) filed on August 15, 1994)\n4.2\nSecurities Purchase Agreement dated October 8, 2004 between AMCON Distributing Company and Spencer Street Investments, Inc. (incorporated by reference to Exhibit 4.5 of AMCONs Annual Report on Form 10-K filed on January 7, 2005)\n4.3\nDescription of Registrants Securities\n10.1\nSecond Amended and Restated Loan and Security Agreement, date April 18, 2011, between AMCON Distributing Company and Bank of America, as agent (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on April 19, 2011)\n10.2\nConsent and First Amendment to Second Amended and Restated Credit Agreement dated May 27, 2011 (incorporated by reference to Exhibit 10.2 of AMCONs Current Report on Form 8-K filed on May 31, 2011)\n10.3\nSecond Amendment to Second Amended and Restated Loan and Security Agreement, date July 16, 2013, between AMCON Distributing Company and Bank of America, (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2013)\n10.4\nThird Amendment to Second Amended and Restated Loan and Security Agreement, dated November 6, 2017, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.16 of AMCONs Annual Report on Form 10-K filed on November 8, 2017)\n10.5\nFourth Amendment to Second Amended and Restated Loan and Security Agreement, dated March 20, 2020, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.1 of AMCONs Current Report on Form 8-K filed on March 24, 2020)\n10.6\nFifth Amendment to Second Amended and Restated Loan and Security Agreement, dated December 22, 2020, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.2 of AMCONs Quarterly Report on Form 10-Q filed on January 19, 2021)\n10.7\nSixth Amendment to Second Amended and Restated Loan and Security Agreement, dated December 21, 2021, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on January 18, 2022)\n10.8\nSeventh Amendment to Second Amended and Restated Loan and Security Agreement, dated June 30, 2022, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.1 of AMCONs Current Report on Form 8-K filed on July 6, 2022)\n10.9\nEighth Amendment to Second Amended and Restated Loan and Security Agreement, dated February 2, 2023, between AMCON Distributing Company and Bank of America (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on April 18, 2023)\n10.10\nLIBOR Transition Amendment, dated June 30, 2022 (incorporated by reference to Exhibit 10.2 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2022)\n10.11\nCredit Agreement dated March 27, 2020 between Team Sledd, LLC and First National Bank of Pennsylvania, as agent (incorporated by reference to Exhibit 10.3 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2022)\n10.12\nFirst Amendment to Credit Agreement dated April 9, 2021 between Team Sledd, LLC and First National Bank of Pennsylvania (incorporated by reference to Exhibit 10.4 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2022)\n10.13\nSecond Amendment to Credit Agreement dated October 4, 2021 between Team Sledd, LLC and First National Bank of Pennsylvania (incorporated by reference to Exhibit 10.5 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2022)\n10.14\nThird Amendment to Credit Agreement dated October 3, 2022 between Team Sledd, LLC and First National Bank of Pennsylvania (incorporated by reference to Exhibit 10.13 of AMCONs Annual Report on Form 10-K filed on November 23, 2022)\n10.15\nFourth Amendment to Credit Agreement dated April 27, 2023 between Team Sledd, LLC and First National Bank of Pennsylvania (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on July 18, 2023)\n10.16\nAsset Purchase Agreement dated December 7, 2022 (incorporated by reference to Exhibit 10.1 of AMCONs Quarterly Report on Form 10-Q filed on January 18, 2023)\n10.17\nLoan and Security Agreement, dated February 3, 2023 between LOL Foods, Inc., HF Real Estate LLC and BMO Harris Bank N.A. (incorporated by reference to Exhibit 10.2 of AMCONs Quarterly Report on Form 10-Q filed on April 18, 2023)\n10.18\nMaster Loan and Security Agreement, dated February 1, 2023 between LOL Foods, Inc. and Banc of America Leasing & Capital, LLC (incorporated by reference to Exhibit 10.3 of AMCONs Quarterly Report on Form 10-Q filed on April 18, 2023)\n10.19\nAMCON Distributing Company Profit Sharing Plan (incorporated by reference to Exhibit 10.8 of Amendment No. 1 to the Companys Registration Statement on Form S-1 (Registration No. 33-82848) filed on November 8, 1994)*\n10.20\n2014 Omnibus Incentive Plan (incorporated herein by reference to Exhibit 10.1 to AMCONs Current Report on Form 8-K filed on December 22, 2014)*\n10.21\nForm of Restricted Stock Unit Award Agreement under the 2014 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.2 to AMCONs Current Report on Form 8-K filed on December 22, 2014)*\n10.22\nForm of Restricted Stock Award Agreement under the 2014 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.2 to AMCONs Quarterly Report on Form 10-Q filed on January 18, 2022)*\n10.23\n2018 Omnibus Incentive Plan (incorporated herein by reference to Exhibit 10.1 to AMCONs Quarterly Report on Form 10-Q filed on January 18, 2019)*\n10.24\nForm of Restricted Stock Unit Award Agreement under the 2018 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.2 to AMCONs Quarterly Report on Form 10-Q filed on January 18, 2019)*\n10.25\nForm of Stock Option Award Agreement under the 2018 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.3 of AMCONs Quarterly Report on Form 10-Q filed on January 18, 2019)*\n10.26\nForm of Restricted Stock Award Agreement under the 2018 Omnibus Incentive Plan (incorporated by reference to Exhibit 10.3 to AMCONs Quarterly Report on Form 10-Q filed on January 18, 2022)*\n10.27\n2022 Omnibus Incentive Plan (incorporated herein by reference to Exhibit 10.1 of AMCONs Current Report on Form 8-K filed on January 20, 2022)*\n10.28\nForm of Restricted Stock Award Agreement under the 2022 Omnibus Incentive Plan*\n10.29\nAMCON Distributing Company Executive Change in Control Severance Plan dated November 6, 2023*\n10.30\nForm of Indemnification Agreement dated November 6, 2023*\n21.1\nSubsidiaries of the Company\n31.1\nCertification by Christopher H. Atayan, Chief Executive Officer and Chairman, pursuant to section 302 of the Sarbanes-Oxley Act\n31.2\nCertification by Charles J. Schmaderer, Vice President, Chief Financial Officer and Secretary, pursuant to section 302 of the Sarbanes-Oxley Act\n32.1\nCertification by Christopher H. Atayan, Chief Executive Officer and Chairman, furnished pursuant to section 906 of the Sarbanes-Oxley Act\n32.2\nCertification by Charles J. Schmaderer, Vice President, Chief Financial Officer and Secretary, furnished pursuant to section 906 of the Sarbanes-Oxley Act\n97.1\nPolicy Relating to Recovery of Erroneously Awarded Compensation\nInline XBRL Interactive Data File (filed herewith electronically).\nCover Page Interactive Data File - formatted in Inline XBRL and included as Exhibit 101\n* Represents management contract or compensation plan or arrangement.\nITEM 16. FORM 10-K SUMMARY\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNovember 8, 2023\nAMCON DISTRIBUTING COMPANY\n(registrant)\nBy:\n/s/ Christopher H. Atayan\nChristopher H. Atayan\nChief Executive Officer and Chairman\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNovember 8, 2023\n/s/ Christopher H. Atayan\nChristopher H. Atayan\nChief Executive Officer\nChairman of the Board and Director\n(Principal Executive Officer)\nNovember 8, 2023\n/s/ Charles J. Schmaderer\nCharles J. Schmaderer\nVice President, Chief Financial Officer and Secretary\n(Principal Financial and Accounting Officer)\nNovember 8, 2023\n/s/ Andrew C. Plummer\nAndrew C. Plummer\nPresident, Chief Operating Officer and Director\nNovember 8, 2023\n/s/ Jeremy W. Hobbs\nJeremy W. Hobbs\nDirector\nNovember 8, 2023\n/s/ John R. Loyack\nJohn R. Loyack\nDirector\nNovember 8, 2023\n/s/ Stanley Mayer\nStanley Mayer\nDirector\nNovember 8, 2023\n/s/ Timothy R. Pestotnik\nTimothy R. Pestotnik\nDirector\n(This page has been left blank intentionally.)"
}