{
    "cik": "934796",
    "company": "NETWORK CN INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-23",
    "period_of_report": "2021-12-31",
    "sic": "7310",
    "state_of_inc": "DE",
    "state_location": "K3",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/934796/0001214659-22-015300-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/934796/000121465922015300/n102622010k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/934796/0001214659-22-015300.txt",
    "filename": "934796_10K_2021_0001214659-22-015300.htm",
    "content": "ITEM 1. BUSINESS\nOverview of Our Business\nOur mission is to become a nationwide leader in providing out-of-home advertising in China, primarily serving the needs of branded corporate customers. Our business direction to not just selling air-time for its media panels but also started working closely with property developers in media planning for the property at the very early stage. As a media planner we share the advertising profits with the property developers without paying significant rights fees, so we expect to achieve a positive return from these projects.\nHistory\nWe were incorporated under the laws of the State of Delaware on September 10, 1993, under the name EC Capital Limited. Our predecessor companies were involved in a variety of businesses and were operated by various management teams under different operating names. Between 2004 and 2006 we operated under the name Teda Travel Group Inc., which was primarily engaged in the provision of management services to hotels and resorts in China. On August 1, 2006, we changed our name to Network CN Inc. in order to better reflect our new vision to build a nationwide information and entertainment network in China.\nRecent Developments\nIssuance of Convertible Promissory Note\nOn January 18, 2022, the Company entered into a Subscription Agreement under which the Subscriber agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of $2,500,000. On the same date, the Company signed the 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the Subscriber up to an aggregate maximum amount of $2,500,000 in principal amount of Convertible Notes prior to January 19, 2027. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.25 per share.\nExercise of conversion option\nOn October 28, 2021, Keywin Holdings Limited (Keywin) exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000.\nPrivate Placement\nOn May 3, 2021, the Company entered into Common Stock Agreement with the foreign investor (the \"New investor\") that the Company will sell an aggregate of 200,000 shares of the Company's common stock to the New investor. Pursuant to the terms of a Common Stock Agreement between the Company and the New investor, the purchase price paid by the New investor for the shares were $3 per share for an aggregate sum of $600,000.\nIncrease of authorized capital\nOn April 28, 2020, the Board of Directors and Majority of stockholders of the Company approved to increase the total number of authorized shares of Common Stock from 26,666,667 to 100,000,000,000. On October 11, 2021, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to increase our authorized shares of common stock from 26,666,667 to 100,000,000,000 and the increase had approved by Delaware secretary of state on April 5, 2022.\nCorporate Structure\nThe following chart reflects our organization structure as of the date of this annual report:\nAvailable Information\nWe file with the SEC our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to reports to be filed pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended. The public may read and copy any materials we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549, on official business days during the hours of 10 a.m. to 3 p.m. The public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\nOur corporate headquarters are located at Unit 705B, 7th FL, New East Ocean Centre, 9 Science Museum Road, TST, KLN, Hong Kong, Special Administrative Region of the Peoples Republic of China. Our telephone number is + (852) 9625-0097. We maintain a website at www.ncnmedia.com that links to our electronic SEC filings and contains information about our subsidiaries which is not a part of this report. All the above documents are available free of charge on our website as soon as reasonably practicable after filing such material electronically or otherwise furnishing it to the SEC.\nOur Services\nDuring the fiscal years ended December 31, 2021 and 2020, we did not provide any services.\nOur Suppliers\nIn some of our past media projects, we are responsible for installing advertising panels and billboards. We design the shape of our advertising panels and billboards according to the terms approved in the relevant PRC governmental documents. We identify suppliers of component parts used in our advertising panels and contract assembly of our advertising panels to third-party contract assemblers who assemble our advertising panels according to our specification. We select component suppliers based on price and quality. During the fiscal years ended December 31, 2021 and 2020, we did not install any advertising panels and billboards and no rights contracts were signed in 2021 and 2020.\nOur Customers\nOur past customers include large international and domestic brand name customers. During the fiscal years ended December 31, 2021 and 2020, we did not have customers.\nSales and Marketing\nNo sales and marketing expense has been incurred for the fiscal years 2021 and 2020.\nOur Intellectual Property\nAs of December 22, 2022, we do not have any registered trademarks, copyrights, licenses or patent rights.\nOur Research and Development\nNo material costs have been incurred on research and development activities for the fiscal years 2021 and 2020. We do not expect to incur significant research and development costs in the coming future.\nEmployees\nAs of December 31, 2021, the Company and its subsidiaries and variable interest entities had two employees at our office located at Hong Kong, all of which are full-time employees.\nOur employees are not represented by a labor organization or covered by a collective bargaining agreement. We believe that we maintain a satisfactory working relationship with our employees and we have not experienced any significant labor disputes or work stoppage or any difficulty in recruiting staff for our operations.\nWe are required under PRC law to make contributions to employee benefit plans at specified percentages of the after-tax profit. In addition, we are required by the PRC law to cover our employees in China with various type of social insurance. We believe that we are in material compliance with the relevant PRC laws.\nGovernment Regulation\nAdvertising Services\nBusiness Licenses for Advertising Companies\nThe principal regulations governing the advertising businesses in China include:\nl The Advertising Law (1994);\nl Regulations on Control of Advertisement (1987); and\nl The Implementing Rules for the Advertising Administrative Regulations (2004).\nThese regulations stipulate that companies that engage in advertising activities must obtain from the SAIC or its local branches a business license which specifically includes operating an advertising business within its business scope. Companies conducting advertising activities without such a license may be subject to penalties, including fines, confiscation of advertising income and orders to cease advertising operations. The business license of an advertising company is valid for the duration of its existence, unless the license is suspended or revoked due to a violation of any relevant law or regulation.\nWe do not expect to encounter any difficulties in maintaining our business licenses. Our PRC advertising operating companies hold business license from the local branches of the SAIC as required by the existing PRC regulations.\nAdvertising Content\nPRC advertising laws and regulations set forth certain content requirements for advertisements in China, which include prohibitions on, among other things, misleading content, superlative wording, socially destabilizing content or content involving obscenities, superstition, violence, discrimination or infringement of the public interest. Advertisements for anesthetic, psychotropic, toxic or radioactive drugs are prohibited. It is prohibited to disseminate tobacco advertisements via broadcast or print media. It is also prohibited to display tobacco advertisements in any waiting lounge, theater, cinema, conference hall, stadium or other public area. There are also specific restrictions and requirements regarding advertisements that relate to matters such as patented products or processes, pharmaceuticals, medical instruments, veterinary pharmaceuticals, agrochemicals, foodstuffs, alcohol and cosmetics. In addition, all advertisements relating to pharmaceuticals, medical instruments, agrochemicals and veterinary pharmaceuticals advertised through radio, film, television, newspaper, magazine and other forms of media, together with any other advertisements which are subject to censorship by administrative authorities according to relevant laws and administrative regulations, must be submitted to the relevant administrative authorities for content approval prior to dissemination.\nAdvertisers, advertising operators and advertising distributors are required by PRC advertising laws and regulations to ensure that the content of the advertisements they prepare or distribute are true and in full compliance with applicable laws. In providing advertising services, advertising operators and advertising distributors must review the prescribed supporting documents provided by advertisers for advertisements and verify that the content of the advertisements comply with applicable PRC laws and regulations. In addition, prior to distributing advertisements for certain commodities, which are subject to government censorship and approval, advertising distributors and advertisers are obligated to ensure that such censorship has been performed and approval has been obtained. Violation of these regulations may result in penalties, including fines, confiscation of advertising income, orders to cease dissemination of the advertisements and orders to publish an advertisement correcting the misleading information. In circumstances involving serious violations, the SAIC or its local branches may revoke violators licenses or permits for advertising business operations. Furthermore, advertisers, advertising operators or advertising distributors may be subject to civil liability if they infringe on the legal rights and interests of third parties in the course of their advertising business. We have implemented procedures to ensure the content of our advertisement are properly reviewed and the advertisement would only be published upon the receipt of content approval from the relevant administrative authorities. However, we provide no assurance that all the content of the advertisement are true and in full compliance with applicable laws.\nOut-of-home Advertising\nThe Advertising Law stipulates that the exhibition and display of out-of-home advertisements must not:\nl utilize traffic safety facilities and traffic signs;\nl impede the use of public facilities, traffic safety facilities and traffic signs;\nl obstruct commercial and public activities or create an eyesore in urban areas;\nl be placed in restrictive areas near government offices, cultural landmarks or historical or scenic sites; and\nl be placed in areas prohibited by the local governments from having out-of-home advertisements.\nIn addition to the Advertising Law, the SAIC promulgated the Out-of-home Advertising Registration Administrative Regulations on December 8, 1995, as amended on December 3, 1998, and May 22, 2006, which governs the out-of-home advertising industry in China.\nOut-of-home advertisements in China must be registered with the local SAIC before dissemination. The advertising distributors are required to submit a registration application form and other supporting documents for registration. After review and examination, if an application complies with the requirements, the local SAIC will issue an Out-of-home Advertising Registration Certificate for such advertisement. Many municipal cities of China have respectively promulgated their own local regulations on the administration of out-of-home advertisements. Those municipal regulations set forth specific requirements on the out-of-home advertisements, such as the allowed places of dissemination and size requirements of the out-of-home advertisement facilities.\nIn addition to the regulations on out-of-home advertisements, the placement and installation of LED billboards are also subject to municipal local zoning requirements and relevant governmental approvals of the city where the LED billboards located. In Shanghai, prior to the placement and installation of LED billboards, installers are required to apply for an out-of-home advertising registration certificate for each LED billboard subject to a term of use approved by local government agency for each LED billboard. If the existing LED billboards placed by our LED location provider or us are required to be removed, the attractiveness of this portion of our advertising network will be diminished.\nForeign Currency Exchange\nThe principal regulation governing foreign currency exchange in China is the Rules on Foreign Exchange Control (1996), as amended. Under these rules, Renminbi is freely convertible for trade and service-related foreign exchange transactions, but not for direct investment, loan or investment outside China without the prior approval of the State Administration for Foreign Exchange of the PRC or other relevant authorities is obtained.\nPursuant to the Rules on Foreign Exchange Control, foreign investment enterprises in China may purchase foreign currency without the approval of the State Administration for Foreign Exchange of the PRC for trade and service-related foreign exchange transactions by providing commercial documents evidencing these transactions. They may also exchange Renminbi into foreign currencies (subject to a cap approved by the State Administration for Foreign Exchange of the PRC) to satisfy foreign exchange liabilities or to pay dividends. However, the relevant PRC government authorities may limit or eliminate the ability of foreign investment enterprises to purchase and retain foreign currencies in the future. In addition, foreign exchange transactions for direct investment, loan and investment outside China are still subject to limitations and require approvals from the State Administration for Foreign Exchange of the PRC.\nDividend Distributions\nThe principal regulations governing distribution of dividends of wholly foreign-owned companies include:\nl the Foreign Investment Enterprise Law (1986), as amended; and\nl Administrative Rules under the Foreign Investment Enterprise Law (2001).\nUnder these regulations, foreign investment enterprises in China may pay dividends only out of their accumulated profits, if any, determined in accordance with PRC accounting standards and regulations. In addition, wholly foreign-owned enterprises in China are required to set aside at least 10% of their after-tax profits each year, if any, to fund certain reserve funds, until such reserve funds have reached 50% of the enterprises registered capital. These reserves are restricted and not distributable as cash dividends.\nWe have not received any dividends or fees from our PRC subsidiaries or affiliated Chinese entities in the past three years. As all our PRC subsidiaries are currently still operating at a net loss, we are unable to estimate the time to receive dividends or other fees.\nEnterprise Income Tax Law\nThe Enterprise Income Tax Law, or EIT Law, was promulgated by the PRCs National Peoples Congress on March 16, 2007 to introduce a new uniform taxation regime in the PRC. Both resident and non-resident enterprises deriving income from the PRC were subject to the EIT Law from January 1, 2008. It applies a single income tax rate to all enterprises in the PRC. Under this EIT Law, enterprises that qualify as new and high technology enterprises (high-tech companies) are entitled to a preferential tax rate of 15% and in other very limited situation entities may be subject to a EIT rate of 20%, but the general EIT rate is 25%.\nWe believe that each of our PRC operating entities were resident enterprises and subject to the enterprise income tax rate of 25% for their global income. We do not believe that any of our off-shore entities are resident enterprises as our off-shore entities didnt provide any services in the PRC and their management and controls are all located outside China; permanent establishment does not exist and hence they would not fall into the resident enterprise category. However, we cannot provide assurance that all our offshore operating entities are not resident enterprises as there are substantial uncertainties regarding the interpretation and implementation of current PRC tax rule and regulation.\nEnvironmental Matters\nThe Company's operations are subject to various environmental regulations. We believe that we are in substantial compliance with applicable laws, rules and regulations relating to the protection of the environment and that our compliance will have no material effect on our capital expenditures, earnings or competitive position. ITEM 1A. RISK FACTORS\nSmaller reporting companies are not required to provide the information required by this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe maintain our head office in Hong Kong at Unit 705B, 7th FL, New East Ocean Centre, 9 Science Museum Road, TST, KLN, Hong Kong.\nWe believe that all our properties have been adequately maintained, are generally in good condition, and are suitable and adequate for our business. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these, or other matters, may arise from time to time that may harm our business. We are not a party to or otherwise involved in any pending legal proceedings. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Our Common Stock\nSince August 1, 2006, our common stock has been quoted on the Over-the-Counter Bulletin Board, or OTCBB, maintained by the Financial Industry Regulatory Authority (FINRA), under the symbol NWCN. From February 2011 to February 2012, our common stock, along with the securities of over 600 other issuers, was transferred from the OTCQB automated quotation system to the OTC Pink, which is part of the OTC Market Group's quotation system, due to the quotation inactivity by our market makers. On January 21,2022, the Company announced that had has received approval from OTC Markets Group for its securities to be designated as trading on the OTCQB Venture Market Exchange as of January 21 ,2022, under the OTCQB ticker symbol OTCQB: NWCN.\nOn September 16, 2011, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to effect a 1-for-5 reverse stock split of our outstanding common stock and a reduction of our authorized shares of common stock from 2,000,000,000 to 400,000,000. The CUSIP number for our common stock has been changed to 64125G209 accordingly. On September 21, 2011, FINRA approved the reverse split of our common stock and it commenced trading on a post-split basis on September 22, 2011.\nOn August 11, 2015, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to effect a 1-for-15 reverse stock split of our outstanding common stock and a reduction of our authorized shares of common stock from 400,000,000 to 26,666,667. The new CUSIP number for the Companys common stock is 64125G 308 accordingly. On August 10, 2015, the Financial Industry Regulatory Authority (FINRA) approved the reverse split and it commenced trading on a post-split basis on August 11, 2015.\nOn April 28, 2020, the Board of Directors and Majority of stockholders of the Company approved to increase the total number of authorized shares of Common Stock from 26,666,667 to 100,000,000,000. On October 11, 2021, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to increase our authorized shares of common stock from 26,666,667 to 100,000,000,000 and the increase had approved by Delaware secretary of state on April 5, 2022.\nThe following table sets forth, for the periods indicated, the high and low closing prices of our common stock. These prices reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not represent actual transactions.\nClosing Prices (1)\nHigh Low\nFISCAL YEAR ENDED DECEMBER 31, 2021:\nFourth Quarter $ 2.60 $ 1.58\nThird Quarter $ 3.30 $ 0.20\nSecond Quarter $ 0.75 $ 0.15\nFirst Quarter $ 1.72 $ 0.68\nFISCAL YEAR ENDED DECEMBER 31, 2020:\nFourth Quarter $ 1.95 $ 0.70\nThird Quarter $ 1.90 $ 0.23\nSecond Quarter $ 1.70 $ 1.10\nFirst Quarter $ 1.10 $ 0.57\n(1) The above tables set forth the range of high and low closing prices per share of our common stock as reported by www.otcmarket.com for the periods indicated.\nApproximate Number of Holders of Our Common Stock\nAs of December 22, 2022, the Company had approximately 199 stockholders of record and 20,749,018 shares of common stock were issued and outstanding. Because some of our common stock is held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders.\nIn December 2012, we changed our registrar and transfer agent for our common stock from Globex Transfer, LLC. to Pacific Stock Transfer Company. Their address is 6725 Via Austi Pkwy, Suite 300 Las Vegas, NV, USA and their telephone number and facsimile are +1 (702) 361-3033 and +1 (702) 433-1979, respectively.\nDividend Policy\nThe Company has not declared any dividends since incorporation and does not anticipate doing so in the foreseeable future. We currently intend to retain most, if not all, of our available funds and any future earnings to operate and expand our business.\nOur subsidiaries in the PRC may pay dividends to us through our Hong Kong subsidiaries, Crown Eagle Investment Limited and NCN Group (Global) Limited. Current PRC regulations only allow our subsidiaries to pay dividends to us out of their accumulated profits, if any, determined in accordance with Chinese accounting standards and regulations. Also in accordance with its articles of association, each of our subsidiaries in the PRC is required to allocate to its enterprise development reserve at least 10% of its respective after-tax profits determined in accordance with the PRC accounting standards and regulations. Each of our subsidiaries in the PRC may stop allocations to its general reserve if such reserve has reached 50% of its registered capital. Allocations to the reserve can only be used for making up losses and other specified purposes and may not be paid to us in forms of loans, advances, or cash dividends. Dividends paid by our PRC subsidiaries to Crown Eagle Investment Limited and NCN Group (Global) Limited, our Hong Kong subsidiaries, will not be subject to Hong Kong capital gains or other income tax under current Hong Kong laws and regulations because they will not be deemed to be assessable income derived from or arising in Hong Kong.\nWe have not received any dividends or any other fees, including consulting fees, from our PRC subsidiaries or our affiliated Chinese entities in the past three years as all of our PRC operating companies, including our PRC subsidiaries and variable interest entities, are currently operating at an accumulated deficit and the above dividend restriction prevent us from receiving any dividends in the short term until they turn into accumulated profit. As such, we could only receive funds from them through the repayment of intercompany loans by our PRC subsidiaries or charging them service fees through the provision of management services. If our PRC operating entities continue to operate at a net loss, we will need to raise funds through the issuance of equity and debt securities to satisfy future payment requirements, and there is no assurance that we will be successful in raising such funds.\nOur board of directors has discretion on whether to pay dividends unless the distribution would render us unable to repay our debts as they become due. Even if our board of directors decides to pay dividends, the form, frequency and amount will depend upon our future operations and earnings, capital requirements and surplus, general financial condition, contractual restrictions and other factors that the board of directors may deem relevant. For instance, the terms of the outstanding promissory notes issued on January 14, 2020 contain restrictions on the payment of dividends. The dividend restrictions provide that the Company or any of its subsidiaries shall not declare or pay dividends or other distributions in respect of the equity securities of such entity other than dividends or distributions of cash which amounts during any 12-month period that exceed ten percent (10%) of the consolidated net income of the Company based on the Companys most recent audited financial statements disclosed in the Companys annual report on Form 10-K (or equivalent form) filed with the U.S. Securities and Exchange Commission.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nSee Item 12 - Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters, Securities Authorized for Issuance Under Equity Compensation Plans.\nRecent Sales of Unregistered Securities\nDuring the past two years, we did not offer or sell any unregistered securities that were not previously disclosed in a quarterly report on Form 10-Q or in a current report on Form 8-K.\nPurchases of Our Equity Securities\nNo repurchases of our common stock were made during our fiscal year ended December 31, 2021. ITEM 6. SELECTED FINANCIAL DATA\nSmaller reporting companies are not required to provide the information required by this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following managements discussion and analysis should be read in conjunction with our consolidated financial statements and the notes thereto and the other financial information appearing elsewhere in this annual report. In addition to historical information, the following discussion contains certain forward-looking information. See Special Note Regarding Forward-Looking Statements above for certain information concerning those forward looking statements. Our consolidated financial statements are prepared in U.S. dollars and in accordance with U.S. GAAP. References in this Report to a particular fiscal year are to our fiscal year ended on December 31.\nOverview of Our Business\nOur mission is to become a nationwide leader in providing out-of-home advertising in China, primarily serving the needs of branded corporate customers. Our business direction to not just selling air-time for its media panels but also started working closely with property developers in media planning for the property at the very early stage. As a media planner we share the advertising profits with the property developers without paying significant rights fees, so we expect to achieve a positive return from these projects.\nThere was no advertising revenue for the years ended December 31, 2021 and 2020. Our net (loss) profit was ($1,215,636) and $4,869,156 for the years ended December 31, 2021 and 2020 respectively. The Company will continually explore new media projects in order to provide a wider range of media and advertising services, rather than focusing primarily on LED media.\nCOVID-19 Pandemic\nIn December 2019, an outbreak of COVID-19 was identified in China and was subsequently recognized as a global pandemic by the World Health Organization (WHO) on March 11, 2020. Since that time, COVID-19 has spread around the world and throughout the United States, including in the regions and countries in which we operate. Federal, state and local governments in the U.S and around the world have imposed restrictions on travel and business operations and are advising or requiring individuals to limit or eliminate time outside of their homes. Temporary closures of businesses have also been ordered in certain jurisdictions, and other businesses have temporarily closed voluntarily. These actions expanded significantly in March and April of 2020 throughout the U.S. Consequently, the COVID-19 outbreak has severely restricted the level of economic activity in the U.S. and around the world.\nThe outbreak has resulted in authorities implementing numerous measures to try to contain the virus, such as quarantines and shelter in place orders. These measures may remain in place for a significant period of time and adversely affect our business, operations and financial condition as well as the business, operations and financial conditions of our business partners. The spread of the virus has also caused us to modify our business practices (including employee work locations and cancellation of physical participation in meetings) in ways that may be detrimental to our business (including working remotely and its attendant cybersecurity risks). We may take further actions as may be required by government authorities or that we determine are in the best interests of our employees. There is no certainty that such measures will be sufficient to mitigate the risks posed by the virus or otherwise be satisfactory to government authorities.\nThere has been no material adverse impact on the Companys 2021 results of operations to date. The effect of COVID-19 and related events, those not yet known or knowable, could have a negative effect on the stock price, business prospects, financial condition, and results of operations of the Company, including as a result of quarantines, market volatility, market downturns and business closures.\nFor the reasons discussed above, the Company cannot reasonably estimate with any degree of certainty the future impact COVID-19 may have on the Companys results of operations, financial position, and liquidity. Notwithstanding any actions by national, state, and local governments to mitigate the impact of COVID-19 or by the Company to address the adverse impacts of COVID-19, there can be no assurance that any of the foregoing activities will be successful in mitigating or preventing significant adverse effects on the Company.\nRecent Developments\nIssuance of Convertible Promissory Note\nOn January 18, 2022, the Company entered into a Subscription Agreement under which the Subscriber agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of $2,500,000. On the same date, the Company signed the 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the Subscriber up to an aggregate maximum amount of $2,500,000 in principal amount of Convertible Notes prior to January 19, 2027. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.25 per share.\nExercise of conversion option\nOn October 28, 2021, Keywin Holdings Limited (Keywin) exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000.\nPrivate Placement\nOn May 3, 2021, the Company entered into Common Stock Agreement with the New investor that the Company will sell an aggregate of 200,000 shares of the Company's common stock to the New investor. Pursuant to the terms of a Common Stock Agreement between the Company and the New investor, the purchase price paid by the New investor for the shares were $3 per share for an aggregate sum of $600,000.\nIncrease of authorized capital\nOn April 28, 2020, the Board of Directors and Majority of stockholders of the Company approved to increase the total number of authorized shares of Common Stock from 26,666,667 to 100,000,000,000. On October 11, 2021, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to increase our authorized shares of common stock from 26,666,667 to 100,000,000,000 and the increase had approved by Delaware secretary of state on April 5, 2022.\nIdentification of New projects\nOn January 14, 2020, the Company entered into a Letter of Intent with Earthasia Worldwide Holdings Limited (EWHL) that the Company will acquire 100% of the EWHLs issued and outstanding stock owned by the shareholders of the EWHL and the EWHL will become a wholly owned subsidiary of the Company.\nOn July 23, 2020, the Company entered into Share Exchange Agreement with Ease Global Limited (Ease Global), the shareholder of Trade More Global Limited (‘Trade More) that the Company will purchase, One Thousand and One Hundred (1,100) currently issued shares of common stock of Trade More from Ease Global and in exchange for Forty-nine Million (49,000,000) shares of newly-issued shares of common stock of the Company. The closing of the Exchange shall occur on other date as agreed by the parties of the Share Exchange Agreement. Upon completion of the Exchange, 78% of issued shares of common stock of the Company shall be held by the Ease Global while all of the shares of capital stock of Trade More shall be held by the Company. EWHL is a wholly owned subsidiary of Trade More.\nThe closing of Exchange was not completed on September 2, 2020 and was postponed due to the progress of audit. Due to the delay of completion, the Company will re-evaluate the acquisition until Ease Global can fulfill the revenue target and the internal controls over financial reporting required by the SEC. The Company will proceed to negotiate and seek approval from the board of directors and shareholders for the new share exchange terms and conditions.\nResults of Operations\nComparison of Years Ended December 31, 2021 and 2020.\nGeneral and Administrative Expenses. General and administrative expenses primarily consist of compensation related expenses (including salaries paid to executive and employees, rental expenses, depreciation, fees for professional services, travel expenses and miscellaneous office expenses. General and administrative expenses for the year ended December 31, 2021 increased by 63.77% to $479,018, compared to $292,490 for the year ended December 31, 2020. The increase in general and administrative expenses was mainly due to increase of consultancy fee for exercise of conversion option and escrow agent fee for private placement.\nStock Based Compensation for services - Stock Based Compensation for services for the year ended December 31, 2021 was $217,475, compared to $nil for the year ended December 31, 2020. The increase was mainly due to increase in stock based compensation for directors service and escrow agent fee for private placement.\nGain on Extinguishment of Debt - Gain on extinguishment of debt for the year ended December 31, 2020 was $5,299,726, compared to $nil for the year ended December 31, 2021. The gain was due to the abandonment of convertible note from the noteholders in December 2020.\nGain from Write-off of Long Aged Payables - Gain from write-off of long-aged payables for the year ended December 31, 2021 was $708, compared to $394,522 for the year ended December 31, 2020. We believe the obligation for future settlement for such long-aged payables is remote and therefore wrote them off.\nInterest and Other Debt-Related Expenses. Interest and other debt-related expenses for the year ended December 31, 2021 decreased to $519,851 or by 2.39%, compared to $532,603 for the year ended December 31, 2020.\nIncome Taxes. The Company derives all of its income in the PRC and is subject to income tax in the PRC. No income tax was recorded for the years ended December 31, 2021 and 2020 as the Company and all of its subsidiaries and variable interest entities operated at a tax loss in fiscal 2021 and 2020.\nNet (Loss) Profit. The Company incurred a net loss of $1,215,636 for the year ended December 31, 2021 and net profit of $$4,869,156 for the year ended December 31, 2020, a decrease of 124.97%. The decrease in net profit was primarily due to no gain on extinguishment of debt for the year ended December 31, 2021.\nLiquidity and Capital Resources\nCash Flows\nAs of December 31, 2021, current assets were $47,612 and current liabilities were $5,615,352. Cash as of December 31, 2021 was $27,784 compared to $5,967 as of December 31, 2020, an increase of $21,817. The increase was due to increase funds from private placement and exercise of conversion option during the year ended December 31, 2021.\nThe following table sets forth a summary of our cash flows for the periods indicated:\nYears ended December 31,\nNet cash used in operating activities $ (441,146 ) $ (665,693 )\nNet cash used in investing activities (2,422 ) (617 )\nNet cash provided by financing activities 459,077 666,446\nEffect of exchange rate changes on cash\nNet increase in cash 15,710\nCash at the beginning of year 5,967 5,510\nCash at the end of year $ 21,677 $ 5,967\nOperating Activities\nNet cash used in operating activities for the year ended December 31, 2021 was $441,146, as compared with $665,693 for the year ended December 31, 2020, reduction of $224,547. The decrease in net cash used in operating activities was mainly attributable the increase payment to administrative service providers and utilization of prior years prepayment.\nInvesting Activities\nNet cash used in investing activities for the years ended December 31, 2021 and 2020 was $2,422 and $617, respectively, for the purchases of computer.\nFinancing Activities\nNet cash provided by financing activities was $459,077 for the year ended December 31, 2021, as compared with $666,446 for the year ended December 31, 2020. The increase was mainly due to increase in proceeds from private placement financing our operations for the year ended December 31, 2021.\nShort-term Loans\nAs of December 31, 2021 and 2020, the Company recorded an aggregated amount of $2,973,211 of short-term loans. Those loans were borrowed from a shareholder and an unrelated individual. Except for loan of $128,205 from an unrelated individual that are unsecured, bearing yearly interest of 1% and are repayable on demand, the remaining loans are unsecured, bear a monthly interest of 1.5% and are repayable on demand. However, according to the agreement, the Company shall have the option to shorten or extend the life of those short-term loans if the need arises and the Company has agreed with the lender to extend the short-term loans on the due date. On January 18, 2022, the Company issued convertible notes of US$2,500,000 which is for setting off against the short-term loans and interest payable. As of the date of this report, the balance of $968,211have not yet been repaid.\nCapital Expenditures\nThe Company acquired of assets $2,422 and $617 during the year ended December 31, 2021 and 2020 respectively.\nContractual Obligations and Commercial Commitments\nThe following table presents certain payments due under contractual obligations with minimum firm commitments as of December 31, 2021:\nPayments due by period\nTotal Due in\nDue in\n2023 -\nDue in\n2025-2026\nThereafter\nDebt Obligations (a) $ 645,000 $ - $ - $ 645,000 $ -\nShort Term Loan (b) 2,973,211 2,973,211 - - -\n(a) Debt Obligations. In 2020, we issued a new 1% Senior Unsecured Convertible Note which matured on January 13, 2025. For details, please refer to the Note 8 of the consolidated financial statements.\n(b) Short Term Loan. We have entered into short-term loan agreements with unrelated individuals. Those loans with an aggregate amount of $2,845,006 are unsecured, bear a monthly interest of 1.5% and shall be repayable in one month and loan with an aggregate amount of $128,205 is unsecured, bear a yearly interest of 1% and shall be repayable in one month. However, according to the agreement, the Company shall have the option to shorten or extend the life of those short-term loans if the need arises and the Company has agreed with the lender to extend the short-term loans on the due date. On January 18, 2022, the Company entered into a Subscription Agreement with one short-term loan holder who agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of $2,500,000. The purchase price was settled by the short-term loan balance. On the same date, the Company signed the 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the short-term loan holder up to an aggregate maximum amount of $2,500,000 in principal amount of Convertible Notes prior to January 19, 2027. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.25 per share. the Company issued convertible notes of US$2,500,000 which is for setting off against the short-term loans and interest payable.\nGoing Concern\nOur cash flow projections indicate that our current assets and projected revenues from our existing project will not be sufficient to fund operations over the next twelve months. This raises substantial doubt about our ability to continue as a going concern. We intend to rely on debt securities as well as on our notes holders exercise of their conversion option to convert our notes to our common stock, in order to fund our operations. However, it may be difficult for us to raise funds in the current economic environment. If adequate capital is not available to us, we may need to sell assets, seek to undertake a restructuring of our obligations with our creditors, or even cease our operations. We cannot give assurance that our notes holder will exercise their conversion option before the note is due. In any such case, we may not be able to continue as a going concern.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our investors.\nCritical Accounting Policies\nThe preparation of our consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates, including but not limited to those related to income taxes and impairment of long-lived assets. We base our estimates on historical experience and on various other assumptions and factors that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Based on our ongoing review, we plan to adjust to our judgments and estimates where facts and circumstances dictate. Actual results could differ from our estimates.\nWe believe the following critical accounting policies are important to the portrayal of our financial condition and results and require our management's most difficult, subjective or complex judgments, often because of the need to make estimates about the effect of matters that are inherently uncertain.\nPrinciples of Consolidation -The consolidated financial statements include the financial statements of Network CN Inc., its subsidiaries and variable interest entities for which it is the primary beneficiary. These variable interest entities are those in which the Company, through contractual arrangements, bears the risks and enjoys the rewards normally associated with ownership of the entities. Upon making this determination, the Company is deemed to be the primary beneficiary of these entities, which are then required to be consolidated for financial reporting purpose. All significant intercompany transactions and balances have been eliminated upon consolidation.\nUse of Estimates - The Company's consolidated financial statements have been prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP) which requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and reported amounts of revenue and expense during the reporting period. Estimates are used when accounting for certain items such as accounting for income tax valuation allowances. Estimates are based on historical experience, where applicable, and assumptions that management believes are reasonable under the circumstances. Due to the inherent uncertainty involved with estimates, actual results may differ.\nEquipment, Net -Equipment is stated at cost less accumulated depreciation and impairment losses, if any. Depreciation is provided on a straight-line basis, less estimated residual values over the assets estimated useful lives. The estimated useful lives are as follows:\nOffice equipment 3 - 5 years\nWhen equipment is retired or otherwise disposed of, the related cost, accumulated depreciation and provision for impairment loss, if any are removed from the respective accounts, and any gain or loss is reflected in the consolidated statements of operations and comprehensive loss. Repairs and maintenance costs on equipment are expensed as incurred.\nImpairment of Long-Lived Assets -Long-lived assets, such as equipment, are reviewed for impairment whenever events or changes in circumstance indicate that the carrying amount of the assets may not be recoverable. An impairment loss is recognized when the carrying amount of a long-lived asset exceeds the sum of the undiscounted cash flows expected to be generated from the assets use and eventual disposition. An impairment loss is measured as the amount by which the carrying amount exceeds the fair value of the asset calculated using a discounted cash flow analysis. There was no impairment of long-lived assets for the years ended December 31, 2021 and 2020.\nConvertible Promissory Notes and Warrants\n1) Debt Restructuring and Issuance of 1% Convertible Promissory Note\nOn April 2, 2009, the Company issued 1% unsecured senior convertible promissory notes to the previous 3% convertible promissory note holders who agreed to cancel these 3% convertible promissory notes in the principal amount of $5,000,000 (including all accrued and unpaid interest thereon), and all of the warrants, in exchange for the 1% unsecured senior convertible promissory notes in the principal amount of $5,000,000. The 1% convertible promissory notes bore interest at 1% per annum, payable semi-annually in arrears, matured on April 1, 2012, and were convertible at any time into shares of the Companys common stock at a fixed conversion price of $1.7445 per share, subject to customary anti-dilution adjustments. Pursuant to ASC Topic 470, Debt, the Company determined that the original convertible notes and the 1% convertible notes were with substantially different terms and hence the exchange was recorded as an extinguishment of original notes and issuance of new notes.\nThe Company determined the 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815, Derivatives and Hedging. Its embedded conversion option qualified for equity classification. The embedded beneficial conversion feature was recognized and measured by allocating a portion of the proceeds equal to the intrinsic value of that feature to additional paid-in capital. The debt discount resulting from the allocation of proceeds to the beneficial conversion feature is amortized over the term of the 1% convertible promissory notes from the respective dates of issuance using the effective interest method.\n2) Extension of 1% Convertible Promissory Note\nThe 1% convertible promissory notes matured on April 1, 2012 and on the same date, the Company and the note holders agreed to the following: 1) extension of the maturity date of the 1% convertible promissory notes for a period of two years and 2) modification of the 1% convertible promissory notes to be convertible at any time into shares of the Companys common stock at a conversion price of $1.3956 per share, subject to customary anti-dilution adjustments. In all other respects not specifically mentioned, the terms of the 1% convertible promissory notes remain the same and are fully enforceable in accordance with their terms. Subsequently, the Company issued to the note holders new 1% convertible promissory notes with a maturity date of April 1, 2014. Pursuant to ASC Topic 470, the Company determined that the modification is substantially different and hence the modification was recorded as an extinguishment of notes and issuance of new notes. The Company allocated the amount of the reacquisition price to the repurchased beneficial conversion feature using the intrinsic value of that conversion feature at the extinguishment date and the residual amount was allocated to the convertible security. Thus, the Company recorded a gain on extinguishment of debt. The 1% Convertible Promissory Notes were scheduled to mature on April 1, 2014 and on March 12, 2014, the Company and the respective holders agreed to extend the maturity date of the 1% Convertible Promissory Notes for a period of two years. In all other respects not specifically mentioned, the terms of the 1% Convertible Promissory Notes shall remain the same and shall be fully enforceable in accordance with its terms. Subsequently, the Company issued to the note holders new 1% convertible promissory notes which mature on April 1, 2016. The Company allocated the amount of the reacquisition price to the repurchased beneficial conversion feature using the intrinsic value of that conversion feature at the extinguishment date and the residual amount was allocated to the convertible security. Thus, the Company recorded no gain or loss on extinguishment of debt.\nThe Company determined the modified new 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815. Its embedded conversion option qualified for equity classification. The embedded beneficial conversion feature was recognized and measured by allocating a portion of the proceeds equal to the intrinsic value of that feature to additional paid-in capital. The debt discount resulting from the allocation of proceeds to the beneficial conversion feature is amortized over the term of the new 1% convertible promissory notes from the respective dates of issuance using the effective interest method.\nOn April 29, 2016, the Company received a reservation of rights letter from the note holders to reserves all of its powers, rights and privileges.\n3) Issuance of 1% Convertible Promissory Note\nOn January 14, 2020, the Company issued 1% unsecured senior convertible promissory notes to an individual with the principal amount of $645,000. The 1% convertible promissory notes bore interest at 1% per annum, payable semi-annually in arrears, matured on January 13, 2025, and were convertible at any time into shares of the Companys common stock at a fixed conversion price of $1.00 per share, subject to customary anti-dilution adjustments.\nThe Company determined the 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815, Derivatives and Hedging. Its embedded conversion option qualified for equity classification. The 1% convertible promissory notes did not have any embedded conversion option which shall be bifurcated and separately accounted for as a derivative under ASC 815, nor did they contain a cash conversion feature. The Company accounted for the Notes in accordance with ASC 470, as a single debt instrument. No beneficial conversion feature (the BCF) was recognized as the set conversion price for the Notes was greater than the fair value of the Companys share price at date of issuance.\nOn December 16, 2020, the Company received Abandonment of interest from the note holders to abandon, relinquish, and surrender all their rights and obligations under the Notes and they confirmed to receive no consideration in exchange for the Notes. Thus, the Company recognized a gain on extinguishment of debt of $5,299,726 at the date of extinguishment and included in the statements of operations for the year ended December 31, 2020.\nRevenue Recognition\nIn accordance with ASC 606, Revenue From Contracts with Customers, an entity recognizes revenue when its customer obtains control of promised goods or services, in an amount that reflects the consideration the entity expects to receive in exchange for those goods or services. To determine revenue recognition for arrangements that are within the scope of the standard, the entity performs the following five steps: (i) identify the contract(s) with a customer; (ii) identify the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price to the performance obligations in the contract; and (v) recognize revenue when (or as) the entity satisfies a performance obligation. The standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The standard also includes criteria for the capitalization and amortization of certain contract acquisition and fulfillment costs.\nThe Company recognize revenue when a customer obtains control of promised services. The amount of revenue recognized reflects the consideration we expect to be entitled to receive in exchange for such services. To achieve this core principle, we apply the following five steps:\n1) Identify the contract(s) with a customer - A contract with a customer exists when (i) we enter into an enforceable contract with a customer that defines each partys rights regarding the goods or services to be transferred and identifies the payment terms related to those goods or services, (ii) the contract has commercial substance and, (iii) we determine that collection of substantially all consideration for goods or services that are transferred is probable based on the customers intent and ability to pay the promised consideration. We apply judgment in determining the customers ability and intention to pay, which is based on a variety of factors including the customers historical payment experience or, in the case of a new customer, published credit and financial information pertaining to the customer. The contract term for contracts that provide a right to terminate a contract for convenience without significant penalty will reflect the term that each party has enforceable rights under the contract (the period through the earliest termination date). If the termination right is only provided to the customer, the unsatisfied performance obligations will be evaluated as customer options as discussed below.\n2) Identify the performance obligations in the contract - Performance obligations promised in a contract are identified based on the goods or services that will be transferred to the customer that are both (i) capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other resources that are readily available from third parties or from us, and (ii) are distinct in the context of the contract, whereby the transfer of the goods or services is separately identifiable from other promises in the contract. If these criteria are not met the promised goods or services are accounted for as a combined performance obligation. Certain of our contracts (under which we deliver multiple promised services) require us to perform integration activities where we bear risk with respect to integration activities. Therefore, we must apply judgment to determine whether as a result of those integration activities and risks, the promised services are distinct on the context of the contract.\nWe typically do not include options that would result in a material right. If options to purchase additional services or options to renew are included in customer contracts, we evaluate the option in order to determine if our arrangement include promises that may represent a material right and needs to be accounted for as a performance obligation in the contract with the customer.\n3) Determine the transaction price - The transaction price is determined based on the consideration to which we will be entitled in exchange for transferring goods or services to the customer. Our contract prices may include fixed amounts, variable amounts or a combination of both fixed and variable amounts. To the extent the transaction price includes variable consideration, we estimate the amount of variable consideration that should be included in the transaction price utilizing either the expected value method or the most likely amount method depending on the nature of the variable consideration. When determining if variable consideration should be constrained, management considers whether there are factors outside our control that could result in a significant reversal of revenue. In making these assessments, we consider the likelihood and magnitude of a potential reversal of revenue. These estimates are re-assessed each reporting period as required.\n4) Allocate the transaction price to the performance obligations in the contract - If the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each performance obligation based on a relative standalone selling price (SSP) basis unless the transaction price is variable and meets the criteria to be allocated entirely to a performance obligation or to a distinct good or service that forms part of a single performance obligation. For most performance obligations, we determine standalone selling price based on the price at which the performance obligation is sold separately. Although uncommon, if the standalone selling price is not observable through past transactions, we estimate the standalone selling price taking into account available information such as market conditions and internally approved pricing guidelines related to the performance obligations.\n5) Recognize revenue when (or as) we satisfy a performance obligation: we satisfy performance obligations either over time or at a point-in-time as discussed in further detail below. Revenue is recognized when the related performance obligation is satisfied by transferring control of a promised good or service to a customer.\nThe Company did not generate any revenue for the years ended December 31, 2021 and 2020.\nStock-based Compensation - The Company complies with ASC Topic 718, Compensation - Stock Compensation, using a modified prospective application transition method, which establishes accounting for stock-based awards in exchange for employee services. Under this application, the Company is required to record stock-based compensation expense for all awards granted. It requires that stock-based compensation cost is measured at grant date, based on the fair value of the award, and recognized as expense over the requisite services period.\nThe Company follows ASC topic 505-50, Accounting for Equity Instruments that are Issued to Other than Employees for Acquiring, or in Conjunction with Selling Goods and Services, for stock issued to consultants and other non-employees. In accordance with ACS Topic 505-50, the stock issued as compensation for services provided to the Company are accounted for based upon the fair value of the services provided or the estimated fair market value of the stock, whichever can be more clearly determined. The fair value of the equity instrument is charged directly to expense over the period during which services are rendered.\nIncome Taxes - The Company recognizes deferred tax liabilities and assets for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns. Deferred tax liabilities and assets are determined based on the difference between the financial statement basis and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The Company estimates the degree to which tax assets and credit carryforwards will result in a benefit based on expected profitability by tax jurisdiction. A valuation allowance for such tax assets and loss carryforwards is provided when it is determined to be more likely than not that the benefit of such deferred tax asset will not be realized in future periods. Tax benefits of operating loss carryforwards are evaluated on an ongoing basis, including a review of historical and projected future operating results, the eligible carryforward period, and other circumstances. If it becomes more likely than not that a tax asset will be used, the related valuation allowance on such assets would be reduced.\nThe Company recognizes tax benefits from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. Once this threshold has been met, the Company's measurement of its expected tax benefits is recognized in its consolidated financial statements. The Company accrues interest on unrecognized tax benefits as a component of income tax expense. Penalties, if incurred, would be recognized as a component of income tax expense.\nForeign Currency Translation -The assets and liabilities of the Companys subsidiaries and variable interest entities denominated in currencies other than U.S. dollars are translated into U.S. dollars using the applicable exchange rates at the balance sheet date. For consolidated statements of operations and comprehensive loss items, amounts denominated in currencies other than U.S. dollars were translated into U.S. dollars using the average exchange rate during the year. Equity accounts were translated at their historical exchange rates. Net gains and losses resulting from translation of foreign currency on consolidated financial statements are included in the statements of stockholders equity as accumulated other comprehensive income (loss). Foreign currency transaction gains and losses are reflected in the consolidated statements of operations and comprehensive loss.\nRecent Accounting Pronouncements\nFrom time to time, new accounting pronouncements are issued by the FASB or other standard setting bodies and adopted by the Company as of the specified effective date. Unless otherwise discussed, the recently issued accounting standards will not have a material impact on the Company's financial position or results of operations upon adoption. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe follow discussion about our market risk disclosures involves forward-looking statements. Actual results could differ from those projected in the forward-looking statements. We are exposed to market risk related to changes in interest rates and foreign currency exchange rates. We do not use derivative financial instruments for speculative or trading purposes.\nInterest Rate Sensitivity\nWe have no significant interest-bearing assets and our convertible promissory notes and short-term loans are fixed rate securities. Our current exposure to market risk for changes in interest rates relates primarily to the interest income generated by our cash deposits in banks and the fair value of our invested securities. Although we do not believe that interest rate has had a material impact on our financial position or results of operations to date, increase in interest rates in the future could increase interest cost on our new debt and could adversely impact our ability to refinance existing debt and limit our acquisition and development activities.\nForeign Currency Exchange Risk\nWhile our reporting currency is the U.S. dollar, our consolidated revenues and consolidated costs and expenses are substantially denominated in RMB. As a result, we are exposed to foreign exchange risk as our revenues and results of operations may be affected by fluctuations in the exchange rate between U.S. dollars and RMB. If the RMB depreciates against the U.S. dollar, the value of our RMB revenues, earnings and assets as expressed in our U.S. dollar financial statements will decline. If the RMB appreciates against the U.S. dollar, any new RMB-denominated investments or expenditures will be more costly to us. Assets and liabilities are translated at exchange rates at the balance sheet dates and revenue and expenses are translated at the average exchange rates while stockholders equity is translated at historical exchange rates. Any resulting translation adjustments are not included in determining net income but are included in determining other comprehensive income, a component of stockholders equity. To date, we have not entered into any hedging transactions in an effort to reduce our exposure to foreign currency exchange risk.\nThe value of the RMB against the U.S. dollar and other currencies is affected by, among other things, changes in Chinas political and economic conditions. Since July 2005, the RMB has not been pegged to the U.S. dollar. Although the Peoples Bank of China regularly intervenes in the foreign exchange market to prevent significant short-term fluctuations in the exchange rate, the RMB may appreciate or depreciate significantly in value against the U.S. dollar in the medium to long term. Moreover, it is possible that in the future, PRC authorities may lift restrictions on fluctuations in the RMB exchange rate and lessen intervention in the foreign exchange market.\nInflation Risk\nInflationary factors such as increases in the costs to acquire advertising rights and overhead costs may adversely affect our operating results. Although we do not believe that inflation has had a material impact on our financial position or results of operations to date, a high rate of inflation in the future may have an adverse effect on our ability to maintain current levels of gross margin and selling, general and administrative expenses as a percentage of revenues if the selling prices of our services do not increase with these increased costs. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Financial Statements\nThe consolidated financial statements required by this item begin on page hereof. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures that are designed to ensure that information required to be disclosed in reports that we file or submit under the Exchange Act, is recorded, processed, summarized, and reported during the year and that such information is accumulated and communicated to our management, including our Chief Executive Officer, Earnest Leung, and our Chief Financial Officer, Shirley Cheng, as appropriate to allow timely decisions regarding required disclosure. Our internal control over financial reporting is designed to provide reasonable assurance to our management and Board of Directors regarding the reliability of financial reporting and published consolidated financial statements.\nOur management, including our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures, as of December 31, 2021, in accordance with Rules 13a-15(f) and 15d-15(f) of the Exchange Act. Based on and as a result of this evaluation, our Chief Executive Officer and our Chief Financial Officer have determined that as of the end of the period covered by this annual report, our disclosure controls and procedures were not effective as a result of the material weaknesses in its internal control over financial reporting that existed as of such date as discussed below.\nManagements Annual Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining an adequate system of internal control over financial reporting. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the consolidated financial statements.\nBecause of its inherent limitations, a system of internal control over financial reporting can provide only reasonable assurance and may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Further, because of changes in conditions, effectiveness of internal control over financial reporting may vary over time.\nA material weakness is a deficiency, or a combination of deficiencies in internal control, such that there is a reasonable possibility that a material misstatement of the Companys consolidated financial statements will not be prevented, or detected and corrected, on a timely basis. A significant deficiency is a deficiency, or combination of control deficiencies, in internal control that is less severe than a material weakness, yet important enough to merit attention by those charged with government.\nOur management, with the participation and under the supervision of our Chief Executive Officer, Earnest Leung and our Chief Financial Officer, Shirley Cheng, conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework and criteria established in Internal Control- Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this evaluation, Dr. Leung and Ms. Cheng determined that our internal control over financial reporting was effective as of December 31, 2021.\nChanges in Internal Control Over Financial Reporting.\nWe regularly review our system of internal control over financial reporting and make changes to our processes and systems to improve controls and increase efficiency, while ensuring that we maintain an effective internal control environment. Changes may include such activities as implementing new, more efficient systems, consolidating activities, and migrating processes.\nThere has been no change in our internal control over financial reporting that occurred during our most recent fiscal quarter that has materially affected, or is reasonably likely to affect, our internal control over financial reporting.\nAttestation report of the registered public accounting firm\nSmaller reporting companies are not required to provide the information required by this item.\nChanges in Internal Control Over Financial Reporting.\nWe regularly review our system of internal control over financial reporting and make changes to our processes and systems to improve controls and increase efficiency, while ensuring that we maintain an effective internal control environment. Changes may include such activities as implementing new, more efficient systems, consolidating activities, and migrating processes.\nOther than the policies and procedures we implemented to remediate the material weaknesses discussed above, there has been no change in our internal control over financial reporting that occurred during our most recent fiscal quarter that has materially affected, or is reasonably likely to affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNot applicable\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTION THAT PREVENT INSPECTIONS\nNot Applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth the names, ages and positions held with respect to each Director and Executive Officer of the Company as of the date of this Annual Report.\nName Age Position Director Since\nEarnest Leung Chief Executive Officer and Chairperson of the Board\nShirley Cheng Chief Financial Officer, Corporate Secretary and Director\nFrederick Wong* Director\n*On December 31, 2021, the Companys Board of appointed Mr. Frederick Wong as independent director of the Companys Board. Mr. Frederick Wongs appointment will become effective on January 1, 2022.\nEarnest Leung has served as the Companys director since May 11, 2009, and as Chief Executive Officer and Chairperson of the Board of the Company since July 15, 2009. Dr. Leung has over 30 years experience in the investment banking industry. Since November 2004, he has worked as a financial advisor and consultant in Hong Kong and currently serves as a director of Keywin Holdings Limited, an investment company owned and controlled by Dr. Leung. From June 2009 to August 2011, he also served as a director and chief executive officer of China Boon Holdings Limited, which is listed on Hong Kong Main Board engaging in the distribution of consumer electronic products and home appliances as well as trading of scrap metals and leather and extending its business to cemetery business in 2009. Prior to that, Dr. Leung served, from September 1994 to October 2004, as Senior Director and Head of Investment, Asia for American Express Bank. Dr. Leung also held various senior investment positions with BNP International Financial Services (HK) Limited, New Zealand Insurance and Bank of America Trust. Dr. Leung holds an honorary doctor degree from International American University. Dr. Leung was appointed as a director because of his extensive knowledge of capital markets through his various senior positions in financial institutions and because of his in-depth business management experience.\nShirley Cheng has served as the Companys Interim Chief Financial Officer and Corporate Secretary, since April 1, 2012. She has served as the Finance Manager of NCN Group Management Limited, the Companys subsidiary, since March 2008. Prior to that, Ms. Cheng served from 2004 to 2008 as an auditor with PricewaterhouseCoopers, an international firm of certified public accountants. Ms. Cheng holds a Bachelors Degree in Business Administration with a major in Accountancy from the Hong Kong Baptist University and is an associate member of the Hong Kong Institute of Certified Public Accountants.\nFrederick Wong has almost 30 years experience in accounting, internal control, financial control and capital markets. He currently serves as Intelligent Living Application Group Inc. (Stock Code: ILAG.Nasdaq)s Chief Financial Officer. He has served as compliance offer for China Finance Investment Holdings Limited (Stock Code: 0875.HK) from November 1, 2018 to May 31, 2020. Mr. Wong has also served as a member of the board of directors for On Real International Holdings Limited (now known as Cocoon Holdings Limited) (Stock Code: 8510.HK) since March 31, 2016 and Top Standard Corp. (Stock Code: 8245.HK) since January 24, 2020. From September 2017 to August 2018, Mr. Wong was the chief financial officer of O Media Limited, a Macau media company in gaming. He was a director of Network CN, Inc. (Stock Code: NWCN) in U.S.A. between September 2015 and July 2017, and the authorised representative and company secretary of China Oil Gangran Energy Group Holdings Limited (Stock Code: 8132.HK) from December 2015 to November 2016 and continued acting as the authorised representative until January 2017. Mr. Wong is a CPA of Hong Kong, CPA of Canada, CPA of Australia and fellow member of Hong Kong Institute of Taxation. Mr. Wong received a Bachelor of Business Administration from the Chinese University of Hong Kong in 1989, a Bachelor or Business from the University of Southern Queensland, Australia, in 1992 and studied EMBA courses offered by the Troy University (formerly known as Troy State University), Alabama, U.S. from 1999 to 2000.\nIdentification of Certain Significant Employees\nWe have no employees who are not executive officers, but who are expected to make a significant contribution to our business.\nFamily Relationships\nThere are no family relationships between any directors or officers of the Company.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n1. had any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. been convicted in a criminal proceeding or is a named subject to a pending criminal (excluding traffic violations and other minor offenses);\n3. been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities, futures, commodities or banking activities; or\n4. been found by a court of competent jurisdiction (in a civil action), the Securities and Exchange Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities to file with the Securities and Exchange Commission statements of ownership and changes in ownership. The same persons are required to furnish us with copies of all Section 16(a) forms they file. We believe that, during fiscal 2021, all of our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities complied with the applicable filing requirements except a late Form 4 report was filed for Earnest Leung Chi Wah on January 6, 2022, to report the Keywin Holdings Ltd exercised its right to convert the share options in to 11,764,756 shares.\nIn making these statements, we have relied upon examination of the copies of all Section 16(a) forms provided to us and the written representations of our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities.\nCode of Business Conduct and Ethics\nA Code of Business Conduct and Ethics is a written standard designed to deter wrongdoing and to promote (a) honest and ethical conduct, (b) full, fair, accurate, timely and understandable disclosure in regulatory filings and public statements, (c) compliance with applicable laws, rules and regulations, (d) prompt reporting of violations of the code to an appropriate person and (e) accountability for adherence to the Code. We are not currently subject to any law, rule or regulation requiring that we adopt a Code of Business Conduct and Ethics. However, we have adopted a code of business conduct and ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. Such code of business conduct and ethics is filed herewith as Exhibit 14.1 and is also available on our corporate website at www.ncnmedia.com.\nBoard Leadership Structure\nOur Board leadership structure is currently composed of combined Chairperson of the Board of Directors and Chief Executive Officer, Chief Financial Officer and the other members of our Board of Directors are non-executive members. The Board has three outstanding committees: (1) Audit Committee; (2) Remuneration Committee and (3) Nomination Committee. All these committees are composed of non-executive directors only.\nOur Board of Directors has also determined a lead independent director is not necessary and has not appointed one at this time. In making these determinations, the Board of Directors considered the relative size of the Company, the size of the Board of Directors and the fact that all the other members of the Board of Directors are non-executive directors. The Board of Directors believes that Dr. Earnest Leung serves as both Chairperson of the board and Chief Executive Officer is in the best interest of the Company and its stockholders. Dr. Leung is the director most familiar with the PRC environment and our business, possess in-depth diverse business management experience, and is most capable of effectively identifying strategic priorities and leading the discussion and execution of strategy. The current combined position of Chairperson and Chief Executive Officer promotes a unified direction and leadership for the Board and gives a single, clear focus for the chain of command for our organization, strategy and business plans. The Board of Directors also believes that our overall corporate governance policies and practices adequately address any governance concerns raised by the dual chairperson and chief executive officer role.\nCorporate Governance\nOur board of directors currently has three standing committees which perform various duties on behalf of and report to the board of directors: (i) audit committee, (ii) remuneration committee and (iii) nominating committee. From time to time, the board of directors may establish other committees. Each of the three standing committees is comprised entirely of independent directors as follows:\nName of Director Audit Nominating Remuneration\nFrederick Wong C C C\n________\nC = Chairperson\nM = Member\nThe Board of Directors has adopted a written charter for each of these committees, copies of which can be found on our website at www.ncnmedia.com.\nAudit Committee\nOur board of directors established an Audit Committee in September 2007. Our Audit Committee currently consists of one member: Mr. Frederick Wong. The Company does not have a qualified financial expert at this time because it has not been able to hire a qualified candidate. Further, the Company believes that it has inadequate financial resources at this time to hire such an expert. The Company intends to continue to search for a qualified individual for hire. Mr. Frederick Wong serves as the chairperson of the Audit Committee.\nThe Audit Committee oversees our accounting, financial reporting and audit processes; appoints, determines the compensation of, and oversees, the independent auditors; pre-approves audit and non-audit services provided by the independent auditors; reviews the results and scope of audit and other services provided by the independent auditors; reviews the accounting principles and practices and procedures used in preparing our consolidated financial statements; and reviews our internal controls.\nThe Audit Committee works closely with management and our independent auditors. The Audit Committee also meets with our independent auditors without members of management present on regularly basis to review the results of their work. The Audit Committee also meets with our independent auditors to approve the annual scope and fees for the audit services to be performed.\nRemuneration Committee\nOur board of directors established a Remuneration Committee in September 2007. Our Remuneration Committee consists of one member: Mr. Frederick Wong.\nThe Remuneration Committee (i) oversees and makes general recommendations to the Board of Directors regarding our compensation and benefits policies; (ii) oversees, evaluates and approves cash and stock compensation plans, policies and programs for our executive officers; and (iii) oversees and sets compensation for the Board of Directors. Our Chief Executive Officer may not be present at any meeting of our compensation committee during which his compensation is deliberated.\nAll the compensation packages for executive officers and directors including both employee directors and non-employee directors are recommended and proposed by the Remuneration Committee. In determining compensation for executive officers other than the Chief Executive Officer, the Remuneration Committee considers, among other things, the recommendations of the Chief Executive Officer. However, the full Board of Directors determines all such compensation packages.\nThe Remuneration Committee may, in its discretion, delegate all or a portion of its duties and responsibilities to a sub-committee of the Remuneration Committee consisting of one or more members of the Committee. The Remuneration Committee has no current intention to delegate any of its authority to any subcommittee. Also, the Remuneration Committee did not engage any compensation consultants in determining or recommending the amount or form of executive and director compensation in the past.\nNominating Committee\nOur board of directors established a Nominating Committee in September 2007. Our Nominating Committee currently consists of one member: Mr. Frederick Wong.\nThe Nominating Committee (i) considers and periodically reports on matters relating to the identification, selection and qualification of the Board of Directors and candidates nominated to the Board of Directors and its committees; (ii) develops and recommends governance principles applicable to the Company; and (iii) oversees the evaluation of the Board of Directors and management from a corporate governance perspective.\nAlthough our bylaws do not contain provisions which specifically address the process by which a stockholder may nominate an individual to stand for election to the Board of Directors at our annual meeting of stockholders, the Nominating Committee will consider director candidates recommended by stockholders. In evaluating candidates submitted by stockholders, the Nominating Committee will consider (in addition to the criteria applicable to all director candidates described below) the needs of the Board and the qualifications of the candidate, and may also take into consideration the number of shares held by the recommending stockholder and the length of time that such shares have been held. In general, to have a candidate considered by the Nominating Committee, a stockholder must submit the recommendation in writing and must include the following information:\n1. The name of the stockholder and evidence of the persons ownership of Company stock, including the number of shares owned and the length of time of ownership; and\n2. The name of the candidate, the candidates resume or a listing of his or her qualifications to be a director of the Company and the persons consent to be named as a director if selected by the Nominating Committee and nominated by the Board.\nThe stockholder recommendation and information described above must be sent to the Corporate Secretary at Network CN Inc., Unit 802B-803, 8/F, Tower 2, South Seas Centre, 75 Mody Road, Tsim Sha Tsui, Kowloon, Hong Kong .For a candidate to be considered for nomination by the Nominating Committee at an annual meeting, a stockholder recommendation must be received not less than 120 days prior to the anniversary date of the Companys most recent annual meeting of stockholders.\nThe Nominating Committee does not have any formal criteria for director nominees; however, it believes that director nominees should have certain minimum qualifications, including the highest personal and professional integrity and values, an inquiring and independent mind, practical wisdom and mature judgment. In evaluating director nominees, the Nominating Committee also considers an individuals skills, character, leadership experience, business experience and acumen, familiarity with relevant industry issues, national and international experience, and other relevant criteria that may contribute to our success. This evaluation is performed in light of the skill set and other characteristics that would most complement those of the current directors, including the diversity, maturity, skills and experience of the board as a whole, with the objective of recommending a group of persons that can best implement our business plan, develop our business and represent shareholder interests.\nAs described above, the Nominating Committee will consider candidates recommended by shareholders. It will also receive suggestions of candidates from current Board members, the Companys executive officers or other sources, which may be either unsolicited or in response to requests from the Nominating Committee.\nAfter a person has been identified by the Nominating Committee as a potential candidate, the Nominating Committee may collect and review publicly available information regarding the person to assess whether the person should be considered further. The Nominating Committee members may contact the person if the person should be considered further. Generally, the Nominating Committee may request information from the candidate, review the persons accomplishments and qualifications and may conduct one or more interviews with the candidate and members of the committee or other Board members. In certain instances, Nominating Committee members or other Board members may contact one or more references provided by the candidate or may contact other members of the business community or other persons that may have first-hand knowledge of the candidates accomplishments. The Nominating Committees evaluation process does not vary based on whether or not a candidate is recommended by a shareholder, although, as stated above, in the case of such a candidate the Board may take into consideration the number of shares held by the recommending shareholder and the length of time that such shares have been held.\nBoard Oversight of Risk\nOur Board of Directors recognizes that, although risk management is a primary responsibility of the Companys management, the Board plays a critical role in oversight of risk. The Board, in order to more specifically carry out this responsibility, has assigned certain task focusing on reviewing different areas including strategic, operational, financial and reporting, compensation, compliance, corporate governance and other risks to the relevant Board Committees as summarized above. Each Committee then reports to the full Board ensuring the Boards full involvement in carrying out its responsibility for risk management. ITEM 11. EXECUTIVE COMPENSATION\nPersons Covered\nAs of December 31, 2021, there were only two Executive Officers including Chief Executive Officer and Chief Financial Officer in the Company. The Companys Chief Executive Officer and Chief Financial Officer during fiscal year 2021 and the Companys executive officer as of December 31, 2021, or the Named Executive Officers are set forth below:\nName Position\nEarnest Leung Chief Executive Officer and Chairperson of the Board\nShirley Cheng Chief Financial Officer and Corporate Secretary\n________\nCompensation Discussion and Analysis\nOverview\nThe Companys executive compensation program is generally designed to align the interests of executives with the interests of shareholders and to reward executives for achieving the Companys objectives. The executive compensation program is also designed to attract and retain the services of qualified executives.\nAll the compensation packages for executive officers are recommended and proposed by the Remuneration Committee. In determining compensation for executive officers, the Remuneration Committee considers the officers current compensation, the level of executive compensation packages for similarly situated companies, changes in cost of living, our financial condition, our operating results and individual performance. However, the full Board of Directors determines all such compensation packages.\nExecutive compensation generally consists of base salary, bonuses and long-term incentive equity compensation such as stock grants or additional options to purchase shares of the Companys common stock as well as various health and welfare benefits. The Board has determined that both the base salary and long-term incentive equity compensation should be the principal component of executive compensation. The Board has not adopted a formal bonus plan, and all bonuses are discretionary.\nElements of Compensation\nThe executive compensation for (i) the Companys Chief Executive Officer and Chief Financial Officer and (ii) the Companys compensated executive officer who were serving as executive officers (collectively Named Executive Officers) for fiscal year 2021 primarily consisted of base salary, long term incentive equity compensation, income tax reimbursement, and other compensation and benefit programs generally available to other employees,\nBase Salary. The Board establishes base salaries for the Companys Named Executive Officers based on the scope of their responsibilities, taking into account competitive market compensation paid by other companies in the Companys peer group for similar positions. Generally, the Board believes that executive base salaries should be targeted near the median of the range of salaries for executives in similar positions and with similar responsibilities at comparable companies in line with our compensation philosophy.\nBase salaries are reviewed annually and may be adjusted to realign salaries with market levels after taking into account individual responsibilities, performance and experience.\nBonuses. Bonuses are intended to compensate the Named Executive Officers for achieving the Companys financial performance and other objectives established by the Board each year. The Board currently does not adopt a formal bonus plan and all bonuses are discretionary.\nLong-Term Incentive Equity Compensation. The Board believes that stock-based awards promote the long-term growth and profitability of the Company by providing executive officers with incentives to improve shareholder value and contribute to the success of the Company and by enabling the Company to attract, retain and reward the best available persons for executive officer positions. The Named Executive Officers were eligible to receive certain number of shares of common stock of the Company. The Company cannot currently determine the number or type of additional awards that may be granted to eligible participants under the long-term incentive equity compensation plan in the future. Such determination will be made from time to time by the Remuneration Committee (or Board).\nIncome Tax Reimbursement. Dr. Earnest Leung were fully reimbursed by the Company for their Hong Kong personal income taxes resulting from their employment under the employment agreement dated July 15, 2009.\nChange-In-Control and Termination Arrangements. The employment agreements with current Named Executives may be terminated by giving the other party three-month advanced notice, except Ms. Shirley Cheng may be terminated with one-month advance notice. Other than as disclosed above, the Company does not have change-in-control arrangements with any of its current Named Executives, and the Company is not obligated to pay severance or other enhanced benefits to executive officers, unless otherwise stated in Hong Kong Employment Ordinance, upon termination of their employment.\nSummary Compensation Table\nThe following table sets forth information concerning all compensation awarded to, earned by or paid during fiscal years 2021 and 2020, to the Named Executive Officers:\nName and\nPrincipal\nPosition\nYear (1)\nSalary\n($)\n(2)\nBonus\n($)\n(3) Stock\nAwards\n($)\nOptions\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nChange in\nPension Value\nand\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\n(4) All Other\nCompensation\n($)\nTotal\n($)\nEarnest Leung,\nChief Executive\nOfficer and\nDirector - - - - - - - -\n- - - - - - - -\nShirley Cheng\nChief\nFinancial Officer\nand Corporate\nSecretary 13,462 - - - - - 14,039\n12,308 - - - - - 12,923\n______\n(1) The Company withheld 12 months salary totaled HK$720,000 (approximately $92,308) to Dr. Earnest Leung during the fiscal years ended December 31, 2021 and 2020 respectively. As of December 31, 2021, the accrued salary to Dr. Leung was $917,520.\n(2) No bonus was paid to the Named Executive Officers in fiscal 2021 and 2020.\n(3) As required by SEC rules, amounts in the column Stock Awards present the aggregate grant date fair value of awards made each year computed in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification™ 718 Compensation-Stock Compensation (FASB ASC 718). The grant date fair value of each of the executives award is measured based on the closing price of our common stock on the date of grant.\nThese amounts do not reflect whether the recipient has actually realized or will realize a financial benefit from the awards. Under generally accepted accounting principles, compensation expense with respect to stock awards granted to our employees, executives and directors is generally recognized over the requisite services period. The SECs disclosure rules previously required that we present stock award information based on the amount recognized during the corresponding year for financial statement reporting purposes with respect to these awards. However, the recent changes in the SECs disclosure rules require that we now present stock award amounts using the grant date fair value of the awards granted during the corresponding year.\nThe aggregate number of stock awards vested to each of the Named Executive Officers for his/her service rendered in each fiscal period was summarized as follows:\nNamed Executive Officer\nEarnest Leung\n-\n-\nShirley Cheng\n-\n-\nAs of December 31, 2021, all the above stocks were issued to each of Named Executive Officers.\n(4) All other compensation only represents the followings:\n(a) A monthly contribution paid by the Company into a mandatory provident fund for the benefit of each of the Named Executive Officers;\n(b) Monthly cash allowance of HK$40,000 (approximately $5,128) paid to Dr. Earnest Leung. The Company withheld 12 months cash allowance payment for Dr. Leung during the fiscal years ended December 31, 2021 and 2020 respectively; As of December 31, 2021, the accrued cash allowance to Dr. Leung was $495,083; and\n(c) Income tax reimbursement paid to Dr. Earnest Leung during each fiscal year. As of December 31, 2021, the accrued income tax reimbursement to Dr. Leung and Ms. Cheng was $180,644 and $nil respectively.\nThere is no item that is not a perquisite or personal benefit (such as tax reimbursements and contributions to the mandatory provident fund) whose value exceeds $10,000 for each Named Executives.\nEmployment Contracts\nOn July 15, 2009, the Company entered into an executive employment agreement with Dr. Earnest Leung in connection with their services to the Company as our Chief Executive Officer. Under the terms of the agreements, each of Dr. Leung will receive a monthly salary of HK$60,000 (approximately $7,692) and we have agreed to grant Dr. Leung 6 million shares for their first two years of service to the Company. We will fully reimburse them for their Hong Kong personal income taxes resulting from their employment under the agreements. Each of the executives has also agreed to customary non-competition and confidentiality provisions and the agreements may be terminated by the Company at any time without notice or payment, in the event that any of the executives engage in misconduct or dereliction of duty.\nOn October 15, 2021, the Company entered into a new executive employment agreement with Ms. Cheng in connection with their services to the Company as our Chief Financial Officer. Under the terms of the agreements, Ms. Cheng will receive a monthly salary of HK$35,000 (approximately $4,487). The employment may be terminated by the Company at any time without notice or payment, in the event that any of the executives engage in misconduct or dereliction of duty.\nRetirement Benefits\nCurrently, we do not provide any employees, including our named executive officers any company sponsored retirement benefits other than a state pension scheme in which all of our employees in China participate.\nGrants of Plan-Based Awards\nThe following table sets forth information regarding grants of awards to the Named Executive Officers during the year ended December 31, 2021:\nName\nGrant Date\nAll Other\nStock\nAwards:\nNumber of\nShares of\nStock\nor Units (#)\nAll Other\nOption\nAwards:\nNumber\nof Securities\nUnderlying\nOptions (#)\n(1)\nExercise or\nBase Price\nof\nOption\nAwards\n($/share)\nGrant Date\nFair Value\nof Stock\nand\nOptions\nAwards\nClosing\nPrice on\nGrant\nDate\n($/share)\nEarnest Leung\n-\n-\n-\n-\n-\n-\nShirley Cheng\n-\n-\n-\n-\n-\n-\nNo stock awards were granted to the Companys Named Executive Officers during fiscal year 2021.\nOutstanding Equity Awards at Fiscal Year-End\nThe following table sets forth the equity awards outstanding at December 31, 2021 for each of the named executive officers.\nOption Awards\nStock Awards\nName\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable\nOption Exercise\nPrice ($)\nOption\nExpiration\nDate\nNumber of\nShares or\nUnits of\nStock That\nHave Not\nVested (#)\nMarket Value\nof Shares or\nUnits of Stock\nThat Have\nNot Vested\n($)\nEarnest\nLeung\n-\n-\n-\n-\n-\n-\nShirley\nCheng\n-\n-\n-\n-\n-\n-\nPotential Payments upon Termination or Change-in Control\nThe employment agreements with current Named Executives may be terminated by giving the other party three-month advanced notice, except Ms. Shirley Cheng may be terminated with one-month advance notice. Other than as disclosed above, the Company does not have change-in-control arrangements with any of its current Named Executives, and the Company is not obligated to pay severance or other enhanced benefits to executive officers, unless otherwise stated in Hong Kong Employment Ordinance, upon termination of their employment. Accordingly, there is no potential payments payable to our current Named Executive Officers upon termination or change-in control.\nDirector Compensation\nOverview\nCash compensation On February 2015, the Remuneration Committee proposed the monthly cash compensation for each director decreased to $1,000 from July 2014 to Jun 30, 2015, which was approved by the Board. On August 28, 2015, the Remuneration Committee proposed the monthly cash compensation for each director remain unchanged, which was approved by the Board.\nLong-Term Incentive Equity Compensation. The Board believes that stock-based awards promote the long-term growth and profitability of the Company by providing directors with incentives to improve shareholder value and contribute to the success of the Company. Our Board determined the number of stock to be granted to directors for their service by considering the aggregate fair value as at the grant date of the past stock awards given to non-employee director and the Companys performance. On December 30, 2021, Earnest Leung, Shirley Cheng and Wong Wing Kong were granted an award of 52,172 shares, 50,000 shares and 15,000 shares at a fair value of $83,475, $80,000 and $24,000 respectively at the date of grant and vested on same date, for their service for fiscal 2021. The shares granted were not yet issued.\nFor the year ended December 31, 2021, both the employee directors and non-employee directors were entitled to a monthly cash compensation of $1,000. The Company withheld 12 monthly cash compensation during the fiscal year ended December 31, 2021.\nThe following table provides information about the compensation earned by directors who served during fiscal year 2021:\nName of\ndirector(3) Fees Earned\nor Paid(1)\nin Cash\n($)\nStock\nAwards(2)\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nChange in\nPension Value\nand Nonqualified\nDeferred\nCompensation\nEarnings($)\nAll Other\nCompensation\n($)\nTotal\n($)\nEarnest\nLeung - 83,475 - - - - 83,475\nShirley\nCheng - 80,000 - - - - 80,000\nWong\nWing Kong * - 24,000 - - - - 24,000\n*Non-employee directors, On December 31, 2021, Mr. Wong Wing Kong, the independent director of Network CN Inc. (the Company\") notified the Company of his intention to resign from his position as a director of the Company for personal reasons. Mr. Wong Wing Kongs resignation will become effective on December 31, 2021. Mr. Wong Wing Kongs resignation was not the result of any disagreement with the Company on any matter relating to the Companys operations, policies or practices.\n______\n(1) For the service periods from January 2021 to December 2021, both the employee directors and non-employee directors were entitled to a monthly cash compensation of $1,000. The Company withheld 12 monthly cash compensation during the fiscal year ended December 31, 2021.\n(2) As required by SEC rules, amounts in the column Stock Awards present the aggregate grant date fair value of awards made each year computed in accordance with ASC Topic 718. The grant date fair value of each of the directors award is measured based on the closing price of our common stock on the date of grant. These amounts do not reflect whether the recipient has actually realized or will realize a financial benefit from the awards. Under generally accepted accounting principles, compensation expense with respect to stock awards granted to our employees, executives and directors is generally recognized over the requisite services period.\nRemuneration Committee Interlocks and Insider Participation\nThe current member of the Remuneration Committee is non-executive director, and all past members were independent directors at all times during their service on such Committee. None of the past or present members of our Remuneration Committee are present or past employees or officers of ours or any of our subsidiaries. No member of the Remuneration Committee has had any relationship with us requiring disclosure under Item 404 of Regulation S-K under the Securities Exchange Act of 1934, as amended. None of our executive officers has served on the Board or Remuneration Committee (or other committee serving an equivalent function) of any other entity, one of whose executive officers served on our Board or Remuneration Committee.\nLimitation of Liability and Indemnification of Officers and Directors\nOur bylaws provide for the indemnification of our present and prior directors and officers or any person who may have served at our request as a director or officer of another corporation in which we own shares of capital stock or of which we are a creditor, against expenses actually and necessarily incurred by them in connection with the defense of any actions, suits or proceedings in which they, or any of them, are made parties, or a party, by reason of being or having been director(s) or officer(s) of us or of such other corporation, in the absence of negligence or misconduct in the performance of their duties. This indemnification policy could result in substantial expenditure by us, which we may be unable to recoup.\nInsofar as indemnification by us for liabilities arising under the Securities Exchange Act of 1934, as amended, may be permitted to our directors, officers and controlling persons pursuant to provisions of the Articles of Incorporation and Bylaws, or otherwise, we have been advised that in the opinion of the SEC, such indemnification is against public policy and is, therefore, unenforceable. In the event that a claim for indemnification by such director, officer or controlling person of us in the successful defense of any action, suit or proceeding is asserted by such director, officer or controlling person in connection with the securities being offered, we will, unless in the opinion of our counsel the matter has been settled by controlling precedent, submit to a court of appropriate jurisdiction the question whether such indemnification by us is against public policy as expressed in the Act and will be governed by the final adjudication of such issue.\nAt the present time, there is no pending litigation or proceeding involving a director, officer, employee or other agent of ours in which indemnification would be required or permitted. We are not aware of any threatened litigation or proceeding which may result in a claim for such indemnification. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table provides information as of December 31, 2021 with respect to compensation plans, under which securities are authorized for issuance, aggregated as to (i) compensation plans previously approved by security holders, and (ii) compensation plans not previously approved by security holders.\nEquity Compensation Plan Information\nPlan Category Number Of Securities To\nBe Issued Upon Exercise Of\nOutstanding Options,\nWarrants And Rights (A)\nWeighted Average\nExercise Price Of\nOutstanding Options,\nWarrants And Rights\n(B)\nNumber Of Securities Remaining\nAvailable For Future Issuance\nUnder Equity Compensation\nPlans (Excluding Securities\nReflected In Column (A)) (C)\nEquity compensation\nplans approved by\nsecurity holders - - 281,503(1)\nTotal - - 281,503\n(1) We reserved 40,000 shares for issuance under our 2004 Stock Incentive Plan, of which 13,333 shares are still available for issuance as of December 31, 2021. We reserved 2,680,000 shares for issuance under our Amended and Restated 2007 Equity Incentive Plan of which 268,170 are still available for issuance as of December 31, 2021. See below subsection - \" Equity Incentive Plans\" for more information about the plan.\nOption Grants in the Last Fiscal Year\nNone.\nEquity Incentive Plan\nIn April 2004, our Board of Directors and holders of a majority of our then outstanding common stock authorized and approved the 2004 Stock Incentive Plan, or the 2004 Plan. Under the 2004 Plan, we reserved 40,000 shares of our common stock for issuance upon exercise of incentive and non-qualified stock options, stock bonuses and rights to purchase awarded from time-to-time, to our officers, directors, employees and consultants. As of December 31, 2016, 26,667 shares have been issued under the plan and 13,333 shares remain available for issuance. No options, warrants or other rights to acquire shares of our common stock have been granted or are outstanding under the plan. A registration statement on Form S-8 was filed with the SEC with respect to 26,667 shares of common stock issuable under the plan on April 22, 2004 (SEC File No. 333-114644).\nIn March 2007, our Board of Directors authorized and approved the 2007 Stock Option/Stock Issuance Plan, or the 2007 Plan. The purpose of the plan is to promote the best interests of the Company and its stockholders by providing a means of non-cash remuneration to selected participants who contribute to the operating progress and earning power of the Company. The plan also provides incentives to employees and directors by offering them an opportunity to acquire a proprietary interest in the Company. Under the 2007 Plan, we reserved 100,000 shares of our common stock for issuance upon exercise of incentive and non-qualified stock options, stock bonuses and rights to purchase awarded from time to time, to our officers, directors, employees and consultants. A registration statement on Form S-8 was filed with the SEC on April 6, 2007 (SEC File No. 333-141943) with respect to 100,000 shares of common stock issuable under the 2007 Plan as well as options to purchase 3,000 shares of common stock issued to the Companys legal counsel in February 2006. Such options were not issued under the 2004 Plan or the 2007 Plan. The Companys stockholders approved the 2007 Plan in November 2007.\nIn July 2009, the Board of Directors approved the issuance of 493,267 shares in excess of the number of shares of common stock available for issuance under the 2007 Plan, and in accordance with the 2007 Plan, the Company is required to seek stockholder approval within twelve months after the date of such excess grant. The Board of Directors has no immediate plans to issue additional shares under the 2007 Plan, however, the Board of Directors believes that increasing the maximum number of shares of common stock that may be issued under the 2007 Plan will be instrumental for us to continue to attract and retain outstanding employees. Accordingly, on June 2, 2010, the Board of Directors approved the amendment and restatement of the 2007 Equity Incentive Plan (the First Amendment of 2007 Plan), with the only change being to increase the maximum number of shares of common stock of the Company, par value $0.001 per share that may be issued and sold under the 2007 Plan from 100,000 to 1,426,667 and submitted it for stockholders approval. A registration statement on Form S-8 was filed with the SEC on July 30, 2010 (SEC File No. 333-168417) with respect to the First Amendment of 2007 Plan.\nOn July 30, 2012, the Board of Directors approved the second amendment and restatement of the 2007 Equity Incentive Plan (the Second Amendment of 2007 Plan), with the only change being to increase the maximum number of shares of common stock of the Company, par value $0.001 per share that may be issued and sold under the 2007 Plan from 1,426,667 to 2,093,333, and submitted it for stockholders approval. The Board of Directors believes that such arrangements will be instrumental for the Company to be able to continue to attract and retain outstanding employees. A registration statement on Form S-8 was filed with the SEC on October 12, 2012 (SEC File No. 333-184398) with respect to the Second Amendment of 2007 Plan.\nOn October 31, 2012, the Board of Directors approved the third amendment and restatement of the 2007 Equity Incentive Plan (the Third Amendment of 2007 Plan), with the only change being to increase the maximum number of shares of common stock of the Company, par value $0.001 per share that may be issued and sold under the 2007 Plan from 2,093,333 to 2,680,000, and submitted it for stockholders approval. The Board of Directors believes that such arrangements will be instrumental for us to be able to continue to attract and retain outstanding employees. A registration statement on Form S-8 was filed with the SEC on January 16, 2014 (SEC File No. 333-193381) with respect to the Third Amendment of 2007 Plan.\nAs of December 31, 2021, 2,411,830 shares have been issued under the plan and 268,170 shares remain available for issuance. Except for the shares granted to directors, no options, warrants or other rights to acquire shares of our common stock have been granted or are outstanding under the plan.\nBoth of the Plans are administered by our Board of Directors. Under each plan, the Board determines which of our employees, officers, directors and consultants are granted awards, as well as the material terms of each award, including whether options are to be incentive stock options or non-qualified stock options.\nSubject to the provisions of the Plans, and the Internal Revenue Code with respect to incentive stock options, the Board determines who shall receive awards, the number of shares of common stock that may be purchased, the time and manner of exercise of options and exercise prices. At its discretion, the Board also determines the form of consideration to be received upon exercise and may permit the exercise price of options granted under the plans to be paid in whole or in part with previously acquired shares and/or the surrender of options. The term of options granted under the plans may not exceed ten years, or five years for an incentive stock option granted to an optionee owning more than 10% of our voting stock. The exercise price for incentive stock options may not be less than 100% of the fair market value of our common stock at the time the option is granted. However, incentive stock options granted to a 10% holder of our voting stock may not be exercisable at less than 110% of the fair market value of our common stock at the date of the grant. The exercise price for non-qualified options will be determined by the board.\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following tables set forth information as of December 22, 2022, regarding the beneficial ownership of our common stock (a) by each stockholder who is known by the Company to own beneficially in excess of 5% of our outstanding common stock; (b) by each of the Companys officers and directors; (c) and by the Companys officers and directors as a group. Except as otherwise indicated, all persons listed below have (i) sole voting power and investment power with respect to their shares of common stock, except to the extent that authority is shared by spouses under applicable law, and (ii) record and beneficial ownership with respect to their shares of stock. Unless otherwise identified, the address of the directors and officers of the Company listed above is Unit 705B, 7th FL, New East Ocean Centre, 9 Science Museum Road, TST, KLN, Hong Kong\nTitle of Class\nName and Address of\nBeneficial Owner\nOffice, If Any\nAmount & Nature of\nBeneficial\nOwnership (1)\nPercent of\nClass (2)\nCommon Stock\nEarnest Leung\nCEO and Director\n13,749,017\n66.26\nCommon Stock\nShirley Cheng\nCFO and director\n-\n-\nCommon Stock\nFrederick Wong\nDirector\n-\n-\nAll Officers and\nDirectors as a group\n13,749,017\nCommon Stock\nKeywin Holdings Limited (3)\nOffice A, 18/F., Lucky Plaza, Nos. 315-321 Lockhart Road, Wanchai, Hong Kong\n5% Security Holder\n44,707 (3)\n0.22\nCommon Stock\nSino Portfolio International Ltd(4)\nP.O. Box 1239, Offshore Incorporations Centre, Victoria, Seychelles\n5% Security Holder\n1,835,753\n8.85\nCommon Stock\nWong Yuk Chor\n5% Security Holder\n1,344,478\n6.48\nTotal Shares Owned by\nPersons Named above\n16,973,955\n______\n(1) Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities.\n(2) A total of 20,749,018 shares of our common stock outstanding are considered to be outstanding pursuant to SEC Rule 13d-3(d)(1) as of December 22, 2022. For each beneficial owner above, any options exercisable within 60 days have been included in the denominator.\n(3) Dr. Earnest Leung, its sole director, and Ms. Pui Chu Tang, its shareholder and Dr. Leungs spouse, have voting and dispositive control over the shares held by Keywin Holdings Limited.\n(4) Ms. Angela Chan, its sole director, and Mrs. Chen Yang Foo Oi, its shareholder, have voting and dispositive control over the shares held by Sino Portfolio International Ltd.\nChanges in Control\nThere are no arrangements known to us, including any pledge by any person of our securities, the operation of which may at a subsequent date result in a change in control of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nRelated Party Transactions\nExcept as set forth below, during our last two fiscal years, we have not entered into any material transactions or series of transactions that would be considered material in which any director or executive officer or beneficial owner of 5% or more of any class of our capital stock, or any immediate family member of any of the preceding persons, had a direct or indirect material interest:\nIn April 2009, in connection with debt restructuring, Statezone Ltd. of which Dr. Earnest Leung, the Companys Chief Executive Officer and a Director (being appointed on July 15, 2009 and May 11, 2009, respectively) was the sole director, provided agency and financial advisory services to the Company. Accordingly, the Company paid an aggregate service fee of $350,000, of which $250,000 has been recorded as issuance costs for 1% Convertible Promissory Notes and $100,000 has been recorded as prepaid expenses and other current assets, net since April 2009. Such $100,000 is refundable unless the Keywin Option is exercised and completed. On October 28, 2021, Keywin exercised its option and $100,000 was recorded in general and administrative expenses during the year ended December 31, 2021.\nOn July 1, 2009, the Company and Keywin, of which the Companys chief executive officer and director is the director and his spouse is the sole shareholder, entered into an Amendment, pursuant to which the Company agreed to extend the exercise period for the Keywin Option under the Note Exchange and Option Agreement between the Company and Keywin, to purchase an aggregate of 1,637,522 shares of our common stock for an aggregate purchase price of $2,000,000, from a three-month period ended on July 1, 2009, to a six-month period ended October 1, 2009. The exercise period for the Keywin option was subsequently further extended to a nine-month period ended January 1, 2010, pursuant to the Second Amendment. On January 1, 2010, the Company and Keywin entered into the third Amendment, pursuant to which the Company agreed to further extend the exercise period to an eighteen-month period ended on October 1, 2010, and provide the Company with the right to unilaterally terminate the exercise period upon 30 days written notice. On September 30, 2010, the exercise price was extended at various times from September 1, 2010 to December 31, 2017 and the Keywin Option was further extended to a hundred and twenty-nine-month period ending on January 1, 2020 and the exercise price changed to $0.99. On December 31, 2019, the latest exercise period for the Keywin Option was further extended to a hundred and fifty-three-month period ending on January 1, 2022. On June 1, 2021, the Company and Keywin, of which the Companys chief executive officer and director is the director and his spouse is the sole shareholder, entered into an Amendment, pursuant to which the Company agreed Keywin to purchase an aggregate of 11,764,756 shares of the Companys common stock for an aggregate purchase price of $2,000,000. The fair value of the purchase option was determined utilizing Black-Scholes option pricing model on the date before the modification and after modification, accordingly, the Company recorded $3,544,430 and $nil as dividend for the year ended December 31, 2021 and 2020, respectively.\nOn October 28, 2021, Keywin exercised its option to purchase an aggregate of 11,764,756 shares of the Companys common stock for an aggregate purchase price of $2,000,000 which for setting off against the Companys obligation to repay part of the short term loan interest payable, there was no cash proceeds from the exercise of Keywin option..\nAs of December 31, 2021 and 2020, the Company recorded an aggregated amount of $2,845,006 of short-term loans from a shareholder that the loans are unsecured, bear a monthly interest of 1.5% and repayable on demand. However, according to the agreements, the Company shall have the option to shorten or extend the life of those short-term loans if the need arises and the Company has agreed with the shareholder to extend the short-term loans on the due date. As of December 31, 2021 and 2020, the Company recorded an interest payable recorded in accounts payable, accrued expenses and other payables of $470,315 and $2,363,485, respectively. The interest expenses of the short-term loans from continuing operations for the years ended December 31, 2021 and 2020 amounted to $512,101 and $512,863, respectively. On January 18, 2022, the shareholder agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company and converted the short-term loan and interest payable to convertible note. As of the date of this report, except the loan and interest payable balance of $2,500,000 converted to convertible note, the remaining loans have not yet been repaid.\nOn January 18, 2022, the shareholder agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company and converted the short-term loan and interest payable to convertible note. As of the date of this report, except the loan and interest payable balance of $2,500,000 converted to convertible note, the remaining loans have not yet been repaid.\nRelated Party Transaction Policy\nOur Company has adopted a written Related Party Transaction Policy, or the Policy, for the purpose of describing the procedures used to identify, review, approve and disclose, if necessary, any transaction in which (i) the Company is a participant and (ii) a related person has or will have a direct or indirect material interest.\nOnce a related party transaction in which the aggregate amount involved will or may be expected to exceed $120,000 in any calendar year has been identified, the Audit Committee must review the transaction for approval or ratification. In determining whether to approve or ratify a related party transaction, the Audit Committee shall consider all relevant facts and circumstances, including the following factors:\nl the benefits to the Company of the transaction;\nl the nature of the related partys interest in the transaction;\nl whether the transaction would impair the judgment of a director or executive officer to act in the best interest of the Company and its stockholders;\nl the potential impact of the transaction on a directors independence; and\nl any other matters the Audit Committee deems appropriate.\nNo director may participate in any discussion, approval or ratification of a transaction in which he or she is a related person.\nPromoters and Certain Control Persons\nWe did not have any promoters at any time during the past five fiscal years. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nGries & Associates, LLC and Union Power HK CPA Limited are our Principal Independent Registered Public Accountants engaged to audit our financial statements for the fiscal years ended December 31, 2021 and 2020, respectively. The following table shows the fees that we paid or accrued for the audit and other services provided by Gries & Associates, LLC and Union Power HK CPA Limited, for the fiscal years ended December 31, 2021 and 2020.\nFee Category\nAudit Fees $ 15,000 $ 36,250\nAudit-Related Fees $ -- $ --\nTax Fees $ -- $ --\nAll Other Fees $ -- $ --\nAudit Fees\nThis category consists of fees for professional services rendered by our principal independent registered public accountant for the audit of our annual consolidated financial statements, review of consolidated financial statements included in our quarterly reports and services that are normally provided by the independent registered public accounting firms in connection with statutory and regulatory filings or engagements for those fiscal years.\nAudit-Related Fees\nThis category consists of fees for assurance and related services by our principal independent registered public accountant that are reasonably related to the performance of the audit or review of our consolidated financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultations concerning financial accounting and reporting standards.\nTax Fees\nThis category consists of fees for professional services rendered by our principal independent registered public accountant for tax compliance, tax advice, and tax planning.\nAll Other Fees\nThis category consists of fees for services provided by our principal independent registered public accountant other than the services described above.\nPolicy on Pre-Approval of Audit Services\nThe Audit Committee pre-approves all services, including both audit and non-audit services, provided by our independent registered public accounting firm. All audit services (including statutory audit engagements as required under local country laws) must be accepted by the Audit Committee before the audit commences.\nEach year, management and the independent registered public accounting firm will jointly submit a pre-approval request, which will list each known and/or anticipated audit and non-audit service for the upcoming calendar year and which will include associated budgeted fees. The Audit Committee will review the requests and approve a list of annual pre-approved non-audit services.\nAll services provided by Gries & Associates, LLC and Union Power HK CPA Limited during the fiscal years ended December 31, 2021 and 2020 were pre-approved by the Audit Committee.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) The following consolidated financial statements are filed as a part of this Form 10-K:\n(i) Reports of Independent Registered Public Accounting Firms\n(ii) Consolidated Balance Sheets as of December 31, 2021 and 2020\n(iii) Consolidated Statements of Operations and Comprehensive Income/(Loss) for the years ended December 31, 2021 and 2020\n(iv) Consolidated Statement of Stockholders Equity for the years ended December 31, 2021 and 2020\n(v) Consolidated Statements of Cash Flows for the years ended December 31, 2021 and 2020\n(vi) Notes to Consolidated Financial Statements\n(b) The following Exhibits are filed as part of this Annual Report on Form 10-K:\nEXHIBIT INDEX\nExhibit No. Exhibit Description\n3.1 Amended And Restated Certificate Of Incorporation\n3.2 Amended and Restated By-Laws, adopted on January 10, 2006\n3.3 Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on July 27, 2009\n3.4 Certificate of Amendment of Certificate of Incorporation filed with the Delaware Secretary of State on September 16, 2011\n3.5 Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on September 16, 2011\n3.6 Certificate of Amendment of Certificate of Incorporation filed with the Delaware Secretary of State on October 11, 2021\n4.1 Form of Registrants Common Stock Certificate\n4.2 Form of Registrants Common Stock Certificate\n4.3 TEDA Travel Group, Inc. 2004 Stock Incentive Plan, effective on April 16, 2004\n4.4 Network CN Inc. Third Amended and Restated 2007 Equity Incentive Plan\n10.1 Note Exchange and Option Agreement, dated April 2, 2009, between the Company and Keywin Holdings Limited.\n10.2 Employment Agreement, dated July 15, 2009, between the Company and Earnest Leung.\n10.3 Amendment No. 1 to Note Exchange and Option Agreement, dated July 1, 2009, between Keywin Holdings Limited and the Company.\n10.4 Amendment No. 2 to Note Exchange and Option Agreement dated September 30, 2009, between Keywin Holding Limited and the Company.\n10.5 Amendment No. 3 to Note Exchange and Option Agreement, dated January 1, 2010, between Keywin Holding Limited and the Company\n10.6 Amendment No. 4 to Note Exchange and Option Agreement, dated September 30, 2010, between Keywin Holding Limited and the Company\n10.7 Amendment No. 5 to Note Exchange and Option Agreement, dated June 1, 2011, between Keywin Holding Limited and the Company\n10.8 Amendment No. 6 to Note Exchange and Option Agreement, dated December 30, 2011, between Keywin Holding Limited and the Company\n10.9 Amendment No. 7 to Note Exchange and Option Agreement, dated June 28, 2012, between Keywin Holding Limited and the Company\n10.10 Amendment No.8 to Note Exchange and Option Agreement, dated December 28, 2012, between Keywin Holding Limited and the Company\n10.11 Amendment No.9 to Note Exchange and Option Agreement, dated December 31, 2013, between Keywin Holding Limited and the Company\n10.12 Amendment No.10 to Note Exchange and Option Agreement, dated December 12, 2014, between Keywin Holding Limited and the Company\n10.13 Amendment No.11 to Note Exchange and Option Agreement, dated December 31, 2015, between Keywin Holdings Limited and the Company\n10.14 Amendment No.12 to Note Exchange and Option Agreement, dated December 28, 2017, between Keywin Holdings Limited and the Company\n10.15 Amendment No.13 to Note Exchange and Option Agreement, dated December 31, 2019, between Keywin Holdings Limited and the Company\n10.16 Amendment No.14 to Note Exchange and Option Agreement, dated June 1, 2021, between Keywin Holdings Limited and the Company\n10.17 Consultancy Agreement in connection with debt restructuring dated December 1, 2008, between NCN Group Ltd and Statezone Limited\n14.1 Code of Business Conduct and Ethics for Network CN Inc. as approved and amended by the Board of Directors as of September 1, 2007 and September 29, 2008 respectively\n21.1 Subsidiaries of the registrant.*\n31.1 Certification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2 Certification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1 Certification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2 Certification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Labels Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n______\n* Filed herewith.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nNETWORK CN INC\nBy: /s/ Earnest Leung\nEarnest Leung\nChief Executive Officer\n(Principal Executive Officer)\nDate: December 23, 2022\nBy: /s/ Shirley Cheng\nShirley Cheng\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nDate: December 23, 2022\nPower of Attorney\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Earnest Leung and Jennifer Fu, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this report on Form 10-K and to file the same, with exhibits thereto and other documents in connection therewith with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or substitute or substitutes may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nName\nTitle Date\n/s/ Earnest Leung\nChief Executive Officer and Director December 23, 2022\nEarnest Leung\n(Principal Executive Officer)\n/s/ Shirley Cheng\nChief Financial Officer and Director December 23, 2022\nShirley Cheng\n(Principal Financial and Accounting Officer)\n/s/ Frederick Wong\nDirector December 23, 2022\nFrederick Wong\nEXHIBIT INDEX\nExhibit No. Exhibit Description\n3.1 Amended And Restated Certificate Of Incorporation\n3.2 Amended and Restated By-Laws, adopted on January 10, 2006\n3.3 Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on July 27, 2009\n3.4 Certificate of Amendment of Certificate of Incorporation filed with the Delaware Secretary of State on September 16, 2011\n3.5 Amended and Restated Certificate of Incorporation filed with the Delaware Secretary of State on September 16, 2011\n3.6 Certificate of Amendment of Certificate of Incorporation filed with the Delaware Secretary of State on October 11, 2021\n4.1 Form of Registrants Common Stock Certificate\n4.2 Form of Registrants Common Stock Certificate\n4.3 TEDA Travel Group, Inc. 2004 Stock Incentive Plan, effective on April 16, 2004\n4.4 Network CN Inc. Third Amended and Restated 2007 Equity Incentive Plan\n10.1 Note Exchange and Option Agreement, dated April 2, 2009, between the Company and Keywin Holdings Limited.\n10.2 Employment Agreement, dated July 15, 2009, between the Company and Earnest Leung.\n10.3 Amendment No. 1 to Note Exchange and Option Agreement, dated July 1, 2009, between Keywin Holdings Limited and the Company.\n10.4 Amendment No. 2 to Note Exchange and Option Agreement dated September 30, 2009, between Keywin Holding Limited and the Company.\n10.5 Amendment No. 3 to Note Exchange and Option Agreement, dated January 1, 2010, between Keywin Holding Limited and the Company\n10.6 Amendment No. 4 to Note Exchange and Option Agreement, dated September 30, 2010, between Keywin Holding Limited and the Company\n10.7 Amendment No. 5 to Note Exchange and Option Agreement, dated June 1, 2011, between Keywin Holding Limited and the Company\n10.8 Amendment No. 6 to Note Exchange and Option Agreement, dated December 30, 2011, between Keywin Holding Limited and the Company\n10.9 Amendment No. 7 to Note Exchange and Option Agreement, dated June 28, 2012, between Keywin Holding Limited and the Company\n10.10 Amendment No.8 to Note Exchange and Option Agreement, dated December 28, 2012, between Keywin Holding Limited and the Company\n10.11 Amendment No.9 to Note Exchange and Option Agreement, dated December 31, 2013, between Keywin Holding Limited and the Company\n10.12 Amendment No.10 to Note Exchange and Option Agreement, dated December 12, 2014, between Keywin Holding Limited and the Company\n10.13 Amendment No.11 to Note Exchange and Option Agreement, dated December 31, 2015, between Keywin Holdings Limited and the Company\n10.14 Amendment No.12 to Note Exchange and Option Agreement, dated December 28, 2017, between Keywin Holdings Limited and the Company\n10.15 Amendment No.13 to Note Exchange and Option Agreement, dated December 31, 2019, between Keywin Holdings Limited and the Company\n10.16 Amendment No.14 to Note Exchange and Option Agreement, dated June 1, 2021, between Keywin Holdings Limited and the Company\n10.17 Consultancy Agreement in connection with debt restructuring dated December 1, 2008, between NCN Group Ltd and Statezone Limited\n14.1 Code of Business Conduct and Ethics for Network CN Inc. as approved and amended by the Board of Directors as of September 1, 2007 and September 29, 2008 respectively\n21.1 Subsidiaries of the registrant.*\n31.1 Certification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2 Certification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1 Certification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2 Certification of Chief Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n101.INS XBRL Instance Document\n101.SCH XBRL Taxonomy Extension Schema Document\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB XBRL Taxonomy Extension Labels Linkbase Document\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document\n______\n* Filed herewith.\nNETWORK CN INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nContents\nPage\nReport of Independent Registered Public Accounting Firms\n(PCAOB ID 6778)\nConsolidated Balance Sheets as of December 31, 2021 and 2020\nConsolidated Statements of Operations and Comprehensive Income for the years ended December 31, 2021 and 2020\nConsolidated Statements of Stockholders Deficit for the years ended December 31, 2021 and 2020\nConsolidated Statements of Cash Flows for the years ended December 31, 2021 and 2020\nNotes to Consolidated Financial Statements\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street Suite 1100\nDenver, Colorado 80246\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nNetwork CN Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Network CN Inc. (the Company) as of December 31and 2021, and the related consolidated statement of operations, statement of stockholders deficit, and cash flows for the year then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 1 to the financial statements, the Company has a net loss of $1,215,636 for the year ended December 31, 2021, incurred losses since inception of $138,455,814, has negative working capital of $5,573,847 and negative operating cash flows of $441,146. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street Suite 1100\nDenver, Colorado 80246\nEmphasis of Matters-Risks and Uncertainties\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and\nfinancial markets of many countries, including the geographical area in which the Company plans to operate.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2022.\nDenver, CO\nDecember 22, 2022\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nGries & Associates, LLC\nDenver, Colorado\nReport of Independent Registered Public Accounting Firm\nThe Board of Directors and Stockholders of:\nNetwork CN Inc. and subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Network CN Inc. and its subsidiaries (collectively referred to as the Company) as of December 31, 2020 and 2019, and the related consolidated statements of operations and comprehensive income, stockholders deficit and cash flows for the years then ended, and related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2020 and 2019, and the consolidated results of operations and its cash flows for the years then ended, in conformity with the accounting principles generally accepted in the United States of America.\nGoing concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the consolidated financial statements, the Company has suffered recurring losses from operations, generated negative cash flows from operating activities and has an accumulated deficit that raise substantial doubt about its ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans in regard to these matters are also described in Note 1. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatements, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide reasonable basis for our opinion.\nReport of Independent Registered Public Accounting Firm (Continued)\nThe Board of Directors and Stockholders of:\nNetwork CN Inc. and subsidiaries\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements, and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\nUNION POWER HK CPA LIMITED\nCertified Public Accountants\nWe have served as the Companys auditor since 2013.\nHong Kong SAR\nMarch 30, 2021\nNETWORK CN INC.\nCONSOLIDATED BALANCE SHEETS\nDECEMBER 31, 2021 AND 2020\nNote\nASSETS\nCurrent Assets\nCash\n$ 21,677 $ 5,967\nPrepaid expenses and other current assets, net 19,828 100,000\nTotal Current Assets\n41,505 105,967\nEquipment, Net 2,632\nRight-of-use assets\n75,521 -\nTOTAL ASSETS\n$ 119,658 $ 106,566\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccounts payable, accrued expenses and other payables $ 2,597,181 $ 4,261,650\nLease liabilities 44,960 -\nShort term loan 2,973,211 2,973,211\nTotal Current Liabilities\n5,615,352 7,234,861\nNon-Current Liabilities\nNoncurrent portion of lease liabilities 30,561 -\n1% convertible promissory note due 2025, net 645,000 645,000\nTotal Non- Current Liabilities\n675,561 645,000\nTOTAL LIABILITIES\n6,290,913 7,879,861\nCOMMITMENTS AND CONTINGENCIES - -\nSTOCKHOLDERS DEFICIT\nPreferred stock, $0.001 par value, 5,000,000 shares authorized\nNone issued and outstanding\n- -\nCommon stock, $0.001 par value, 100,000,000,000 shares\nauthorized. Shares issued and outstanding: 20,749,018 and\n8,774,263 as of December 31, 2021 and December 31, 2020,\nrespectively\n20,749 8,773\nAdditional paid-in capital\n130,559,370 124,209,441\nAccumulated deficit\n(138,455,814 ) (133,695,748 )\nAccumulated other comprehensive income\n1,704,440 1,704,239\nTOTAL STOCKHOLDERS DEFICIT (6,171,255 ) (7,773,295 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\n$ 119,658 $ 106,566\nThe accompanying notes are an integral part of the consolidated financial statements.\nNETWORK CN INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE (LOSS) INCOME\nFOR THE YEARS ENDED DECEMBER 31, 2021 AND 2020\nNote(s)\nREVENUES\nAdvertising services\n$ - $ -\nCOST OF REVENUES\nCost of advertising services\n- -\nGROSS LOSS\n- -\nOPERATING EXPENSES\nGeneral and administrative\n(479,018 ) (292,490 )\nStock based compensation for services\n(217,475 ) -\nTotal Operating Expenses\n(696,493 ) (292,490 )\nLOSS FROM CONTINUED OPERATIONS\n(696,493 ) (292,490 )\nOTHER INCOME\nGain on extinguishment of debt - 5,299,726\nGain from write-off of long aged payables 394,522\nInterest income\n-\nTotal Other Income\n5,694,249\nINTEREST AND OTHER DEBT-RELATED\nEXPENSES\nInterest expense 7 & 8 (519,851 ) (532,603 )\nTotal Interest and Other Debt-Related Expenses\n(519,851 ) (532,603 )\nNET (LOSS) PROFIT BEFORE INCOME TAXES\n(1,215,636 ) 4,869,156\nIncome taxes - -\nNET (LOSS) PROFIT FROM CONTINUING\nOPERATIONS\n(1,215,636 ) 4,869,156\nNET (LOSS) PROFIT\n(1,215,636 ) 4,869,156\nOTHER COMPREHENSIVE GAIN\nForeign currency translation gain\nTotal other comprehensive gain\nCOMPREHENSIVE (LOSS) INCOME\n$ (1,215,435 ) $ 4,869,477\nNET (LOSS) PROFIT PER COMMON SHARE -\nBASIC AND DILUTED $ (0.14 ) $ 0.55\nWEIGHTED AVERAGE NUMBER OF SHARES\nOUTSTANDING - BASIC AND DILUTED 11,023,767 8,774,263\nThe accompanying notes are an integral part of the consolidated financial statements.\nNETWORK CN INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED DECEMBER 31, 2021 AND 2020\nCommon Stock Additional Paid-In Accumulated Accumulated\nOther\nComprehensive\nShare Amount Capital Deficit Income Total\nBalance as of\nJanuary 1, 2020 8,774,263 $ 8,773 $ 124,209,441 $ (138,564,904 ) $ 1,703,918 $ (12,642,772 )\nTranslation\nadjustment - - - -\nNet loss for the\nyear - - - 4,869,156 - 4,869,156\nBalance as of\nDecember 31, 2020 8,774,263 $ 8,773 $ 124,209,441 $ (133,695,748 ) $ 1,704,239 $ (7,773,295 )\nShares issued for\nstock granted to\nconsultant for\nservices 10,000 29,990 - - 30,000\nStock-based\ncompensation for\nstock granted to\ndirectors for\nservices - - 187,474 - - 187,474\nShares issued for\nshare option\nconversion 11,764,755 11,765 1,988,235 - - 2,000,000\nShares issued for\nprivate placement 200,000 599,800 - - 600,000\nTranslation\nadjustment - - -\nDividend\n3,544,430 (3,544,430 ) - -\nNet loss for the year - - - (1,215,636 ) - (1,215,636 )\nBalance as of\nDecember 31, 2021 20,749,018 $ 20,749 $ 130,559,370 $ (138,455,814 ) $ 1,704,440 $ (6,171,255 )\nThe accompanying notes are an integral part of the consolidated financial statements.\nNETWORK CN INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended December 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet (loss) profit $ (1,215,636 ) $ 4,869,156\nAdjustments to reconcile net profit/(loss) to net cash used in operating\nactivities\nDepreciation and amortization: 15,145\nStock-based compensation for service 217,475 -\nGain from write-off of long aged payables (708 ) (394,522 )\nGain on extinguishment of debt - (5,299,726 )\nChanges in operating assets and liabilities:\nPrepaid expenses and other current assets, net 80,172 -\nAccounts payable, accrued expenses and other payables 477,162 158,943\nOperating lease liabilities (14,756 ) -\nNet cash used in operating activities (441,146 ) (665,693 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of equipment (2,422 ) (617 )\nNet cash used in investing activities (2,422 ) (617 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from private placement 459,077 -\nProceeds from convertible promissory note - 645,000\nProceeds from short-term loans - 21,446\nNet cash provided by financing activities 459,077 666,446\nEFFECT OF EXCHANGE RATE CHANGES ON CASH\nNET INCREASE IN CASH 15,710\nCASH, BEGINNING OF YEAR 5,967 5,510\nCASH, END OF YEAR $ 21,677 $ 5,967\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid during the year for:\nIncome taxes $ - $ -\nInterest $ - $ 615,000\nSUPPLEMENTAL DISCLOSURE OF NON-CASH FINANCING ACTIVITIES:\nExercise of conversion option (Note 1) $ 2,000,000 $ -\nSettlement of interest payable by private placement (Note 2) $ 140,923 $ -\nDividend (Note 3) $ 3,544,430 $\nNote:\n(1) On October 28, 2021, Keywin exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000 which for setting off against the Companys obligation to repay part of the short term loan interest payable, there was no cash proceeds from the exercise of Keywin option.\n(2) On May 3, 2021, the Company entered into Common Stock Agreement with the investor that the Company will sell an aggregate of 200,000 shares of the Company's common stock to the New investor at $3. The Company received $459,077 cash proceeds from the investor and $140,923 was settled for the interest payable of short-term loans.\n(3) The fair value of the purchase option of Keywin option was determined utilizing Black-Scholes option pricing model on the date before the modification and after modification, accordingly, the Company recorded $3,544,430 and $nil as dividend for the year ended December 31, 2021 and 2020, respectively.\nThe accompanying notes are an integral part of the consolidated financial statements.\nNETWORK CN INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED DECEMBER 31, 2021 AND 2020\nNOTE 1 ORGANIZATION AND PRINCIPAL ACTIVITIES\nNetwork CN Inc. was originally incorporated on September 10, 1993 in Delaware with headquarters in the Hong Kong Special Administrative Region of the Peoples Republic of China (PRC or China). Since August 2006, Network CN Inc., its subsidiaries and variable interest entities for which it is the primary beneficiary (collectively NCN or the Company we, our or us) has been principally engaged in the provision of out-of-home advertising in China through the operation of a network of roadside light emitting diode (LED) digital video panels, mega-size LED digital video billboards and light boxes in major cities.\nDetails of the Companys principal subsidiaries and variable interest entities as of December 31, 2021 are described in Note 3 - Subsidiaries and Variable Interest Entities.\nCOVID-19 Pandemic\nIn December 2019, an outbreak of COVID-19 was identified in China and was subsequently recognized as a global pandemic by the World Health Organization (WHO) on March 11, 2020. Since that time, COVID-19 has spread around the world and throughout the United States, including in the regions and countries in which we operate. Federal, state and local governments in the U.S and around the world have imposed restrictions on travel and business operations and are advising or requiring individuals to limit or eliminate time outside of their homes. Temporary closures of businesses have also been ordered in certain jurisdictions, and other businesses have temporarily closed voluntarily. These actions expanded significantly in March and April of 2020 throughout the U.S. Consequently, the COVID-19 outbreak has severely restricted the level of economic activity in the U.S. and around the world.\nThe outbreak has resulted in authorities implementing numerous measures to try to contain the virus, such as quarantines and shelter in place orders. These measures may remain in place for a significant period of time and adversely affect our business, operations and financial condition as well as the business, operations and financial conditions of our business partners. The spread of the virus has also caused us to modify our business practices (including employee work locations and cancellation of physical participation in meetings) in ways that may be detrimental to our business (including working remotely and its attendant cybersecurity risks). We may take further actions as may be required by government authorities or that we determine are in the best interests of our employees. There is no certainty that such measures will be sufficient to mitigate the risks posed by the virus or otherwise be satisfactory to government authorities.\nThere has been no material adverse impact on the Companys 2021 results of operations to date. The effect of COVID-19 and related events, those not yet known or knowable, could have a negative effect on the stock price, business prospects, financial condition, and results of operations of the Company, including as a result of quarantines, market volatility, market downturns and business closures.\nFor the reasons discussed above, the Company cannot reasonably estimate with any degree of certainty the future impact COVID-19 may have on the Companys results of operations, financial position, and liquidity. Notwithstanding any actions by national, state, and local governments to mitigate the impact of COVID-19 or by the Company to address the adverse impacts of COVID-19, there can be no assurance that any of the foregoing activities will be successful in mitigating or preventing significant adverse effects on the Company.\nRecent development\nIssuance of Convertible Promissory Note\nOn January 18, 2022, the Company entered into a Subscription Agreement under which the Subscriber agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of two million five hundred thousand US Dollars ($2,500,000). On the same date, the Company signed the with 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the Subscriber up to an aggregate maximum amount of $2,500,000 in principal amount of Convertible Notes prior to January 19, 2027. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.25 per share.\nExercise of conversion option\nOn October 28, 2021, Keywin Holdings Limited (Keywin) exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000 which for setting off against the Companys obligation to repay part of the short term loan interest payable, there was no cash proceeds from the exercise of Keywin option.\nPrivate Placement\nOn May 3, 2021, the Company entered into Common Stock Agreement with the foreign investor (the \"New investor\") that the Company will sell an aggregate of 200,000 shares of the Company's common stock to the New investor. Pursuant to the terms of a Common Stock Agreement between the Company and the New investor, the purchase price paid by the New investor for the shares were $3 per share for an aggregate sum of six hundred thousand U.S. dollars. The Company received $459,077 cash proceeds from the investor and $140,923 was settled for the interest payable of short-term loans.\nIncrease of authorized capital\nOn April 28, 2020, the Board of Directors and Majority of stockholders of the Company approved to increase the total number of authorized shares of Common Stock from 26,666,667 to 100,000,000,000. On October 11, 2021, we filed a Certificate of Amendment to our Certificate of Incorporation with the Delaware Secretary of State to increase our authorized shares of common stock from 26,666,667 to 100,000,000,000 and the increase had approved by Delaware secretary of state on April 5, 2022\nIdentification of New projects\nOn January 14, 2020, the Company entered into a Letter of Intent with Earthasia Worldwide Holdings Limited (EWHL) that the Company will acquire 100% of the EWHLs issued and outstanding stock owned by the shareholders of the EWHL and the EWHL will become a wholly owned subsidiary of the Company.\nOn July 23, 2020, the Company entered into Share Exchange Agreement with Ease Global Limited (Ease Global), the shareholder of Trade More Global Limited (‘Trade More) that the Company will purchase, One Thousand and One Hundred (1,100) currently issued shares of common stock of Trade More from Ease Global and in exchange for Forty-nine Million (49,000,000) shares of newly-issued shares of common stock of the Company. The closing of the Exchange shall occur on other date as agreed by the parties of the Share Exchange Agreement. Upon completion of the Exchange, 78% of issued shares of common stock of the Company shall be held by the Ease Global while all of the shares of capital stock of Trade More shall be held by the Company. EWHL is a wholly owned subsidiary of Trade More.\nThe closing of Exchange was not completed on September 2, 2020 which was due to the progress of audit. Since Ease Global cannot fulfill the revenue target and complete the audit, the Company considered the Share Exchange Agreement was lapsed.\nGoing Concern\nThe Company has net cash used in operating activities of $441,146 and $665,693 for the years ended December 31, 2021 and 2020 respectively. As of December 31, 2021 and 2020, the Company has stockholders deficit of $6,171,255 and $7,773,295, respectively. These factors raise substantial doubt about the Companys ability to continue as a going concern. The Companys plans regarding those concerns are addressed in the following paragraph. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nIn response to current financial conditions, the Company has actively explored new prominent media projects in order to provide a wider range of media and advertising services and improve our financial performance. If the project can start to operate, the Company expects that the project will improve the Companys future financial performance. The Company expects that the new project can generate positive cashflow.\nThe existing cash and cash equivalents together with highly liquid current assets are insufficient to fund the Companys operations for the next twelve months. The Company will need to rely upon some combination of cash generated from the Companys operations, or proceeds from the issuance of the Companys equity and debt securities as well as the exercise of the conversion option by the Companys note holders to convert the notes to the Companys common stock, in order to maintain the Companys operations. Based on the Companys best estimates, the Company believes that there are sufficient financial resources to meet the cash requirements for the coming twelve months and the consolidated financial statements have been prepared on a going concern basis. However, there can be no assurance the Company will be able to continue as a going concern. These uncertainties may result in adverse effects on continuation of the Company as a going concern. The accompany consolidated financial statements do not reflect any adjustments that might result from the outcome of these uncertainties.\nNOTE 2 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n(A) Basis of Presentation and Preparation\nThese consolidated financial statements of the Company have been prepared in conformity with generally accepted accounting principles in the United States of America (GAAP).\n(B) Principles of Consolidation\nThe consolidated financial statements include the financial statements of Network CN Inc., its subsidiaries and variable interest entities for which it is the primary beneficiary. These variable interest entities are those in which the Company, through contractual arrangements, bears the risks and enjoys the rewards normally associated with ownership of the entities. Upon making this determination, the Company is deemed to be the primary beneficiary of these entities, which are then required to be consolidated for financial reporting purpose. All significant intercompany transactions and balances have been eliminated upon consolidation.\n(C) Use of Estimates\nThe Company's consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and reported amounts of revenue and expense during the reporting period. Estimates are used when accounting for certain items such as accounting for income tax valuation allowances. Estimates are based on historical experience, where applicable, and assumptions that management believes are reasonable under the circumstances. Due to the inherent uncertainty involved with estimates, actual results may differ.\n(D) Cash\nCash includes cash on hand, cash accounts, and interest-bearing savings accounts placed with banks and financial institutions. For the purposes of the statements of cash flow, the Company considers all highly liquid investments with original maturities of three months or less at the time of purchase to be cash equivalents. There were no cash equivalents balance as of December 31, 2021 and December 31, 2020.\n(E) Equipment, Net\nEquipment is stated at cost less accumulated depreciation and impairment losses, if any. Depreciation is provided on a straight-line basis, less estimated residual values over the assets estimated useful lives. The estimated useful lives are as follows:\nSchedule of estimated useful lives\nOffice equipment 3 - 5 years\nWhen equipment is retired or otherwise disposed of, the related cost, accumulated depreciation and provision for impairment loss, if any, are removed from the respective accounts, and any gain or loss is reflected in the consolidated statements of operations and comprehensive loss. Repairs and maintenance costs on equipment are expensed as incurred.\n(F) Impairment of Long-Lived Assets\nLong-lived assets, such as equipment, are reviewed for impairment whenever events or changes in circumstance indicate that the carrying amount of the assets may not be recoverable. An impairment loss is recognized when the carrying amount of a long-lived asset exceeds the sum of the undiscounted cash flows expected to be generated from the assets use and eventual disposition. An impairment loss is measured as the amount by which the carrying amount exceeds the fair value of the asset calculated using a undiscounted cash flow analysis. There was no impairment of long-lived assets for the years ended December 31, 2021 and 2020.\n(G) Leases\nThe Company adopted Accounting Standards Codification (ASC) Topic 842, Leases (ASC 842) effective as of January 1, 2019. Under ASC 842, the Company determines if an arrangement is or contains a lease at contract inception.\nOperating lease right-of-use (ROU) assets represent the Companys right to use an underlying asset for the lease term and lease liabilities represent the Companys obligation to make lease payments arising from the lease. Operating lease ROU assets and liabilities are recognized based on the present value of lease payments over the lease term at the commencement date of the lease. ROU assets also include any initial direct costs incurred and any lease payments made at or before the lease commencement date, less any lease incentive received. The Company uses its incremental borrowing rate in determining the present value of lease payments based on the information available at the date of lease commencement. The incremental borrowing rate reflects the rate of interest that a lessee would have to pay to borrow, on a collateralized basis over a similar term, an amount equal to the lease payments in a similar economic environment. Lease expense for an operating lease is recognized on a straight-line basis over the lease term.\nThe Company elected to not separate non-lease components from the associated lease components and to not recognize right-of-use assets and lease liabilities for leases with a term of twelve months or less. Variable lease payments are primarily related to property taxes, insurance and common area maintenance, and are recognized as lease costs when incurred.\n(H) Convertible Promissory Notes and Warrants\nNew 1% Convertible Promissory Notes, due in 2016\nOn April 2, 2009, the Company issued 1% unsecured senior convertible promissory notes to the previous 3% convertible promissory note holders who agreed to cancel these 3% convertible promissory notes in the principal amount of $5,000,000 (including all accrued and unpaid interest thereon), and all of the warrants, in exchange for the 1% unsecured senior convertible promissory notes in the principal amount of $5,000,000. The 1% convertible promissory notes bore interest at 1% per annum, payable semi-annually in arrears, matured on April 1, 2012, and were convertible at any time into shares of the Companys common stock at a fixed conversion price of $1.7445 per share, subject to customary anti-dilution adjustments. Pursuant to ASC Topic 470, Debt, the Company determined that the original convertible notes and the 1% convertible notes were with substantially different terms and hence the exchange was recorded as an extinguishment of original notes and issuance of new notes.\nThe Company determined the 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815, Derivatives and Hedging. Its embedded conversion option qualified for equity classification. The embedded beneficial conversion feature was recognized and measured by allocating a portion of the proceeds equal to the intrinsic value of that feature to additional paid-in capital. The debt discount resulting from the allocation of proceeds to the beneficial conversion feature is amortized over the term of the 1% convertible promissory notes from the respective dates of issuance using the effective interest method.\nThe 1% convertible promissory notes matured on April 1, 2012 and on the same date, the Company and the note holders agreed to the following: 1) extension of the maturity date of the 1% convertible promissory notes for a period of two years and 2) modification of the 1% convertible promissory notes to be convertible at any time into shares of the Companys common stock at a conversion price of $1.3956 per share, subject to customary anti-dilution adjustments. In all other respects not specifically mentioned, the terms of the 1% convertible promissory notes remain the same and are fully enforceable in accordance with their terms. Subsequently, the Company issued to the note holders new 1% convertible promissory notes with a maturity date of April 1, 2014. Pursuant to ASC Topic 470, the Company determined that the modification is substantially different and hence the modification was recorded as an extinguishment of notes and issuance of new notes. The Company allocated the amount of the reacquisition price to the repurchased beneficial conversion feature using the intrinsic value of that conversion feature at the extinguishment date and the residual amount was allocated to the convertible security. Thus, the Company recorded a gain on extinguishment of debt. The 1% Convertible Promissory Notes were scheduled to mature on April 1, 2014 and on March 12, 2014, the Company and the respective holders agreed to extend the maturity date of the 1% Convertible Promissory Notes for a period of two years. In all other respects not specifically mentioned, the terms of the 1% Convertible Promissory Notes shall remain the same and shall be fully enforceable in accordance with its terms. Subsequently, the Company issued to the note holders new 1% convertible promissory notes which was matured on April 1, 2016. The Company allocated the amount of the reacquisition price to the repurchased beneficial conversion feature using the intrinsic value of that conversion feature at the extinguishment date and the residual amount was allocated to the convertible security. Thus, the Company recorded no gain or loss on extinguishment of debt.\nThe Company determined the modified new 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815. Its embedded conversion option qualified for equity classification. The embedded beneficial conversion feature was recognized and measured by allocating a portion of the proceeds equal to the intrinsic value of that feature to additional paid-in capital. The debt discount resulting from the allocation of proceeds to the beneficial conversion feature is amortized over the term of the new 1% convertible promissory notes from the respective dates of issuance using the effective interest method.\nOn April 29, 2016, the Company received a reservation of rights letter from the note holders to reserves all of its powers, rights and privileges.\nOn December 16, 2020, the Company received Abandonment of interest from the note holders to abandon, relinquish, and surrender all their rights and obligations under the Notes and they confirmed to receive no consideration in exchange for the Notes. Thus, the Company recognized a gain on extinguishment of debt from continuing operations of $5,299,726 for the years ended December 31 2020.\nNew 1% Convertible Promissory Notes, due in 2025\nOn January 14, 2020, the Company issued 1% unsecured senior convertible promissory notes to an individual with the principal amount of $645,000. The 1% convertible promissory notes bore interest at 1% per annum, payable semi-annually in arrears, matured on January 13, 2025, and were convertible at any time into shares of the Companys common stock at a fixed conversion price of $1.00 per share, subject to customary anti-dilution adjustments.\nThe Company determined the 1% convertible promissory notes to be conventional convertible instruments under ASC Topic 815, Derivatives and Hedging. Its embedded conversion option qualified for equity classification. The 1% convertible promissory notes did not have any embedded conversion option which shall be bifurcated and separately accounted for as a derivative under ASC 815, nor did they contain a cash conversion feature. The Company accounted for the Notes in accordance with ASC 470, as a single debt instrument. No beneficial conversion feature (the BCF) was recognized as the set conversion price for the Notes was greater than the fair value of the Companys share price at date of issuance.\n(I) Revenue Recognition\nIn accordance with ASC 606, Revenue From Contracts with Customers, an entity recognizes revenue when its customer obtains control of promised goods or services, in an amount that reflects the consideration the entity expects to receive in exchange for those goods or services. To determine revenue recognition for arrangements that are within the scope of the standard, the entity performs the following five steps: (i) identify the contract(s) with a customer; (ii) identify the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price to the performance obligations in the contract; and (v) recognize revenue when (or as) the entity satisfies a performance obligation. The standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The standard also includes criteria for the capitalization and amortization of certain contract acquisition and fulfillment costs.\nThe Company recognize revenue when a customer obtains control of promised services. The amount of revenue recognized reflects the consideration we expect to be entitled to receive in exchange for such services. To achieve this core principle, we apply the following five steps:\n1) Identify the contract(s) with a customer - A contract with a customer exists when (i) we enter into an enforceable contract with a customer that defines each partys rights regarding the goods or services to be transferred and identifies the payment terms related to those goods or services, (ii) the contract has commercial substance and, (iii) we determine that collection of substantially all consideration for goods or services that are transferred is probable based on the customers intent and ability to pay the promised consideration. We apply judgment in determining the customers ability and intention to pay, which is based on a variety of factors including the customers historical payment experience or, in the case of a new customer, published credit and financial information pertaining to the customer. The contract term for contracts that provide a right to terminate a contract for convenience without significant penalty will reflect the term that each party has enforceable rights under the contract (the period through the earliest termination date). If the termination right is only provided to the customer, the unsatisfied performance obligations will be evaluated as customer options as discussed below.\n2) Identify the performance obligations in the contract - Performance obligations promised in a contract are identified based on the goods or services that will be transferred to the customer that are both (i) capable of being distinct, whereby the customer can benefit from the good or service either on its own or together with other resources that are readily available from third parties or from us, and (ii) are distinct in the context of the contract, whereby the transfer of the goods or services is separately identifiable from other promises in the contract. If these criteria are not met the promised goods or services are accounted for as a combined performance obligation. Certain of our contracts (under which we deliver multiple promised services) require us to perform integration activities where we bear risk with respect to integration activities. Therefore, we must apply judgment to determine whether as a result of those integration activities and risks, the promised services are distinct on the context of the contract.\nWe typically do not include options that would result in a material right. If options to purchase additional services or options to renew are included in customer contracts, we evaluate the option in order to determine if our arrangement include promises that may represent a material right and needs to be accounted for as a performance obligation in the contract with the customer.\n3) Determine the transaction price - The transaction price is determined based on the consideration to which we will be entitled in exchange for transferring goods or services to the customer. Our contract prices may include fixed amounts, variable amounts or a combination of both fixed and variable amounts. To the extent the transaction price includes variable consideration, we estimate the amount of variable consideration that should be included in the transaction price utilizing either the expected value method or the most likely amount method depending on the nature of the variable consideration. When determining if variable consideration should be constrained, management considers whether there are factors outside our control that could result in a significant reversal of revenue. In making these assessments, we consider the likelihood and magnitude of a potential reversal of revenue. These estimates are re-assessed each reporting period as required.\n4) Allocate the transaction price to the performance obligations in the contract - If the contract contains a single performance obligation, the entire transaction price is allocated to the single performance obligation. Contracts that contain multiple performance obligations require an allocation of the transaction price to each performance obligation based on a relative standalone selling price (SSP) basis unless the transaction price is variable and meets the criteria to be allocated entirely to a performance obligation or to a distinct good or service that forms part of a single performance obligation. For most performance obligations, we determine standalone selling price based on the price at which the performance obligation is sold separately. Although uncommon, if the standalone selling price is not observable through past transactions, we estimate the standalone selling price taking into account available information such as market conditions and internally approved pricing guidelines related to the performance obligations.\n5) Recognize revenue when (or as) we satisfy a performance obligation: we satisfy performance obligations either over time or at a point-in-time as discussed in further detail below. Revenue is recognized when the related performance obligation is satisfied by transferring control of a promised good or service to a customer.\nThe Company has yet to generate revenue from operations for the years ended December 31, 2021 and 2020.\n(J) Stock-based Compensation\nThe Company complies with ASC Topic 718, Compensation - Stock Compensation, using a modified prospective application transition method, which establishes accounting for stock-based awards in exchange for employee services. Under this application, the Company is required to record stock-based compensation expense for all awards granted. It requires that stock-based compensation cost is measured at grant date, based on the fair value of the award, and recognized as expense over the requisite services period.\nThe Company follows ASC topic 505-50, Accounting for Equity Instruments that are Issued to Other than Employees for Acquiring, or in Conjunction with Selling Goods and Services, for stock issued to consultants and other non-employees. In accordance with ACS Topic 505-50, the stock issued as compensation for services provided to the Company are accounted for based upon the fair value of the services provided or the estimated fair market value of the stock, whichever can be more clearly determined. The fair value of the equity instrument is charged directly to expense over the period during which services are rendered.\n(K) Income Taxes\nThe Company recognizes deferred tax liabilities and assets for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns. Deferred tax liabilities and assets are determined based on the difference between the financial statement basis and tax basis of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. The Company estimates the degree to which tax assets and credit carryforwards will result in a benefit based on expected profitability by tax jurisdiction. A valuation allowance for such tax assets and loss carryforwards is provided when it is determined to be more likely than not that the benefit of such deferred tax asset will not be realized in future periods. Tax benefits of operating loss carryforwards are evaluated on an ongoing basis, including a review of historical and projected future operating results, the eligible carryforward period, and other circumstances. If it becomes more likely than not that a tax asset will be used, the related valuation allowance on such assets would be reduced.\nThe Company recognizes tax benefits from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. Once this threshold has been met, the Company's measurement of its expected tax benefits is recognized in its consolidated financial statements. The Company accrues interest on unrecognized tax benefits as a component of income tax expense. Penalties, if incurred, would be recognized as a component of income tax expense.\n(L) Comprehensive Income (Loss)\nThe Company follows ASC Topic 220, Comprehensive Income, for the reporting and display of its comprehensive income (loss) and related components in the consolidated financial statements and thereby reports a measure of all changes in equity of an enterprise that results from transactions and economic events other than transactions with the shareholders. Items of comprehensive income (loss) are reported in both the consolidated statements of operations and comprehensive income and the consolidated statement of stockholders deficit.\nAccumulated other comprehensive income as presented on the consolidated balance sheets consisted of the accumulative foreign currency translation adjustment at period end.\n(M) Earnings (Loss) Per Common Share\nBasic earnings (loss) per common share are computed in accordance with ASC Topic 260, Earning per Share, by dividing the net income (loss) attributable to holders of common stock by the weighted average number of shares of common stock outstanding during the period. Diluted earnings (loss) per common share is computed by dividing net income (loss) by the weighted average number of common shares including the dilutive effect of common share equivalents then outstanding.\nThe diluted net profit/(loss) per common share is the same as the basic net profit/(loss) per share for the years ended December 31, 2021 and 2020 as all potential common shares including stock options and warrants are anti-dilutive and are therefore excluded from the computation of diluted net profit/(loss) per share.\n(N) Foreign Currency Translation\nThe assets and liabilities of the Companys subsidiaries and variable interest entity denominated in currencies other than U.S. dollars are translated into U.S. dollars using the applicable exchange rates at the balance sheet date. For consolidated statements of operations and comprehensive loss items, amounts denominated in currencies other than U.S. dollars were translated into U.S. dollars using the average exchange rate during the period. Equity accounts were translated at their historical exchange rates. Net gains and losses resulting from translation of foreign currency on consolidated financial statements are included in the statements of stockholders equity as accumulated other comprehensive income (loss). Foreign currency transaction gains and losses are reflected in the unaudited consolidated statements of operations and comprehensive income.\n(O) Fair Value of Financial Instruments\nASC Topic 820, Fair Value Measurements and Disclosure, defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities required or permitted to be recorded at fair value, the Company considers the principal or most advantageous market in which it would transact and it considers assumptions that market participants would use when pricing the asset or liability.\nIt establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. It establishes three levels of inputs that may be used to measure fair value:\nLevel 1 - Level 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Level 2 applies to assets or liabilities for which there are inputs other than quoted prices included within Level 1 that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3 - Level 3 applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe carrying value of the Companys financial instruments, which consist of cash, prepaid expenses and other current assets, accounts payable, accrued expenses and other payables, and convertible promissory notes approximates fair value due to the short-term maturities.\nThe carrying value of the Companys financial instruments related to warrants associated with convertible promissory notes is stated at a value being equal to the allocated proceeds of convertible promissory notes based on the relative fair value of notes and warrants. In the measurement of the fair value of these instruments, the Black-Scholes option pricing model is utilized, which is consistent with the Companys historical valuation techniques. These derived fair value estimates are significantly affected by the assumptions used. As the allocated value of the financial instruments related to warrants associated with convertible promissory notes is recorded in additional paid-in capital, the financial instruments related to warrants were not required to mark to market as of each subsequent reporting period. The carrying value of the Companys financial instruments related to options is measuring its fair value using the Black-Scholes option pricing model, which is consistent with the Companys historical valuation techniques. The fair value of option is recorded as dividend.\n(P) Recent Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (the FASB) issued Accounting Standards Update (ASU) 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12). ASU 2019-12 simplifies the accounting for income taxes by removing certain exceptions and enhances and simplifies various aspects of the income tax accounting guidance in ASC 740. ASU 2019-12 was effective January 1, 2021. The adoption of ASU 2019-12 did not have any impact on the Companys consolidated financial statement presentation or disclosures.\nIn January 2020, the FASB issued ASU 2020-01, Investments-Equity Securities (Topic 321), Investments-Equity Method and Joint Ventures (Topic 323), and Derivatives and Hedging (Topic 815), an amendment clarifying the interaction between accounting standards related to equity securities, equity method investments, and certain derivative instruments. The guidance is effective for fiscal years beginning after December 15, 2020. The Company adopted ASU 2020-01 effective January 1, 2021. The adoption of ASU 2020-01 did not have any impact on its consolidated financial statements.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (ASU 2020-06). ASU 2020-06 simplifies the accounting for convertible debt by eliminating the beneficial conversion and cash conversion accounting models. Upon adoption of ASU 2020-06, convertible debt proceeds, unless issued with a substantial premium or an embedded conversion feature that is not clearly and closely related to the host contract, will no longer be allocated between debt and equity components. This modification will reduce the issue discount and result in less non-cash interest expense in financial statements. ASU 2020-06 also updates the earnings per share calculation and requires entities to assume share settlement when the convertible debt can be settled in cash or shares. For contracts in an entitys own equity, the type of contracts primarily affected by ASU 2020-06 are freestanding and embedded features that are accounted for as derivatives under the current guidance due to a failure to meet the settlement assessment by removing the requirements to (i) consider whether the contract would be settled in registered shares, (ii) consider whether collateral is required to be posted, and (iii) assess shareholder rights. ASU 2020-06 is effective for fiscal years beginning after December 15, 2023. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, and only if adopted as of the beginning of such fiscal year. The Company is currently evaluating the impact of the new guidance on its consolidated financial statements.\nIn October 2020, the FASB issued ASU 2020-10, Codification Improvements, this ASU affects a wide variety of Topics in the Codification. They apply to all reporting entities within the scope of the affected accounting guidance. More specifically, this ASU, among other things, contains amendments that improve the consistency of the Codification by including all disclosure guidance in the appropriate Disclosure Section (Section 50). Many of the amendments arose because the FASB provided an option to give certain information either on the face of the financial statements or in the notes to financial statements and that option only was included in the Other Presentation Matters Section (Section 45) of the Codification. The option to disclose information in the notes to financial statements should have been codified in the Disclosure Section as well as the Other Presentation Matters Section (or other Section of the Codification in which the option to disclose in the notes to financial statements appears). Those amendments are not expected to change current practice. The amendments are effective for annual periods beginning after December 15, 2021, and interim periods within annual periods beginning after December 15, 2022. Early application of the amendments is permitted for and varies based on the entity. The amendments should be applied retrospectively and at the beginning of the period that includes the adoption date. The Company is currently evaluating the impact of the new guidance on its consolidated financial statements.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt - Modifications and Extinguishments (Subtopic 470-50), Compensation - Stock Compensation (Topic 718), and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Issuers Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options (ASU 2021-04). ASU 2021-04 provides guidance as to how an issuer should account for a modification of the terms or conditions or an exchange of a freestanding equity-classified written call option (i.e., a warrant) that remains classified after modification or exchange as an exchange of the original instrument for a new instrument. An issuer should measure the effect of a modification or exchange as the difference between the fair value of the modified or exchanged warrant and the fair value of that warrant immediately before modification or exchange and then apply a recognition model that comprises four categories of transactions and the corresponding accounting treatment for each category (equity issuance, debt origination, debt modification, and modifications unrelated to equity issuance and debt origination or modification). ASU 2021-04 is effective for all entities for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. An entity should apply the guidance provided in ASU 2021-04 prospectively to modifications or exchanges occurring on or after the effective date. Early adoption is permitted for all entities, including adoption in an interim period. If an entity elects to early adopt ASU 2021- 04 in an interim period, the guidance should be applied as of the beginning of the fiscal year that includes that interim period. The adoption of ASU 2021-04 is not expected to have any impact on the Companys consolidated financial statement presentation or disclosures.\nNOTE 3 SUBSIDIARIES AND VARIABLE INTEREST ENTITIES\nDetails of the Companys principal consolidated subsidiaries and variable interest entities as of December 31, 2021 were as follows:\nSchedule of subsidiaries and variable interest entities\nName\nPlace of\nIncorporation\nOwnership/Control\ninterest\nattributable to\nthe Company\nPrincipal activities\nNCN Group Limited\nBVI\n100%\nInvestment holding\nNCN Media Services Limited\nBVI\n100%\nInvestment holding\nCityhorizon Limited\nHong Kong\n100%\nInvestment holding\nNCN Group Management Limited\nHong Kong\n100%\nProvision of administrative and management services\nCrown Eagle Investment Limited\nHong Kong\n100%\nDormant\nCrown Winner International Limited\nHong Kong\n100%\nInvestment holding\nNCN Huamin Management Consultancy (Beijing)\nCompany Limited (2)\nPRC\n100%\nNot applicable\nHuizhong Lianhe Media Technology Co., Ltd. (2)\nPRC\n100%\nNot applicable\nBeijing Huizhong Bona Media Advertising Co.,\nLtd.(2)\nPRC\n100% (1)\nNot applicable\nXingpin Shanghai Advertising Limited(3)\nPRC\n100% (1)\nDormant\nChuanghua Shanghai Advertising Limited (3)\nPRC\n100%\nDormant\nJiahe Shanghai Advertising Limited (2)\nPRC\n100%\nNot applicable\nRemarks:\n1) Variable interest entity which the Company exerted 100% control through a set of commercial arrangements.\nNote:\n2) The subsidiary/variable interest entity s business license has been revoked.\n3) The subsidiary/variable interest entity was classified as abnormal operation business.\nNOTE 4 PREPAID EXPENSES AND OTHER CURRENT ASSETS, NET\nPrepaid expenses and other current assets, net as of December 31, 2021 and 2020 were as follows:\nSchedule of prepaid expenses and other current assets\nPrepaid expenses $ 4,443 $ 100,000\nRental and other deposits 15,385 -\nTotal $ 19,828 $ 100,000\nNOTE 5 EQUIPMENT, NET\nEquipment, net as of December 31, 2021 and 2020 consisted of the following:\nSchedule of equipment, net\nOffice equipment $ 3,039 $ 3,828\nLess: accumulated depreciation (407 ) (3,229 )\nTotal $ 2,632 $ 599\nDepreciation for the years ended December 31, 2021 and 2020 amounted to $389 and $456 respectively.\nPledge of Equipment\nNo equipment has been pledged by the Company.\nNOTE 6 ACCOUNTS PAYABLE, ACCRUED EXPENSES AND OTHER PAYABLES\nAccounts payable, accrued expenses and other payables as of December 31, 2021 and 2020 consisted of the following:\nSchedule of accounts payable, accrued expenses and other payables\nAccrued staff benefits and related fees $ 1,943,544 $ 1,749,401\nAccrued professional fees 61,057 47,266\nAccrued interest expenses 472,773 2,370,872\nOther accrued expenses 19,316 41,461\nOther payables 100,491 52,650\nTotal $ 2,597,181 $ 4,261,650\nNOTE 7 SHORT-TERM LOANS\nAs of December 31, 2021 and 2020, the Company recorded an aggregated amount of $2,973,211 of short-term loans. Those loans were borrowed from a shareholder and an unrelated individual. Except for loan of $128,205 from an unrelated individual that are unsecured, bearing yearly interest of 1% and are repayable on demand, the remaining loans are unsecured, bear a monthly interest of 1.5% and are repayable on demand. However, according to the agreement, the Company shall have the option to shorten or extend the life of those short-term loans if the need arises and the Company has agreed with the lender to extend the short-term loans on the due date. On January 18, 2022, the Company issued convertible notes of US$2,500,000 which is for setting off against the short-term loans and interest payable. As of the date of this report, the balance of $968,211 have not yet been repaid.\nThe interest expenses of the short-term loans for the years ended December 31, 2021 and 2020 amounted to $513,383 and $514,036, respectively.\nNOTE 8 CONVERTIBLE PROMISSORY NOTES AND WARRANTS\nNew 1% Convertible Promissory Notes, due in 2016\nOn November 19, 2007, the Company entered into a Note and Warrant Purchase Agreement, as amended (the Purchase Agreement) with Shanghai Quo Advertising Co. Ltd and affiliated investment funds of Och-Ziff Capital Management Group (the Investors) pursuant to which it agreed to issue in three tranches, 3% Senior Secured Convertible Promissory Notes due June 30, 2011, in the aggregate principal amount of up to $50,000,000 (the 3% Convertible Promissory Notes) and warrants to acquire an aggregate amount of 457,143 shares of the Companys Common Stock (the Warrants). Between November 19 and 28, 2007, the Company issued 3% Convertible Promissory Notes in the aggregate principal amount of $15,000,000, Warrants to purchase shares of the Companys common stock at $187.5 per share and Warrants to purchase shares of the Companys common stock at $262.5 per share. On January 31, 2008, the Company amended and restated the previously issued 3% Convertible Promissory Notes and issued to the Investors 3% Convertible Promissory Notes in the aggregate principal amount of $50,000,000 (the Amended and Restated Notes), Warrants to purchase shares of the Companys common stock at $187.5 per share and Warrants to purchase shares of the Companys common stock at $262.5 per share. In connection with the Amended and Restated Notes, the Company entered into a Security Agreement, dated as of January 31, 2008 (the Security Agreement), pursuant to which the Company granted to the collateral agent for the benefit of the Investors, a first-priority security interest in certain of the Companys assets, and 66% of the equity interest in the Company.\nOn April 2, 2009, the Company entered into a new financing arrangement with the previous holders of the Amended and Restated Notes (the Note Holders), and Keywin. Pursuant to a note exchange and option agreement, dated April 2, 2009 (the Note Exchange and Option Agreement), between the Company and Keywin, Keywin exchanged its Amended and Restated Note in the principal amount of $45,000,000, and all accrued and unpaid interest thereon, for 4,093,806 shares of the Companys common stock and an option to purchase an aggregate of 1,637,522 shares of the Companys common stock, for an aggregate purchase price of $2,000,000 (the Keywin Option). The Keywin Option was originally exercisable for a three-month period which commenced on April 2, 2009, but pursuant to several subsequent amendments, the exercise period has been extended to a hundred and fifty-three-month period ending on January 1, 2022, subject to the Companys right to unilaterally terminate the exercise period upon 30 days written notice. On June 1, 2021, the Company and Keywin, of which the Companys chief executive officer and director is the director and his spouse is the sole shareholder, entered into an Amendment, pursuant to which the Company agreed Keywin to purchase an aggregate of 11,764,756 shares of the Companys common stock for an aggregate purchase price of $2,000,000. On October 28, 2021, Keywin exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000.\nPursuant to a note exchange agreement, dated April 2, 2009, among the Company and the Note Holders, the parties agreed to cancel their Amended and Restated Notes in the principal amount of $5,000,000 (including all accrued and unpaid interest thereon), and all of the warrants, in exchange for the Companys issuance of the 1% unsecured senior convertible promissory notes due 2012 in the principal amount of $5,000,000 (the 1% Convertible Promissory Notes). The 1% Convertible Promissory Notes bear interest at 1% per annum, are payable semi-annually in arrears, mature on April 1, 2012, and are convertible at any time by the holder into shares of the Companys common stock at an initial conversion price of $1.7445 per share, subject to customary anti-dilution adjustments. In addition, in the event of a default, the holders will have the right to redeem the 1% Convertible Promissory Notes at 110% of the principal amount, plus any accrued and unpaid interest. The parties also agreed to terminate the Security Agreement and release all security interests arising out of the Purchase Agreement and the Amended and Restated Notes.\nThe 1% Convertible Promissory Notes matured on April 1, 2012 and on the same date, the Company and the Note Holders agreed to the following: (1) extension of the maturity date of the 1% Convertible Promissory Notes for a period of two years and (2) modification of the 1% Convertible Promissory Notes to be convertible at any time into shares of the Companys common stock at a conversion price of $1.3956 per share, subject to customary anti-dilution adjustments. In all other respects not specifically mentioned, the terms of the 1% Convertible Promissory Notes shall remain the same and shall be fully enforceable in accordance with its terms. Subsequently, the Company issued new 1% convertible promissory notes (the New 1% Convertible Promissory Notes) to the Note Holders. The New 1% Convertible Promissory Notes bear interest at 1% per annum, are payable semi-annually in arrears, mature on April 1, 2014, and are convertible at any time by the Note Holders into shares of the Companys common stock at an initial conversion price of $1.3956 per share, subject to customary anti-dilution adjustments. In addition, in the event of a default, the Note Holders will have the right to redeem the New 1% Convertible Promissory Notes at 110% of the principal amount, plus any accrued and unpaid interest.\nThe 1% Convertible Promissory Notes matured on April 1, 2014 and on March 12, 2014, the Company and the respective holders agreed to extend the maturity date of the 1% Convertible Promissory Notes for a period of two years until April 1, 2016. In all other respects not specifically mentioned, the terms of the 1% Convertible Promissory Notes shall remain the same and shall be fully enforceable in accordance with its terms.\nOn April 29, 2016, the Company received a reservation of rights letter from the note holders to reserves all of its powers, rights and privileges.\nOn December 16, 2020, the Company received Abandonment of interest from the note holders to abandon, relinquish, and surrender all their rights and obligations under the Notes and they confirmed to receive no consideration in exchange for the Notes. Thus, the Company recognized a gain on extinguishment of debt from continuing operations of $5,299,726 for the year ended December 31, 2020.\n5) Issuance of New 1% Convertible Promissory Notes, due 2025 in\nOn January 14, 2020, the Company entered into a Subscription Agreement with Tsang Wai Yee Terri (the Subscriber) under which the Subscriber agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of six hundred and forty-five thousand US Dollars ($645,000). On the same date, the Company signed the 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the Subscriber up to an aggregate maximum amount of $645,000 in principal amount of Convertible Notes prior to January 13, 2025. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.00 per share.\nThe following table details the accounting treatment of the convertible promissory notes:\nSchedule of convertible promissory notes\nNew 1%\nConvertible\nPromissory\nNotes, due in\nNew 1%\nConvertible\nPromissory\nNotes, due in\nTotal\nNet carrying value of convertible promissory notes as of\nDecember 31, 2019 $ 5,000,000 $ - $ 5,000,000\nProceeds of new 1% convertible promissory notes - 645,000 645,000\nAbandonment of note (5,000,000 ) - (5,000,000 )\nNet carrying value of convertible promissory notes as of\nDecember 31, 2020 & 2021 $ - $ 645,000 $ 645,000\nInterest Expense\nThe following table details the interest expenses:\nSchedule of interest expenses\nYears Ended December 31,\nNew 1% convertible promissory notes, due in 2016 $ - $ 12,329\nNew 1% convertible promissory notes, due in 2025 6,468 6,238\nTotal $ 6,468 $ 18,567\nNOTE 9 LEASE LIABILITIES\nOn September 27, 2021, the Company entered into a lease agreement for office in Hong Kong with a two-year term, commencing on September 27, 2021 and expiring on September 26, 2023.\nThe operating lease expense for the years ended December 31, 2021 and 2020 were as follows:\nSchedule of operating lease expense\nOperating lease cost - straight line $ 15,385 $ -\nAs of December 31, 2021, future minimum commitments under the Companys non-cancelable operating lease, in accordance with ASC 842, are as follows:\nSchedule of future minimum operating lease payments\nFiscal years ending December 31, Operating\nleases\n$ 46,154\n30,769\n-\n-\nThereafter -\nTotal undiscounted cash flows 76,923\nLes: imputed interest (1,402 )\nPresent value of lease liabilities $ 75,521\nAs of December 31, 2021, the remaining weighted-average lease term was 1.74 years and the weighted-average incremental borrowing rate used to determine the operating lease liabilities was 2.33%.\nSupplementary cash flow information related to lease where the Company was the lessee for the years ended December 31, 2021 and 2020 was as follows:\nSchedule of supplementary cash flow information\nOperating cash outflows from operating lease $ 15,385 $ -\nNON-CASH OPERATING ACTIVITIES\nRight-of-use assets obtained in exchange for new operating lease liabilities 90,277 -\nNOTE 10 COMMITMENTS AND CONTINGENCIES\nContingencies\nThe Company accounts for loss contingencies in accordance with ASC Topic 450 and other related guidelines. As of December 31, 2021 and 2020, the Companys management is of the opinion that there are no commitments and contingencies to account for.\nNOTE 11 STOCKHOLDERS DEFICIT\n(A) Stock, Options and Warrants Issued for Services\nOn October 28, 2021, Keywin exercised its option to purchase an aggregate of 11,764,756 shares of the Company common stock for an aggregate purchase price of $2,000,000.\nOn November 30, 2021, the Company completed private placement of 200,000 shares of restricted common stock at $3 per share. The transaction took place with an investor and generated gross proceeds of $600,000 for the year ended December 31, 2021. In March 2018, the Company entered into an escrow agent services agreement with an escrow agent. Pursuant to the agreement, the Company agreed to pay 5% of escrow funds from invest as compensation, the escrow agent was granted 10,000 shares for his services rendered and the Company issued 10,000 shares to the consultant. In connection with this stock grants and in accordance with ASC Topic 718, the Company recognized $30,000 of non-cash stock-based compensation included in general and administrative expenses on the consolidated statements of operation for the year ended December 31, 2021.\nOn December 30, 2021, the Board of Director granted an aggregate of 132,172 shares of common stock to the directors of the Company for their services rendered during the year 2021 and 2022. Each director was granted shares of the Companys common stock and vested in 2021: Earnest Leung, 52,172 shares; Wong Wing Kong, 15,000 shares; and Shirley Cheng, 50,000 shares and Frederick Wong granted 15,000 shares and vested in 2022. In connection with these stock grants and in accordance with ASC Topic 718, the Company recognized $187,475 and $nil of non-cash stock-based compensation included in general and administrative expenses on the consolidated statements of operations for the year ended December 31, 2021 and 2020, respectively.\n(B) Restriction on payment of dividends\nThe Company has not declared any dividends since incorporation. For instance, the terms of the outstanding promissory notes issued January 14, 2020 contain restrictions on the payment of dividends. The dividend restrictions provide that the Company or any of its subsidiaries shall not declare or pay dividends or other distributions in respect of the equity securities of such entity other than dividends or distributions of cash which amounts during any 12-month period that exceed ten percent (10%) of the consolidated net income of the Company based on the Companys most recent audited consolidated financial statements disclosed in the Companys annual report on Form 10-K (or equivalent form) filed with the U.S. Securities and Exchange Commission.\nNOTE 12 RELATED PARTY TRANSACTIONS\nExcept as set forth below, during the years ended December 31, 2021 and 2020, the Company did not enter into any material transactions or series of transactions that would be considered material in which any officer, director or beneficial owner of 5% or more of any class of the Companys capital stock, or any immediate family member of any of the preceding persons, had a direct or indirect material interest.\nIn April 2009, in connection with debt restructuring, Statezone Ltd. of which Dr. Earnest Leung, the Companys Chief Executive Officer and a Director (being appointed on July 15, 2009 and May 11, 2009, respectively) was the sole director, provided agency and financial advisory services to the Company. Accordingly, the Company paid an aggregate service fee of $350,000, of which $250,000 has been recorded as issuance costs for 1% Convertible Promissory Notes and $100,000 has been recorded as prepaid expenses and other current assets, net since April 2009. Such $100,000 is refundable unless the Keywin Option is exercised and completed. On October 28, 2021, Keywin exercised its option and $100,000 was recorded in general and administrative expenses during the year ended December 31, 2021.\nOn July 1, 2009, the Company and Keywin, of which the Companys chief executive officer and director is the director and his spouse is the sole shareholder, entered into an Amendment, pursuant to which the Company agreed to extend the exercise period for the Keywin Option under the Note Exchange and Option Agreement between the Company and Keywin, to purchase an aggregate of 1,637,522 shares of our common stock for an aggregate purchase price of $2,000,000, from a three-month period ended on July 1, 2009, to a six-month period ended October 1, 2009. The exercise period for the Keywin option was subsequently further extended to a nine-month period ended January 1, 2010, pursuant to the Second Amendment. On January 1, 2010, the Company and Keywin entered into the third Amendment, pursuant to which the Company agreed to further extend the exercise period to an eighteen-month period ended on October 1, 2010, and provide the Company with the right to unilaterally terminate the exercise period upon 30 days written notice. On September 30, 2010, the exercise price was extended at various times from September 1, 2010 to December 31, 2017 and the Keywin Option was further extended to a hundred and twenty-nine-month period ending on January 1, 2020 and the exercise price changed to $0.99. On December 31, 2019, the latest exercise period for the Keywin Option was further extended to a hundred and fifty-three-month period ending on January 1, 2022. On June 1, 2021, the Company and Keywin, of which the Companys chief executive officer and director is the director and his spouse is the sole shareholder, entered into an Amendment, pursuant to which the Company agreed Keywin to purchase an aggregate of 11,764,756 shares of the Companys common stock for an aggregate purchase price of $2,000,000. The fair value of the purchase option was determined utilizing Black-Scholes option pricing model on the date before the modification and after modification, accordingly, the Company recorded $3,544,430 and $nil as dividend for the year ended December 31, 2021 and 2020, respectively.\nOn October 28, 2021, Keywin exercised its option to purchase an aggregate of 11,764,756 shares of the Companys common stock for an aggregate purchase price of $2,000,000 which for setting off against the Companys obligation to repay part of the short term loan interest payable, there was no cash proceeds from the exercise of Keywin option..\nAs of December 31, 2021 and 2020, the Company recorded an aggregated amount of $2,845,006 of short-term loans from a shareholder that the loans are unsecured, bear a monthly interest of 1.5% and repayable on demand. However, according to the agreements, the Company shall have the option to shorten or extend the life of those short-term loans if the need arises and the Company has agreed with the shareholder to extend the short-term loans on the due date. As of December 31, 2021 and 2020, the Company recorded an interest payable recorded in accounts payable, accrued expenses and other payables of $470,315 and $2,363,485, respectively. The interest expenses of the short-term loans from continuing operations for the years ended December 31, 2021 and 2020 amounted to $512,101 and $512,863, respectively. On January 18, 2022, the shareholder agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company and converted the short-term loan and interest payable to convertible note. As of the date of this report, except the loan and interest payable balance of $2,500,000 converted to convertible note, the remaining loans have not yet been repaid.\nNOTE 13 GAIN FROM WRITE-OFF OF LONG-AGED PAYABLES\nThe Company considered the payment of the outstanding payables have not been claimed due to loss of contact and it is in the best interests of Company to write off the long-aged payables. The Company has resolved that they are of the opinion that the obligation for future settlement of accrued long-aged payables are remote, therefore the related accruals have been written off $708 and $394,522 were written off for the year ended December 31, 2021 and 2020, respectively.\nNOTE 14 NET (LOSS) PROFIT PER COMMON SHARE\nNet (loss) profit per share information for the years ended December 31, 2021 and 2020 was as follows:\nSchedule of net (loss) profit per common share\nNumerator:\nNet (loss) profit attributable to NCN common stockholders $ (1,215,636 ) $ 4,869,156\nDenominator:\nWeighted average number of shares outstanding, basic* 11,023,767 8,774,263\nEffect of dilutive securities\nOptions and warrants - -\nWeighted average number of shares outstanding, diluted 11,023,767 8,774,263\nNet (loss) profit per common share - basic and diluted $ (0.11 ) $ 0.55\n* Including 253,172 and 136,000 shares that were granted and vested but not yet issued for the years ended December 31, 2021 and 2020, respectively.\nThe diluted net (loss) profit per common share is the same as the basic net (loss) profit per common share for the years ended December 31, 2021 and 2020 as the ordinary shares issuable under stock options and warrants outstanding are anti-dilutive and are therefore excluded from the computation of diluted net (loss) profit per common share.\nNOTE 16 INCOME TAXES\nIncome is subject to taxation in various countries in which the Company and its subsidiaries operate or are incorporated. The (loss) profit before income taxes by geographical locations for the years ended December 31, 2021 and 2020 were summarized as follows:\nSchedule of (income) loss before income taxes by geographical locations\nUnited States $ (469,314 ) $ 5,264,518\nForeign (746,322 ) (395,362 )\n$ (1,215,636 ) $ 4,869,156\nThe provision for income taxes consisted of the following:\nSchedule of provision for income taxes\nYear ended December 31,\n(Loss) Profit before income taxes $ (1,215,636 ) $ 4,869,156\nStatutory income tax rate 21 % 21 %\nIncome tax credit computed at statutory income rate (255,284 ) 1,022,523\nReconciling items:\nNon-deductible expenses 156,211 82,304\nShare-based payments 45,670 -\nTax effect of tax exempt entity\nValuation allowance on deferred tax assets 52,886 (1,105,549 )\nIncome tax $ - $ -\nOther than the United States, the Company is subject to taxation in Hong Kong and PRC. Under Hong Kong tax laws, deferred tax assets are recognized for tax loss carried forward to the extent that the realization of the related tax benefit through future taxable profits is probable. These tax losses do not expire under current Hong Kong tax legislation. Under PRC tax laws, tax losses may be carried forward for 5 years and no carry-back is allowed. At December 31, 2021 the Company does not have available tax losses in the Hong Kong and PRC to utilize for future taxable profits.\nThe Coronavirus Aid, Relief and Economic Security Act (the CARES Act) was enacted on March 27, 2020. There are several different provisions with the CARES Act that impact income taxes for corporations. The Company has evaluated the tax implications and believes these provisions did not have a material impact to the financial statements.\nAt December 31, 2021, the Company had an unused net operating loss carryforward of approximately $16,649,913 for income tax purposes. This net operating loss carryforward may result in future income tax benefits of approximately $3,496,482, which will expire on various from 2024 through 2037 as follows:\nSchedule of operating loss carryforward\n2024 to 2028 $ 2,332,033\n2029 to 2033 892,375\n2034 to 2037 217,937\nIndefinitely 54,137\n$ 3,496,482\nAt December 31, 2020, the Company had an unused net operating loss carryforward of approximately $16,398,074 for income tax purposes. This net operating loss carryforward may result in future income tax benefits of approximately $3,443,596, which will expire on various from 2024 through 2037 as follows:\n2024 to 2028 $ 2,279,147\n2029 to 2033 892,375\n2034 to 2037 217,937\nIndefinitely 54,137\n$ 3,443,596\nThe realization of net operating loss carryforward is uncertain at this time, a valuation allowance in the same amount has been established. Deferred income taxes reflect the net effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes.\nSignificant components of the Companys deferred tax liabilities and assets of December 31, 2021 and 2020 are as follows:\nSchedule of deferred tax liabilities and deferred tax assets\nDeferred tax liabilities $ - $ -\nDeferred tax assets:\nEffect of net operating loss carried forward 3,496,482 3,443,596\nLess: valuation allowance (3,496,482 ) (3,443,596 )\nNet deferred tax assets $ - $ -\nMovement of valuation allowance:\nSchedule of movement of valuation allowance\nAt the beginning of the year $ 3,443,596 $ 4,549,144\nCurrent year addition (reduction) 52,886 (1,105,548 )\nAt the end of the year $ 3,496,482 $ 3,443,596\nNOTE 18 SUBSEQUENT EVENTS\nOn January 18, 2022, the Company entered into a Subscription Agreement with the Subscriber under which the Subscriber agreed to purchase the 1% Senior Unsecured Convertible Note Agreement from the Company for an agreement purchase price of two million five hundred thousand US Dollars ($2,500,000). On the same date, the Company signed the with 1% Senior Unsecured Convertible Note Agreement under which the Company may sell and issue to the Subscriber up to an aggregate maximum amount of $2,500,000 in principal amount of Convertible Notes prior to January 19, 2027. The Convertible Promissory Notes issued to the Investor are convertible at the holders option into shares of Company common stock at $1.25 per share. The issuance of convertible note is for setting off against the Companys obligation to repay part of the short-term loan and interest payable, there was no cash proceeds from the issuance of convertible notes."
}